keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  21C8, Message Object  Interrupt Pointer Register */
#define CAN_MO142_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A1C8u)

/** Alias (User Manual Name) for CAN_MO142_IPR.
* To use register names with standard convension, please use CAN_MO142_IPR.
*/
#define	CAN_MOIPR142	(CAN_MO142_IPR)

/** \\brief  21EC, Message Object  Acceptance Mask Register */
#define CAN_MO143_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A1ECu)

/** Alias (User Manual Name) for CAN_MO143_AMR.
* To use register names with standard convension, please use CAN_MO143_AMR.
*/
#define	CAN_MOAMR143	(CAN_MO143_AMR)

/** \\brief  21F8, Message Object  Arbitration Register */
#define CAN_MO143_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A1F8u)

/** Alias (User Manual Name) for CAN_MO143_AR.
* To use register names with standard convension, please use CAN_MO143_AR.
*/
#define	CAN_MOAR143	(CAN_MO143_AR)

/** \\brief  21FC, Message Object  Control Register */
#define CAN_MO143_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A1FCu)

/** Alias (User Manual Name) for CAN_MO143_CTR_STAT.
* To use register names with standard convension, please use CAN_MO143_CTR_STAT.
*/
#define	CAN_MOSTAT143	(CAN_MO143_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO143_CTR_STAT.
* To use register names with standard convension, please use CAN_MO143_CTR_STAT.
*/
#define	CAN_MOCTR143	(CAN_MO143_CTR_STAT)

/** \\brief  21F4, Message Object  Data Register High */
#define CAN_MO143_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A1F4u)

/** Alias (User Manual Name) for CAN_MO143_DATAH.
* To use register names with standard convension, please use CAN_MO143_DATAH.
*/
#define	CAN_MODATAH143	(CAN_MO143_DATAH)

/** \\brief  21F0, Message Object  Data Register Low */
#define CAN_MO143_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A1F0u)

/** Alias (User Manual Name) for CAN_MO143_DATAL.
* To use register names with standard convension, please use CAN_MO143_DATAL.
*/
#define	CAN_MODATAL143	(CAN_MO143_DATAL)

/** \\brief  21E0, Message Object  Function Control Register */
#define CAN_MO143_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A1E0u)

/** Alias (User Manual Name) for CAN_MO143_FCR.
* To use register names with standard convension, please use CAN_MO143_FCR.
*/
#define	CAN_MOFCR143	(CAN_MO143_FCR)

/** \\brief  21E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO143_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A1E4u)

/** Alias (User Manual Name) for CAN_MO143_FGPR.
* To use register names with standard convension, please use CAN_MO143_FGPR.
*/
#define	CAN_MOFGPR143	(CAN_MO143_FGPR)

/** \\brief  21E8, Message Object  Interrupt Pointer Register */
#define CAN_MO143_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A1E8u)

/** Alias (User Manual Name) for CAN_MO143_IPR.
* To use register names with standard convension, please use CAN_MO143_IPR.
*/
#define	CAN_MOIPR143	(CAN_MO143_IPR)

/** \\brief  220C, Message Object  Acceptance Mask Register */
#define CAN_MO144_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A20Cu)

/** Alias (User Manual Name) for CAN_MO144_AMR.
* To use register names with standard convension, please use CAN_MO144_AMR.
*/
#define	CAN_MOAMR144	(CAN_MO144_AMR)

/** \\brief  2218, Message Object  Arbitration Register */
#define CAN_MO144_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A218u)

/** Alias (User Manual Name) for CAN_MO144_AR.
* To use register names with standard convension, please use CAN_MO144_AR.
*/
#define	CAN_MOAR144	(CAN_MO144_AR)

/** \\brief  221C, Message Object  Control Register */
#define CAN_MO144_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A21Cu)

/** Alias (User Manual Name) for CAN_MO144_CTR_STAT.
* To use register names with standard convension, please use CAN_MO144_CTR_STAT.
*/
#define	CAN_MOSTAT144	(CAN_MO144_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO144_CTR_STAT.
* To use register names with standard convension, please use CAN_MO144_CTR_STAT.
*/
#define	CAN_MOCTR144	(CAN_MO144_CTR_STAT)

/** \\brief  2214, Message Object  Data Register High */
#define CAN_MO144_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A214u)

/** Alias (User Manual Name) for CAN_MO144_DATAH.
* To use register names with standard convension, please use CAN_MO144_DATAH.
*/
#define	CAN_MODATAH144	(CAN_MO144_DATAH)

/** \\brief  2210, Message Object  Data Register Low */
#define CAN_MO144_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A210u)

/** Alias (User Manual Name) for CAN_MO144_DATAL.
* To use register names with standard convension, please use CAN_MO144_DATAL.
*/
#define	CAN_MODATAL144	(CAN_MO144_DATAL)

/** \\brief  2200, Message Object  Function Control Register */
#define CAN_MO144_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A200u)

/** Alias (User Manual Name) for CAN_MO144_FCR.
* To use register names with standard convension, please use CAN_MO144_FCR.
*/
#define	CAN_MOFCR144	(CAN_MO144_FCR)

/** \\brief  2204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO144_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A204u)

/** Alias (User Manual Name) for CAN_MO144_FGPR.
* To use register names with standard convension, please use CAN_MO144_FGPR.
*/
#define	CAN_MOFGPR144	(CAN_MO144_FGPR)

/** \\brief  2208, Message Object  Interrupt Pointer Register */
#define CAN_MO144_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A208u)

/** Alias (User Manual Name) for CAN_MO144_IPR.
* To use register names with standard convension, please use CAN_MO144_IPR.
*/
#define	CAN_MOIPR144	(CAN_MO144_IPR)

/** \\brief  222C, Message Object  Acceptance Mask Register */
#define CAN_MO145_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A22Cu)

/** Alias (User Manual Name) for CAN_MO145_AMR.
* To use register names with standard convension, please use CAN_MO145_AMR.
*/
#define	CAN_MOAMR145	(CAN_MO145_AMR)

/** \\brief  2238, Message Object  Arbitration Register */
#define CAN_MO145_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A238u)

/** Alias (User Manual Name) for CAN_MO145_AR.
* To use register names with standard convension, please use CAN_MO145_AR.
*/
#define	CAN_MOAR145	(CAN_MO145_AR)

