keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2270, Message Object  Data Register Low */
#define CAN_MO147_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A270u)

/** Alias (User Manual Name) for CAN_MO147_DATAL.
* To use register names with standard convension, please use CAN_MO147_DATAL.
*/
#define	CAN_MODATAL147	(CAN_MO147_DATAL)

/** \\brief  2260, Message Object  Function Control Register */
#define CAN_MO147_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A260u)

/** Alias (User Manual Name) for CAN_MO147_FCR.
* To use register names with standard convension, please use CAN_MO147_FCR.
*/
#define	CAN_MOFCR147	(CAN_MO147_FCR)

/** \\brief  2264, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO147_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A264u)

/** Alias (User Manual Name) for CAN_MO147_FGPR.
* To use register names with standard convension, please use CAN_MO147_FGPR.
*/
#define	CAN_MOFGPR147	(CAN_MO147_FGPR)

/** \\brief  2268, Message Object  Interrupt Pointer Register */
#define CAN_MO147_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A268u)

/** Alias (User Manual Name) for CAN_MO147_IPR.
* To use register names with standard convension, please use CAN_MO147_IPR.
*/
#define	CAN_MOIPR147	(CAN_MO147_IPR)

/** \\brief  228C, Message Object  Acceptance Mask Register */
#define CAN_MO148_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A28Cu)

/** Alias (User Manual Name) for CAN_MO148_AMR.
* To use register names with standard convension, please use CAN_MO148_AMR.
*/
#define	CAN_MOAMR148	(CAN_MO148_AMR)

/** \\brief  2298, Message Object  Arbitration Register */
#define CAN_MO148_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A298u)

/** Alias (User Manual Name) for CAN_MO148_AR.
* To use register names with standard convension, please use CAN_MO148_AR.
*/
#define	CAN_MOAR148	(CAN_MO148_AR)

/** \\brief  229C, Message Object  Control Register */
#define CAN_MO148_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A29Cu)

/** Alias (User Manual Name) for CAN_MO148_CTR_STAT.
* To use register names with standard convension, please use CAN_MO148_CTR_STAT.
*/
#define	CAN_MOSTAT148	(CAN_MO148_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO148_CTR_STAT.
* To use register names with standard convension, please use CAN_MO148_CTR_STAT.
*/
#define	CAN_MOCTR148	(CAN_MO148_CTR_STAT)

/** \\brief  2294, Message Object  Data Register High */
#define CAN_MO148_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A294u)

/** Alias (User Manual Name) for CAN_MO148_DATAH.
* To use register names with standard convension, please use CAN_MO148_DATAH.
*/
#define	CAN_MODATAH148	(CAN_MO148_DATAH)

/** \\brief  2290, Message Object  Data Register Low */
#define CAN_MO148_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A290u)

/** Alias (User Manual Name) for CAN_MO148_DATAL.
* To use register names with standard convension, please use CAN_MO148_DATAL.
*/
#define	CAN_MODATAL148	(CAN_MO148_DATAL)

/** \\brief  2280, Message Object  Function Control Register */
#define CAN_MO148_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A280u)

/** Alias (User Manual Name) for CAN_MO148_FCR.
* To use register names with standard convension, please use CAN_MO148_FCR.
*/
#define	CAN_MOFCR148	(CAN_MO148_FCR)

/** \\brief  2284, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO148_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A284u)

/** Alias (User Manual Name) for CAN_MO148_FGPR.
* To use register names with standard convension, please use CAN_MO148_FGPR.
*/
#define	CAN_MOFGPR148	(CAN_MO148_FGPR)

/** \\brief  2288, Message Object  Interrupt Pointer Register */
#define CAN_MO148_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A288u)

/** Alias (User Manual Name) for CAN_MO148_IPR.
* To use register names with standard convension, please use CAN_MO148_IPR.
*/
#define	CAN_MOIPR148	(CAN_MO148_IPR)

/** \\brief  22AC, Message Object  Acceptance Mask Register */
#define CAN_MO149_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A2ACu)

/** Alias (User Manual Name) for CAN_MO149_AMR.
* To use register names with standard convension, please use CAN_MO149_AMR.
*/
#define	CAN_MOAMR149	(CAN_MO149_AMR)

/** \\brief  22B8, Message Object  Arbitration Register */
#define CAN_MO149_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A2B8u)

/** Alias (User Manual Name) for CAN_MO149_AR.
* To use register names with standard convension, please use CAN_MO149_AR.
*/
#define	CAN_MOAR149	(CAN_MO149_AR)

/** \\brief  22BC, Message Object  Control Register */
#define CAN_MO149_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A2BCu)

/** Alias (User Manual Name) for CAN_MO149_CTR_STAT.
* To use register names with standard convension, please use CAN_MO149_CTR_STAT.
*/
#define	CAN_MOSTAT149	(CAN_MO149_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO149_CTR_STAT.
* To use register names with standard convension, please use CAN_MO149_CTR_STAT.
*/
#define	CAN_MOCTR149	(CAN_MO149_CTR_STAT)

/** \\brief  22B4, Message Object  Data Register High */
#define CAN_MO149_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A2B4u)

/** Alias (User Manual Name) for CAN_MO149_DATAH.
* To use register names with standard convension, please use CAN_MO149_DATAH.
*/
#define	CAN_MODATAH149	(CAN_MO149_DATAH)

/** \\brief  22B0, Message Object  Data Register Low */
#define CAN_MO149_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A2B0u)

/** Alias (User Manual Name) for CAN_MO149_DATAL.
* To use register names with standard convension, please use CAN_MO149_DATAL.
*/
#define	CAN_MODATAL149	(CAN_MO149_DATAL)

/** \\brief  22A0, Message Object  Function Control Register */
#define CAN_MO149_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A2A0u)

/** Alias (User Manual Name) for CAN_MO149_FCR.
* To use register names with standard convension, please use CAN_MO149_FCR.
*/
#define	CAN_MOFCR149	(CAN_MO149_FCR)

/** \\brief  22A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO149_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A2A4u)

/** Alias (User Manual Name) for CAN_MO149_FGPR.
* To use register names with standard convension, please use CAN_MO149_FGPR.
*/
#define	CAN_MOFGPR149	(CAN_MO149_FGPR)

/** \\brief  22A8, Message Object  Interrupt Pointer Register */
#define CAN_MO149_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A2A8u)

