keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO149_IPR.
* To use register names with standard convension, please use CAN_MO149_IPR.
*/
#define	CAN_MOIPR149	(CAN_MO149_IPR)

/** \\brief  11CC, Message Object  Acceptance Mask Register */
#define CAN_MO14_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00191CCu)

/** Alias (User Manual Name) for CAN_MO14_AMR.
* To use register names with standard convension, please use CAN_MO14_AMR.
*/
#define	CAN_MOAMR14	(CAN_MO14_AMR)

/** \\brief  11D8, Message Object  Arbitration Register */
#define CAN_MO14_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00191D8u)

/** Alias (User Manual Name) for CAN_MO14_AR.
* To use register names with standard convension, please use CAN_MO14_AR.
*/
#define	CAN_MOAR14	(CAN_MO14_AR)

/** \\brief  11DC, Message Object  Control Register */
#define CAN_MO14_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00191DCu)

/** Alias (User Manual Name) for CAN_MO14_CTR_STAT.
* To use register names with standard convension, please use CAN_MO14_CTR_STAT.
*/
#define	CAN_MOSTAT14	(CAN_MO14_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO14_CTR_STAT.
* To use register names with standard convension, please use CAN_MO14_CTR_STAT.
*/
#define	CAN_MOCTR14	(CAN_MO14_CTR_STAT)

/** \\brief  11D4, Message Object  Data Register High */
#define CAN_MO14_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00191D4u)

/** Alias (User Manual Name) for CAN_MO14_DATAH.
* To use register names with standard convension, please use CAN_MO14_DATAH.
*/
#define	CAN_MODATAH14	(CAN_MO14_DATAH)

/** \\brief  11D0, Message Object  Data Register Low */
#define CAN_MO14_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00191D0u)

/** Alias (User Manual Name) for CAN_MO14_DATAL.
* To use register names with standard convension, please use CAN_MO14_DATAL.
*/
#define	CAN_MODATAL14	(CAN_MO14_DATAL)

/** \\brief  11C0, Message Object  Function Control Register */
#define CAN_MO14_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00191C0u)

/** Alias (User Manual Name) for CAN_MO14_FCR.
* To use register names with standard convension, please use CAN_MO14_FCR.
*/
#define	CAN_MOFCR14	(CAN_MO14_FCR)

/** \\brief  11C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO14_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00191C4u)

/** Alias (User Manual Name) for CAN_MO14_FGPR.
* To use register names with standard convension, please use CAN_MO14_FGPR.
*/
#define	CAN_MOFGPR14	(CAN_MO14_FGPR)

/** \\brief  11C8, Message Object  Interrupt Pointer Register */
#define CAN_MO14_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00191C8u)

/** Alias (User Manual Name) for CAN_MO14_IPR.
* To use register names with standard convension, please use CAN_MO14_IPR.
*/
#define	CAN_MOIPR14	(CAN_MO14_IPR)

/** \\brief  22CC, Message Object  Acceptance Mask Register */
#define CAN_MO150_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A2CCu)

/** Alias (User Manual Name) for CAN_MO150_AMR.
* To use register names with standard convension, please use CAN_MO150_AMR.
*/
#define	CAN_MOAMR150	(CAN_MO150_AMR)

/** \\brief  22D8, Message Object  Arbitration Register */
#define CAN_MO150_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A2D8u)

/** Alias (User Manual Name) for CAN_MO150_AR.
* To use register names with standard convension, please use CAN_MO150_AR.
*/
#define	CAN_MOAR150	(CAN_MO150_AR)

/** \\brief  22DC, Message Object  Control Register */
#define CAN_MO150_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A2DCu)

/** Alias (User Manual Name) for CAN_MO150_CTR_STAT.
* To use register names with standard convension, please use CAN_MO150_CTR_STAT.
*/
#define	CAN_MOCTR150	(CAN_MO150_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO150_CTR_STAT.
* To use register names with standard convension, please use CAN_MO150_CTR_STAT.
*/
#define	CAN_MOSTAT150	(CAN_MO150_CTR_STAT)

/** \\brief  22D4, Message Object  Data Register High */
#define CAN_MO150_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A2D4u)

/** Alias (User Manual Name) for CAN_MO150_DATAH.
* To use register names with standard convension, please use CAN_MO150_DATAH.
*/
#define	CAN_MODATAH150	(CAN_MO150_DATAH)

/** \\brief  22D0, Message Object  Data Register Low */
#define CAN_MO150_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A2D0u)

/** Alias (User Manual Name) for CAN_MO150_DATAL.
* To use register names with standard convension, please use CAN_MO150_DATAL.
*/
#define	CAN_MODATAL150	(CAN_MO150_DATAL)

/** \\brief  22C0, Message Object  Function Control Register */
#define CAN_MO150_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A2C0u)

/** Alias (User Manual Name) for CAN_MO150_FCR.
* To use register names with standard convension, please use CAN_MO150_FCR.
*/
#define	CAN_MOFCR150	(CAN_MO150_FCR)

/** \\brief  22C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO150_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A2C4u)

/** Alias (User Manual Name) for CAN_MO150_FGPR.
* To use register names with standard convension, please use CAN_MO150_FGPR.
*/
#define	CAN_MOFGPR150	(CAN_MO150_FGPR)

/** \\brief  22C8, Message Object  Interrupt Pointer Register */
#define CAN_MO150_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A2C8u)

/** Alias (User Manual Name) for CAN_MO150_IPR.
* To use register names with standard convension, please use CAN_MO150_IPR.
*/
#define	CAN_MOIPR150	(CAN_MO150_IPR)

/** \\brief  22EC, Message Object  Acceptance Mask Register */
#define CAN_MO151_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A2ECu)

/** Alias (User Manual Name) for CAN_MO151_AMR.
* To use register names with standard convension, please use CAN_MO151_AMR.
*/
#define	CAN_MOAMR151	(CAN_MO151_AMR)

/** \\brief  22F8, Message Object  Arbitration Register */
#define CAN_MO151_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A2F8u)

/** Alias (User Manual Name) for CAN_MO151_AR.
* To use register names with standard convension, please use CAN_MO151_AR.
*/
#define	CAN_MOAR151	(CAN_MO151_AR)

/** \\brief  22FC, Message Object  Control Register */
#define CAN_MO151_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A2FCu)

/** Alias (User Manual Name) for CAN_MO151_CTR_STAT.
* To use register names with standard convension, please use CAN_MO151_CTR_STAT.
*/
#define	CAN_MOCTR151	(CAN_MO151_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO151_CTR_STAT.
* To use register names with standard convension, please use CAN_MO151_CTR_STAT.
*/
#define	CAN_MOSTAT151	(CAN_MO151_CTR_STAT)

/** \\brief  22F4, Message Object  Data Register High */
#define CAN_MO151_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A2F4u)

/** Alias (User Manual Name) for CAN_MO151_DATAH.
* To use register names with standard convension, please use CAN_MO151_DATAH.
*/
#define	CAN_MODATAH151	(CAN_MO151_DATAH)

/** \\brief  22F0, Message Object  Data Register Low */
#define CAN_MO151_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A2F0u)

/** Alias (User Manual Name) for CAN_MO151_DATAL.
* To use register names with standard convension, please use CAN_MO151_DATAL.
*/
#define	CAN_MODATAL151	(CAN_MO151_DATAL)

/** \\brief  22E0, Message Object  Function Control Register */
#define CAN_MO151_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A2E0u)

/** Alias (User Manual Name) for CAN_MO151_FCR.
* To use register names with standard convension, please use CAN_MO151_FCR.
*/
#define	CAN_MOFCR151	(CAN_MO151_FCR)

