keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  22E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO151_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A2E4u)

/** Alias (User Manual Name) for CAN_MO151_FGPR.
* To use register names with standard convension, please use CAN_MO151_FGPR.
*/
#define	CAN_MOFGPR151	(CAN_MO151_FGPR)

/** \\brief  22E8, Message Object  Interrupt Pointer Register */
#define CAN_MO151_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A2E8u)

/** Alias (User Manual Name) for CAN_MO151_IPR.
* To use register names with standard convension, please use CAN_MO151_IPR.
*/
#define	CAN_MOIPR151	(CAN_MO151_IPR)

/** \\brief  230C, Message Object  Acceptance Mask Register */
#define CAN_MO152_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A30Cu)

/** Alias (User Manual Name) for CAN_MO152_AMR.
* To use register names with standard convension, please use CAN_MO152_AMR.
*/
#define	CAN_MOAMR152	(CAN_MO152_AMR)

/** \\brief  2318, Message Object  Arbitration Register */
#define CAN_MO152_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A318u)

/** Alias (User Manual Name) for CAN_MO152_AR.
* To use register names with standard convension, please use CAN_MO152_AR.
*/
#define	CAN_MOAR152	(CAN_MO152_AR)

/** \\brief  231C, Message Object  Control Register */
#define CAN_MO152_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A31Cu)

/** Alias (User Manual Name) for CAN_MO152_CTR_STAT.
* To use register names with standard convension, please use CAN_MO152_CTR_STAT.
*/
#define	CAN_MOCTR152	(CAN_MO152_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO152_CTR_STAT.
* To use register names with standard convension, please use CAN_MO152_CTR_STAT.
*/
#define	CAN_MOSTAT152	(CAN_MO152_CTR_STAT)

/** \\brief  2314, Message Object  Data Register High */
#define CAN_MO152_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A314u)

/** Alias (User Manual Name) for CAN_MO152_DATAH.
* To use register names with standard convension, please use CAN_MO152_DATAH.
*/
#define	CAN_MODATAH152	(CAN_MO152_DATAH)

/** \\brief  2310, Message Object  Data Register Low */
#define CAN_MO152_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A310u)

/** Alias (User Manual Name) for CAN_MO152_DATAL.
* To use register names with standard convension, please use CAN_MO152_DATAL.
*/
#define	CAN_MODATAL152	(CAN_MO152_DATAL)

/** \\brief  2300, Message Object  Function Control Register */
#define CAN_MO152_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A300u)

/** Alias (User Manual Name) for CAN_MO152_FCR.
* To use register names with standard convension, please use CAN_MO152_FCR.
*/
#define	CAN_MOFCR152	(CAN_MO152_FCR)

/** \\brief  2304, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO152_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A304u)

/** Alias (User Manual Name) for CAN_MO152_FGPR.
* To use register names with standard convension, please use CAN_MO152_FGPR.
*/
#define	CAN_MOFGPR152	(CAN_MO152_FGPR)

/** \\brief  2308, Message Object  Interrupt Pointer Register */
#define CAN_MO152_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A308u)

/** Alias (User Manual Name) for CAN_MO152_IPR.
* To use register names with standard convension, please use CAN_MO152_IPR.
*/
#define	CAN_MOIPR152	(CAN_MO152_IPR)

/** \\brief  232C, Message Object  Acceptance Mask Register */
#define CAN_MO153_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A32Cu)

/** Alias (User Manual Name) for CAN_MO153_AMR.
* To use register names with standard convension, please use CAN_MO153_AMR.
*/
#define	CAN_MOAMR153	(CAN_MO153_AMR)

/** \\brief  2338, Message Object  Arbitration Register */
#define CAN_MO153_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A338u)

/** Alias (User Manual Name) for CAN_MO153_AR.
* To use register names with standard convension, please use CAN_MO153_AR.
*/
#define	CAN_MOAR153	(CAN_MO153_AR)

/** \\brief  233C, Message Object  Control Register */
#define CAN_MO153_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A33Cu)

/** Alias (User Manual Name) for CAN_MO153_CTR_STAT.
* To use register names with standard convension, please use CAN_MO153_CTR_STAT.
*/
#define	CAN_MOCTR153	(CAN_MO153_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO153_CTR_STAT.
* To use register names with standard convension, please use CAN_MO153_CTR_STAT.
*/
#define	CAN_MOSTAT153	(CAN_MO153_CTR_STAT)

/** \\brief  2334, Message Object  Data Register High */
#define CAN_MO153_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A334u)

/** Alias (User Manual Name) for CAN_MO153_DATAH.
* To use register names with standard convension, please use CAN_MO153_DATAH.
*/
#define	CAN_MODATAH153	(CAN_MO153_DATAH)

/** \\brief  2330, Message Object  Data Register Low */
#define CAN_MO153_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A330u)

/** Alias (User Manual Name) for CAN_MO153_DATAL.
* To use register names with standard convension, please use CAN_MO153_DATAL.
*/
#define	CAN_MODATAL153	(CAN_MO153_DATAL)

/** \\brief  2320, Message Object  Function Control Register */
#define CAN_MO153_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A320u)

/** Alias (User Manual Name) for CAN_MO153_FCR.
* To use register names with standard convension, please use CAN_MO153_FCR.
*/
#define	CAN_MOFCR153	(CAN_MO153_FCR)

/** \\brief  2324, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO153_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A324u)

/** Alias (User Manual Name) for CAN_MO153_FGPR.
* To use register names with standard convension, please use CAN_MO153_FGPR.
*/
#define	CAN_MOFGPR153	(CAN_MO153_FGPR)

/** \\brief  2328, Message Object  Interrupt Pointer Register */
#define CAN_MO153_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A328u)

/** Alias (User Manual Name) for CAN_MO153_IPR.
* To use register names with standard convension, please use CAN_MO153_IPR.
*/
#define	CAN_MOIPR153	(CAN_MO153_IPR)

/** \\brief  234C, Message Object  Acceptance Mask Register */
#define CAN_MO154_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A34Cu)

/** Alias (User Manual Name) for CAN_MO154_AMR.
* To use register names with standard convension, please use CAN_MO154_AMR.
*/
#define	CAN_MOAMR154	(CAN_MO154_AMR)

/** \\brief  2358, Message Object  Arbitration Register */
#define CAN_MO154_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A358u)

/** Alias (User Manual Name) for CAN_MO154_AR.
* To use register names with standard convension, please use CAN_MO154_AR.
*/
#define	CAN_MOAR154	(CAN_MO154_AR)

