keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO167_DATAH.
* To use register names with standard convension, please use CAN_MO167_DATAH.
*/
#define	CAN_MODATAH167	(CAN_MO167_DATAH)

/** \\brief  24F0, Message Object  Data Register Low */
#define CAN_MO167_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A4F0u)

/** Alias (User Manual Name) for CAN_MO167_DATAL.
* To use register names with standard convension, please use CAN_MO167_DATAL.
*/
#define	CAN_MODATAL167	(CAN_MO167_DATAL)

/** \\brief  24E0, Message Object  Function Control Register */
#define CAN_MO167_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A4E0u)

/** Alias (User Manual Name) for CAN_MO167_FCR.
* To use register names with standard convension, please use CAN_MO167_FCR.
*/
#define	CAN_MOFCR167	(CAN_MO167_FCR)

/** \\brief  24E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO167_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A4E4u)

/** Alias (User Manual Name) for CAN_MO167_FGPR.
* To use register names with standard convension, please use CAN_MO167_FGPR.
*/
#define	CAN_MOFGPR167	(CAN_MO167_FGPR)

/** \\brief  24E8, Message Object  Interrupt Pointer Register */
#define CAN_MO167_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A4E8u)

/** Alias (User Manual Name) for CAN_MO167_IPR.
* To use register names with standard convension, please use CAN_MO167_IPR.
*/
#define	CAN_MOIPR167	(CAN_MO167_IPR)

/** \\brief  250C, Message Object  Acceptance Mask Register */
#define CAN_MO168_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A50Cu)

/** Alias (User Manual Name) for CAN_MO168_AMR.
* To use register names with standard convension, please use CAN_MO168_AMR.
*/
#define	CAN_MOAMR168	(CAN_MO168_AMR)

/** \\brief  2518, Message Object  Arbitration Register */
#define CAN_MO168_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A518u)

/** Alias (User Manual Name) for CAN_MO168_AR.
* To use register names with standard convension, please use CAN_MO168_AR.
*/
#define	CAN_MOAR168	(CAN_MO168_AR)

/** \\brief  251C, Message Object  Control Register */
#define CAN_MO168_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A51Cu)

/** Alias (User Manual Name) for CAN_MO168_CTR_STAT.
* To use register names with standard convension, please use CAN_MO168_CTR_STAT.
*/
#define	CAN_MOSTAT168	(CAN_MO168_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO168_CTR_STAT.
* To use register names with standard convension, please use CAN_MO168_CTR_STAT.
*/
#define	CAN_MOCTR168	(CAN_MO168_CTR_STAT)

/** \\brief  2514, Message Object  Data Register High */
#define CAN_MO168_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A514u)

/** Alias (User Manual Name) for CAN_MO168_DATAH.
* To use register names with standard convension, please use CAN_MO168_DATAH.
*/
#define	CAN_MODATAH168	(CAN_MO168_DATAH)

/** \\brief  2510, Message Object  Data Register Low */
#define CAN_MO168_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A510u)

/** Alias (User Manual Name) for CAN_MO168_DATAL.
* To use register names with standard convension, please use CAN_MO168_DATAL.
*/
#define	CAN_MODATAL168	(CAN_MO168_DATAL)

/** \\brief  2500, Message Object  Function Control Register */
#define CAN_MO168_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A500u)

/** Alias (User Manual Name) for CAN_MO168_FCR.
* To use register names with standard convension, please use CAN_MO168_FCR.
*/
#define	CAN_MOFCR168	(CAN_MO168_FCR)

/** \\brief  2504, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO168_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A504u)

/** Alias (User Manual Name) for CAN_MO168_FGPR.
* To use register names with standard convension, please use CAN_MO168_FGPR.
*/
#define	CAN_MOFGPR168	(CAN_MO168_FGPR)

/** \\brief  2508, Message Object  Interrupt Pointer Register */
#define CAN_MO168_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A508u)

/** Alias (User Manual Name) for CAN_MO168_IPR.
* To use register names with standard convension, please use CAN_MO168_IPR.
*/
#define	CAN_MOIPR168	(CAN_MO168_IPR)

/** \\brief  252C, Message Object  Acceptance Mask Register */
#define CAN_MO169_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A52Cu)

/** Alias (User Manual Name) for CAN_MO169_AMR.
* To use register names with standard convension, please use CAN_MO169_AMR.
*/
#define	CAN_MOAMR169	(CAN_MO169_AMR)

/** \\brief  2538, Message Object  Arbitration Register */
#define CAN_MO169_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A538u)

/** Alias (User Manual Name) for CAN_MO169_AR.
* To use register names with standard convension, please use CAN_MO169_AR.
*/
#define	CAN_MOAR169	(CAN_MO169_AR)

/** \\brief  253C, Message Object  Control Register */
#define CAN_MO169_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A53Cu)

/** Alias (User Manual Name) for CAN_MO169_CTR_STAT.
* To use register names with standard convension, please use CAN_MO169_CTR_STAT.
*/
#define	CAN_MOSTAT169	(CAN_MO169_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO169_CTR_STAT.
* To use register names with standard convension, please use CAN_MO169_CTR_STAT.
*/
#define	CAN_MOCTR169	(CAN_MO169_CTR_STAT)

/** \\brief  2534, Message Object  Data Register High */
#define CAN_MO169_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A534u)

/** Alias (User Manual Name) for CAN_MO169_DATAH.
* To use register names with standard convension, please use CAN_MO169_DATAH.
*/
#define	CAN_MODATAH169	(CAN_MO169_DATAH)

/** \\brief  2530, Message Object  Data Register Low */
#define CAN_MO169_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A530u)

/** Alias (User Manual Name) for CAN_MO169_DATAL.
* To use register names with standard convension, please use CAN_MO169_DATAL.
*/
#define	CAN_MODATAL169	(CAN_MO169_DATAL)

/** \\brief  2520, Message Object  Function Control Register */
#define CAN_MO169_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A520u)

/** Alias (User Manual Name) for CAN_MO169_FCR.
* To use register names with standard convension, please use CAN_MO169_FCR.
*/
#define	CAN_MOFCR169	(CAN_MO169_FCR)

/** \\brief  2524, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO169_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A524u)

