keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO169_FGPR.
* To use register names with standard convension, please use CAN_MO169_FGPR.
*/
#define	CAN_MOFGPR169	(CAN_MO169_FGPR)

/** \\brief  2528, Message Object  Interrupt Pointer Register */
#define CAN_MO169_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A528u)

/** Alias (User Manual Name) for CAN_MO169_IPR.
* To use register names with standard convension, please use CAN_MO169_IPR.
*/
#define	CAN_MOIPR169	(CAN_MO169_IPR)

/** \\brief  120C, Message Object  Acceptance Mask Register */
#define CAN_MO16_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001920Cu)

/** Alias (User Manual Name) for CAN_MO16_AMR.
* To use register names with standard convension, please use CAN_MO16_AMR.
*/
#define	CAN_MOAMR16	(CAN_MO16_AMR)

/** \\brief  1218, Message Object  Arbitration Register */
#define CAN_MO16_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019218u)

/** Alias (User Manual Name) for CAN_MO16_AR.
* To use register names with standard convension, please use CAN_MO16_AR.
*/
#define	CAN_MOAR16	(CAN_MO16_AR)

/** \\brief  121C, Message Object  Control Register */
#define CAN_MO16_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001921Cu)

/** Alias (User Manual Name) for CAN_MO16_CTR_STAT.
* To use register names with standard convension, please use CAN_MO16_CTR_STAT.
*/
#define	CAN_MOSTAT16	(CAN_MO16_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO16_CTR_STAT.
* To use register names with standard convension, please use CAN_MO16_CTR_STAT.
*/
#define	CAN_MOCTR16	(CAN_MO16_CTR_STAT)

/** \\brief  1214, Message Object  Data Register High */
#define CAN_MO16_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019214u)

/** Alias (User Manual Name) for CAN_MO16_DATAH.
* To use register names with standard convension, please use CAN_MO16_DATAH.
*/
#define	CAN_MODATAH16	(CAN_MO16_DATAH)

/** \\brief  1210, Message Object  Data Register Low */
#define CAN_MO16_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019210u)

/** Alias (User Manual Name) for CAN_MO16_DATAL.
* To use register names with standard convension, please use CAN_MO16_DATAL.
*/
#define	CAN_MODATAL16	(CAN_MO16_DATAL)

/** \\brief  1200, Message Object  Function Control Register */
#define CAN_MO16_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019200u)

/** Alias (User Manual Name) for CAN_MO16_FCR.
* To use register names with standard convension, please use CAN_MO16_FCR.
*/
#define	CAN_MOFCR16	(CAN_MO16_FCR)

/** \\brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO16_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019204u)

/** Alias (User Manual Name) for CAN_MO16_FGPR.
* To use register names with standard convension, please use CAN_MO16_FGPR.
*/
#define	CAN_MOFGPR16	(CAN_MO16_FGPR)

/** \\brief  1208, Message Object  Interrupt Pointer Register */
#define CAN_MO16_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019208u)

/** Alias (User Manual Name) for CAN_MO16_IPR.
* To use register names with standard convension, please use CAN_MO16_IPR.
*/
#define	CAN_MOIPR16	(CAN_MO16_IPR)

/** \\brief  254C, Message Object  Acceptance Mask Register */
#define CAN_MO170_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A54Cu)

/** Alias (User Manual Name) for CAN_MO170_AMR.
* To use register names with standard convension, please use CAN_MO170_AMR.
*/
#define	CAN_MOAMR170	(CAN_MO170_AMR)

/** \\brief  2558, Message Object  Arbitration Register */
#define CAN_MO170_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A558u)

/** Alias (User Manual Name) for CAN_MO170_AR.
* To use register names with standard convension, please use CAN_MO170_AR.
*/
#define	CAN_MOAR170	(CAN_MO170_AR)

/** \\brief  255C, Message Object  Control Register */
#define CAN_MO170_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A55Cu)

/** Alias (User Manual Name) for CAN_MO170_CTR_STAT.
* To use register names with standard convension, please use CAN_MO170_CTR_STAT.
*/
#define	CAN_MOSTAT170	(CAN_MO170_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO170_CTR_STAT.
* To use register names with standard convension, please use CAN_MO170_CTR_STAT.
*/
#define	CAN_MOCTR170	(CAN_MO170_CTR_STAT)

/** \\brief  2554, Message Object  Data Register High */
#define CAN_MO170_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A554u)

/** Alias (User Manual Name) for CAN_MO170_DATAH.
* To use register names with standard convension, please use CAN_MO170_DATAH.
*/
#define	CAN_MODATAH170	(CAN_MO170_DATAH)

/** \\brief  2550, Message Object  Data Register Low */
#define CAN_MO170_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A550u)

/** Alias (User Manual Name) for CAN_MO170_DATAL.
* To use register names with standard convension, please use CAN_MO170_DATAL.
*/
#define	CAN_MODATAL170	(CAN_MO170_DATAL)

/** \\brief  2540, Message Object  Function Control Register */
#define CAN_MO170_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A540u)

/** Alias (User Manual Name) for CAN_MO170_FCR.
* To use register names with standard convension, please use CAN_MO170_FCR.
*/
#define	CAN_MOFCR170	(CAN_MO170_FCR)

/** \\brief  2544, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO170_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A544u)

/** Alias (User Manual Name) for CAN_MO170_FGPR.
* To use register names with standard convension, please use CAN_MO170_FGPR.
*/
#define	CAN_MOFGPR170	(CAN_MO170_FGPR)

/** \\brief  2548, Message Object  Interrupt Pointer Register */
#define CAN_MO170_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A548u)

/** Alias (User Manual Name) for CAN_MO170_IPR.
* To use register names with standard convension, please use CAN_MO170_IPR.
*/
#define	CAN_MOIPR170	(CAN_MO170_IPR)

/** \\brief  256C, Message Object  Acceptance Mask Register */
#define CAN_MO171_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A56Cu)

