keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO176_AMR.
* To use register names with standard convension, please use CAN_MO176_AMR.
*/
#define	CAN_MOAMR176	(CAN_MO176_AMR)

/** \\brief  2618, Message Object  Arbitration Register */
#define CAN_MO176_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A618u)

/** Alias (User Manual Name) for CAN_MO176_AR.
* To use register names with standard convension, please use CAN_MO176_AR.
*/
#define	CAN_MOAR176	(CAN_MO176_AR)

/** \\brief  261C, Message Object  Control Register */
#define CAN_MO176_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A61Cu)

/** Alias (User Manual Name) for CAN_MO176_CTR_STAT.
* To use register names with standard convension, please use CAN_MO176_CTR_STAT.
*/
#define	CAN_MOSTAT176	(CAN_MO176_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO176_CTR_STAT.
* To use register names with standard convension, please use CAN_MO176_CTR_STAT.
*/
#define	CAN_MOCTR176	(CAN_MO176_CTR_STAT)

/** \\brief  2614, Message Object  Data Register High */
#define CAN_MO176_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A614u)

/** Alias (User Manual Name) for CAN_MO176_DATAH.
* To use register names with standard convension, please use CAN_MO176_DATAH.
*/
#define	CAN_MODATAH176	(CAN_MO176_DATAH)

/** \\brief  2610, Message Object  Data Register Low */
#define CAN_MO176_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A610u)

/** Alias (User Manual Name) for CAN_MO176_DATAL.
* To use register names with standard convension, please use CAN_MO176_DATAL.
*/
#define	CAN_MODATAL176	(CAN_MO176_DATAL)

/** \\brief  2600, Message Object  Function Control Register */
#define CAN_MO176_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A600u)

/** Alias (User Manual Name) for CAN_MO176_FCR.
* To use register names with standard convension, please use CAN_MO176_FCR.
*/
#define	CAN_MOFCR176	(CAN_MO176_FCR)

/** \\brief  2604, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO176_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A604u)

/** Alias (User Manual Name) for CAN_MO176_FGPR.
* To use register names with standard convension, please use CAN_MO176_FGPR.
*/
#define	CAN_MOFGPR176	(CAN_MO176_FGPR)

/** \\brief  2608, Message Object  Interrupt Pointer Register */
#define CAN_MO176_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A608u)

/** Alias (User Manual Name) for CAN_MO176_IPR.
* To use register names with standard convension, please use CAN_MO176_IPR.
*/
#define	CAN_MOIPR176	(CAN_MO176_IPR)

/** \\brief  262C, Message Object  Acceptance Mask Register */
#define CAN_MO177_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A62Cu)

/** Alias (User Manual Name) for CAN_MO177_AMR.
* To use register names with standard convension, please use CAN_MO177_AMR.
*/
#define	CAN_MOAMR177	(CAN_MO177_AMR)

/** \\brief  2638, Message Object  Arbitration Register */
#define CAN_MO177_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A638u)

/** Alias (User Manual Name) for CAN_MO177_AR.
* To use register names with standard convension, please use CAN_MO177_AR.
*/
#define	CAN_MOAR177	(CAN_MO177_AR)

/** \\brief  263C, Message Object  Control Register */
#define CAN_MO177_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A63Cu)

/** Alias (User Manual Name) for CAN_MO177_CTR_STAT.
* To use register names with standard convension, please use CAN_MO177_CTR_STAT.
*/
#define	CAN_MOSTAT177	(CAN_MO177_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO177_CTR_STAT.
* To use register names with standard convension, please use CAN_MO177_CTR_STAT.
*/
#define	CAN_MOCTR177	(CAN_MO177_CTR_STAT)

/** \\brief  2634, Message Object  Data Register High */
#define CAN_MO177_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A634u)

/** Alias (User Manual Name) for CAN_MO177_DATAH.
* To use register names with standard convension, please use CAN_MO177_DATAH.
*/
#define	CAN_MODATAH177	(CAN_MO177_DATAH)

/** \\brief  2630, Message Object  Data Register Low */
#define CAN_MO177_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A630u)

/** Alias (User Manual Name) for CAN_MO177_DATAL.
* To use register names with standard convension, please use CAN_MO177_DATAL.
*/
#define	CAN_MODATAL177	(CAN_MO177_DATAL)

/** \\brief  2620, Message Object  Function Control Register */
#define CAN_MO177_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A620u)

/** Alias (User Manual Name) for CAN_MO177_FCR.
* To use register names with standard convension, please use CAN_MO177_FCR.
*/
#define	CAN_MOFCR177	(CAN_MO177_FCR)

/** \\brief  2624, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO177_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A624u)

/** Alias (User Manual Name) for CAN_MO177_FGPR.
* To use register names with standard convension, please use CAN_MO177_FGPR.
*/
#define	CAN_MOFGPR177	(CAN_MO177_FGPR)

/** \\brief  2628, Message Object  Interrupt Pointer Register */
#define CAN_MO177_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A628u)

/** Alias (User Manual Name) for CAN_MO177_IPR.
* To use register names with standard convension, please use CAN_MO177_IPR.
*/
#define	CAN_MOIPR177	(CAN_MO177_IPR)

/** \\brief  264C, Message Object  Acceptance Mask Register */
#define CAN_MO178_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A64Cu)

/** Alias (User Manual Name) for CAN_MO178_AMR.
* To use register names with standard convension, please use CAN_MO178_AMR.
*/
#define	CAN_MOAMR178	(CAN_MO178_AMR)

/** \\brief  2658, Message Object  Arbitration Register */
#define CAN_MO178_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A658u)

/** Alias (User Manual Name) for CAN_MO178_AR.
* To use register names with standard convension, please use CAN_MO178_AR.
*/
#define	CAN_MOAR178	(CAN_MO178_AR)

