keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  265C, Message Object  Control Register */
#define CAN_MO178_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A65Cu)

/** Alias (User Manual Name) for CAN_MO178_CTR_STAT.
* To use register names with standard convension, please use CAN_MO178_CTR_STAT.
*/
#define	CAN_MOSTAT178	(CAN_MO178_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO178_CTR_STAT.
* To use register names with standard convension, please use CAN_MO178_CTR_STAT.
*/
#define	CAN_MOCTR178	(CAN_MO178_CTR_STAT)

/** \\brief  2654, Message Object  Data Register High */
#define CAN_MO178_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A654u)

/** Alias (User Manual Name) for CAN_MO178_DATAH.
* To use register names with standard convension, please use CAN_MO178_DATAH.
*/
#define	CAN_MODATAH178	(CAN_MO178_DATAH)

/** \\brief  2650, Message Object  Data Register Low */
#define CAN_MO178_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A650u)

/** Alias (User Manual Name) for CAN_MO178_DATAL.
* To use register names with standard convension, please use CAN_MO178_DATAL.
*/
#define	CAN_MODATAL178	(CAN_MO178_DATAL)

/** \\brief  2640, Message Object  Function Control Register */
#define CAN_MO178_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A640u)

/** Alias (User Manual Name) for CAN_MO178_FCR.
* To use register names with standard convension, please use CAN_MO178_FCR.
*/
#define	CAN_MOFCR178	(CAN_MO178_FCR)

/** \\brief  2644, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO178_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A644u)

/** Alias (User Manual Name) for CAN_MO178_FGPR.
* To use register names with standard convension, please use CAN_MO178_FGPR.
*/
#define	CAN_MOFGPR178	(CAN_MO178_FGPR)

/** \\brief  2648, Message Object  Interrupt Pointer Register */
#define CAN_MO178_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A648u)

/** Alias (User Manual Name) for CAN_MO178_IPR.
* To use register names with standard convension, please use CAN_MO178_IPR.
*/
#define	CAN_MOIPR178	(CAN_MO178_IPR)

/** \\brief  266C, Message Object  Acceptance Mask Register */
#define CAN_MO179_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A66Cu)

/** Alias (User Manual Name) for CAN_MO179_AMR.
* To use register names with standard convension, please use CAN_MO179_AMR.
*/
#define	CAN_MOAMR179	(CAN_MO179_AMR)

/** \\brief  2678, Message Object  Arbitration Register */
#define CAN_MO179_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A678u)

/** Alias (User Manual Name) for CAN_MO179_AR.
* To use register names with standard convension, please use CAN_MO179_AR.
*/
#define	CAN_MOAR179	(CAN_MO179_AR)

/** \\brief  267C, Message Object  Control Register */
#define CAN_MO179_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A67Cu)

/** Alias (User Manual Name) for CAN_MO179_CTR_STAT.
* To use register names with standard convension, please use CAN_MO179_CTR_STAT.
*/
#define	CAN_MOSTAT179	(CAN_MO179_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO179_CTR_STAT.
* To use register names with standard convension, please use CAN_MO179_CTR_STAT.
*/
#define	CAN_MOCTR179	(CAN_MO179_CTR_STAT)

/** \\brief  2674, Message Object  Data Register High */
#define CAN_MO179_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A674u)

/** Alias (User Manual Name) for CAN_MO179_DATAH.
* To use register names with standard convension, please use CAN_MO179_DATAH.
*/
#define	CAN_MODATAH179	(CAN_MO179_DATAH)

/** \\brief  2670, Message Object  Data Register Low */
#define CAN_MO179_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A670u)

/** Alias (User Manual Name) for CAN_MO179_DATAL.
* To use register names with standard convension, please use CAN_MO179_DATAL.
*/
#define	CAN_MODATAL179	(CAN_MO179_DATAL)

/** \\brief  2660, Message Object  Function Control Register */
#define CAN_MO179_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A660u)

/** Alias (User Manual Name) for CAN_MO179_FCR.
* To use register names with standard convension, please use CAN_MO179_FCR.
*/
#define	CAN_MOFCR179	(CAN_MO179_FCR)

/** \\brief  2664, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO179_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A664u)

/** Alias (User Manual Name) for CAN_MO179_FGPR.
* To use register names with standard convension, please use CAN_MO179_FGPR.
*/
#define	CAN_MOFGPR179	(CAN_MO179_FGPR)

/** \\brief  2668, Message Object  Interrupt Pointer Register */
#define CAN_MO179_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A668u)

/** Alias (User Manual Name) for CAN_MO179_IPR.
* To use register names with standard convension, please use CAN_MO179_IPR.
*/
#define	CAN_MOIPR179	(CAN_MO179_IPR)

/** \\brief  122C, Message Object  Acceptance Mask Register */
#define CAN_MO17_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001922Cu)

/** Alias (User Manual Name) for CAN_MO17_AMR.
* To use register names with standard convension, please use CAN_MO17_AMR.
*/
#define	CAN_MOAMR17	(CAN_MO17_AMR)

/** \\brief  1238, Message Object  Arbitration Register */
#define CAN_MO17_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019238u)

/** Alias (User Manual Name) for CAN_MO17_AR.
* To use register names with standard convension, please use CAN_MO17_AR.
*/
#define	CAN_MOAR17	(CAN_MO17_AR)

/** \\brief  123C, Message Object  Control Register */
#define CAN_MO17_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001923Cu)

/** Alias (User Manual Name) for CAN_MO17_CTR_STAT.
* To use register names with standard convension, please use CAN_MO17_CTR_STAT.
*/
#define	CAN_MOSTAT17	(CAN_MO17_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO17_CTR_STAT.
* To use register names with standard convension, please use CAN_MO17_CTR_STAT.
*/
#define	CAN_MOCTR17	(CAN_MO17_CTR_STAT)

