keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1234, Message Object  Data Register High */
#define CAN_MO17_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019234u)

/** Alias (User Manual Name) for CAN_MO17_DATAH.
* To use register names with standard convension, please use CAN_MO17_DATAH.
*/
#define	CAN_MODATAH17	(CAN_MO17_DATAH)

/** \\brief  1230, Message Object  Data Register Low */
#define CAN_MO17_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019230u)

/** Alias (User Manual Name) for CAN_MO17_DATAL.
* To use register names with standard convension, please use CAN_MO17_DATAL.
*/
#define	CAN_MODATAL17	(CAN_MO17_DATAL)

/** \\brief  1220, Message Object  Function Control Register */
#define CAN_MO17_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019220u)

/** Alias (User Manual Name) for CAN_MO17_FCR.
* To use register names with standard convension, please use CAN_MO17_FCR.
*/
#define	CAN_MOFCR17	(CAN_MO17_FCR)

/** \\brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO17_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019224u)

/** Alias (User Manual Name) for CAN_MO17_FGPR.
* To use register names with standard convension, please use CAN_MO17_FGPR.
*/
#define	CAN_MOFGPR17	(CAN_MO17_FGPR)

/** \\brief  1228, Message Object  Interrupt Pointer Register */
#define CAN_MO17_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019228u)

/** Alias (User Manual Name) for CAN_MO17_IPR.
* To use register names with standard convension, please use CAN_MO17_IPR.
*/
#define	CAN_MOIPR17	(CAN_MO17_IPR)

/** \\brief  268C, Message Object  Acceptance Mask Register */
#define CAN_MO180_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A68Cu)

/** Alias (User Manual Name) for CAN_MO180_AMR.
* To use register names with standard convension, please use CAN_MO180_AMR.
*/
#define	CAN_MOAMR180	(CAN_MO180_AMR)

/** \\brief  2698, Message Object  Arbitration Register */
#define CAN_MO180_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A698u)

/** Alias (User Manual Name) for CAN_MO180_AR.
* To use register names with standard convension, please use CAN_MO180_AR.
*/
#define	CAN_MOAR180	(CAN_MO180_AR)

/** \\brief  269C, Message Object  Control Register */
#define CAN_MO180_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A69Cu)

/** Alias (User Manual Name) for CAN_MO180_CTR_STAT.
* To use register names with standard convension, please use CAN_MO180_CTR_STAT.
*/
#define	CAN_MOCTR180	(CAN_MO180_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO180_CTR_STAT.
* To use register names with standard convension, please use CAN_MO180_CTR_STAT.
*/
#define	CAN_MOSTAT180	(CAN_MO180_CTR_STAT)

/** \\brief  2694, Message Object  Data Register High */
#define CAN_MO180_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A694u)

/** Alias (User Manual Name) for CAN_MO180_DATAH.
* To use register names with standard convension, please use CAN_MO180_DATAH.
*/
#define	CAN_MODATAH180	(CAN_MO180_DATAH)

/** \\brief  2690, Message Object  Data Register Low */
#define CAN_MO180_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A690u)

/** Alias (User Manual Name) for CAN_MO180_DATAL.
* To use register names with standard convension, please use CAN_MO180_DATAL.
*/
#define	CAN_MODATAL180	(CAN_MO180_DATAL)

/** \\brief  2680, Message Object  Function Control Register */
#define CAN_MO180_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A680u)

/** Alias (User Manual Name) for CAN_MO180_FCR.
* To use register names with standard convension, please use CAN_MO180_FCR.
*/
#define	CAN_MOFCR180	(CAN_MO180_FCR)

/** \\brief  2684, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO180_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A684u)

/** Alias (User Manual Name) for CAN_MO180_FGPR.
* To use register names with standard convension, please use CAN_MO180_FGPR.
*/
#define	CAN_MOFGPR180	(CAN_MO180_FGPR)

/** \\brief  2688, Message Object  Interrupt Pointer Register */
#define CAN_MO180_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A688u)

/** Alias (User Manual Name) for CAN_MO180_IPR.
* To use register names with standard convension, please use CAN_MO180_IPR.
*/
#define	CAN_MOIPR180	(CAN_MO180_IPR)

/** \\brief  26AC, Message Object  Acceptance Mask Register */
#define CAN_MO181_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A6ACu)

/** Alias (User Manual Name) for CAN_MO181_AMR.
* To use register names with standard convension, please use CAN_MO181_AMR.
*/
#define	CAN_MOAMR181	(CAN_MO181_AMR)

/** \\brief  26B8, Message Object  Arbitration Register */
#define CAN_MO181_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A6B8u)

/** Alias (User Manual Name) for CAN_MO181_AR.
* To use register names with standard convension, please use CAN_MO181_AR.
*/
#define	CAN_MOAR181	(CAN_MO181_AR)

/** \\brief  26BC, Message Object  Control Register */
#define CAN_MO181_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A6BCu)

/** Alias (User Manual Name) for CAN_MO181_CTR_STAT.
* To use register names with standard convension, please use CAN_MO181_CTR_STAT.
*/
#define	CAN_MOSTAT181	(CAN_MO181_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO181_CTR_STAT.
* To use register names with standard convension, please use CAN_MO181_CTR_STAT.
*/
#define	CAN_MOCTR181	(CAN_MO181_CTR_STAT)

/** \\brief  26B4, Message Object  Data Register High */
#define CAN_MO181_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A6B4u)

/** Alias (User Manual Name) for CAN_MO181_DATAH.
* To use register names with standard convension, please use CAN_MO181_DATAH.
*/
#define	CAN_MODATAH181	(CAN_MO181_DATAH)

/** \\brief  26B0, Message Object  Data Register Low */
#define CAN_MO181_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A6B0u)

/** Alias (User Manual Name) for CAN_MO181_DATAL.
* To use register names with standard convension, please use CAN_MO181_DATAL.
*/
#define	CAN_MODATAL181	(CAN_MO181_DATAL)

/** \\brief  26A0, Message Object  Function Control Register */
#define CAN_MO181_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A6A0u)

/** Alias (User Manual Name) for CAN_MO181_FCR.
* To use register names with standard convension, please use CAN_MO181_FCR.
*/
#define	CAN_MOFCR181	(CAN_MO181_FCR)

