keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  272C, Message Object  Acceptance Mask Register */
#define CAN_MO185_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A72Cu)

/** Alias (User Manual Name) for CAN_MO185_AMR.
* To use register names with standard convension, please use CAN_MO185_AMR.
*/
#define	CAN_MOAMR185	(CAN_MO185_AMR)

/** \\brief  2738, Message Object  Arbitration Register */
#define CAN_MO185_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A738u)

/** Alias (User Manual Name) for CAN_MO185_AR.
* To use register names with standard convension, please use CAN_MO185_AR.
*/
#define	CAN_MOAR185	(CAN_MO185_AR)

/** \\brief  273C, Message Object  Control Register */
#define CAN_MO185_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A73Cu)

/** Alias (User Manual Name) for CAN_MO185_CTR_STAT.
* To use register names with standard convension, please use CAN_MO185_CTR_STAT.
*/
#define	CAN_MOCTR185	(CAN_MO185_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO185_CTR_STAT.
* To use register names with standard convension, please use CAN_MO185_CTR_STAT.
*/
#define	CAN_MOSTAT185	(CAN_MO185_CTR_STAT)

/** \\brief  2734, Message Object  Data Register High */
#define CAN_MO185_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A734u)

/** Alias (User Manual Name) for CAN_MO185_DATAH.
* To use register names with standard convension, please use CAN_MO185_DATAH.
*/
#define	CAN_MODATAH185	(CAN_MO185_DATAH)

/** \\brief  2730, Message Object  Data Register Low */
#define CAN_MO185_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A730u)

/** Alias (User Manual Name) for CAN_MO185_DATAL.
* To use register names with standard convension, please use CAN_MO185_DATAL.
*/
#define	CAN_MODATAL185	(CAN_MO185_DATAL)

/** \\brief  2720, Message Object  Function Control Register */
#define CAN_MO185_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A720u)

/** Alias (User Manual Name) for CAN_MO185_FCR.
* To use register names with standard convension, please use CAN_MO185_FCR.
*/
#define	CAN_MOFCR185	(CAN_MO185_FCR)

/** \\brief  2724, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO185_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A724u)

/** Alias (User Manual Name) for CAN_MO185_FGPR.
* To use register names with standard convension, please use CAN_MO185_FGPR.
*/
#define	CAN_MOFGPR185	(CAN_MO185_FGPR)

/** \\brief  2728, Message Object  Interrupt Pointer Register */
#define CAN_MO185_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A728u)

/** Alias (User Manual Name) for CAN_MO185_IPR.
* To use register names with standard convension, please use CAN_MO185_IPR.
*/
#define	CAN_MOIPR185	(CAN_MO185_IPR)

/** \\brief  274C, Message Object  Acceptance Mask Register */
#define CAN_MO186_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A74Cu)

/** Alias (User Manual Name) for CAN_MO186_AMR.
* To use register names with standard convension, please use CAN_MO186_AMR.
*/
#define	CAN_MOAMR186	(CAN_MO186_AMR)

/** \\brief  2758, Message Object  Arbitration Register */
#define CAN_MO186_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A758u)

/** Alias (User Manual Name) for CAN_MO186_AR.
* To use register names with standard convension, please use CAN_MO186_AR.
*/
#define	CAN_MOAR186	(CAN_MO186_AR)

/** \\brief  275C, Message Object  Control Register */
#define CAN_MO186_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A75Cu)

/** Alias (User Manual Name) for CAN_MO186_CTR_STAT.
* To use register names with standard convension, please use CAN_MO186_CTR_STAT.
*/
#define	CAN_MOCTR186	(CAN_MO186_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO186_CTR_STAT.
* To use register names with standard convension, please use CAN_MO186_CTR_STAT.
*/
#define	CAN_MOSTAT186	(CAN_MO186_CTR_STAT)

/** \\brief  2754, Message Object  Data Register High */
#define CAN_MO186_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A754u)

/** Alias (User Manual Name) for CAN_MO186_DATAH.
* To use register names with standard convension, please use CAN_MO186_DATAH.
*/
#define	CAN_MODATAH186	(CAN_MO186_DATAH)

/** \\brief  2750, Message Object  Data Register Low */
#define CAN_MO186_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A750u)

/** Alias (User Manual Name) for CAN_MO186_DATAL.
* To use register names with standard convension, please use CAN_MO186_DATAL.
*/
#define	CAN_MODATAL186	(CAN_MO186_DATAL)

/** \\brief  2740, Message Object  Function Control Register */
#define CAN_MO186_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A740u)

/** Alias (User Manual Name) for CAN_MO186_FCR.
* To use register names with standard convension, please use CAN_MO186_FCR.
*/
#define	CAN_MOFCR186	(CAN_MO186_FCR)

/** \\brief  2744, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO186_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A744u)

/** Alias (User Manual Name) for CAN_MO186_FGPR.
* To use register names with standard convension, please use CAN_MO186_FGPR.
*/
#define	CAN_MOFGPR186	(CAN_MO186_FGPR)

/** \\brief  2748, Message Object  Interrupt Pointer Register */
#define CAN_MO186_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A748u)

/** Alias (User Manual Name) for CAN_MO186_IPR.
* To use register names with standard convension, please use CAN_MO186_IPR.
*/
#define	CAN_MOIPR186	(CAN_MO186_IPR)

/** \\brief  276C, Message Object  Acceptance Mask Register */
#define CAN_MO187_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A76Cu)

/** Alias (User Manual Name) for CAN_MO187_AMR.
* To use register names with standard convension, please use CAN_MO187_AMR.
*/
#define	CAN_MOAMR187	(CAN_MO187_AMR)

/** \\brief  2778, Message Object  Arbitration Register */
#define CAN_MO187_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A778u)

/** Alias (User Manual Name) for CAN_MO187_AR.
* To use register names with standard convension, please use CAN_MO187_AR.
*/
#define	CAN_MOAR187	(CAN_MO187_AR)

/** \\brief  277C, Message Object  Control Register */
#define CAN_MO187_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A77Cu)

