keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  27C8, Message Object  Interrupt Pointer Register */
#define CAN_MO190_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A7C8u)

/** Alias (User Manual Name) for CAN_MO190_IPR.
* To use register names with standard convension, please use CAN_MO190_IPR.
*/
#define	CAN_MOIPR190	(CAN_MO190_IPR)

/** \\brief  27EC, Message Object  Acceptance Mask Register */
#define CAN_MO191_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A7ECu)

/** Alias (User Manual Name) for CAN_MO191_AMR.
* To use register names with standard convension, please use CAN_MO191_AMR.
*/
#define	CAN_MOAMR191	(CAN_MO191_AMR)

/** \\brief  27F8, Message Object  Arbitration Register */
#define CAN_MO191_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A7F8u)

/** Alias (User Manual Name) for CAN_MO191_AR.
* To use register names with standard convension, please use CAN_MO191_AR.
*/
#define	CAN_MOAR191	(CAN_MO191_AR)

/** \\brief  27FC, Message Object  Control Register */
#define CAN_MO191_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A7FCu)

/** Alias (User Manual Name) for CAN_MO191_CTR_STAT.
* To use register names with standard convension, please use CAN_MO191_CTR_STAT.
*/
#define	CAN_MOCTR191	(CAN_MO191_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO191_CTR_STAT.
* To use register names with standard convension, please use CAN_MO191_CTR_STAT.
*/
#define	CAN_MOSTAT191	(CAN_MO191_CTR_STAT)

/** \\brief  27F4, Message Object  Data Register High */
#define CAN_MO191_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A7F4u)

/** Alias (User Manual Name) for CAN_MO191_DATAH.
* To use register names with standard convension, please use CAN_MO191_DATAH.
*/
#define	CAN_MODATAH191	(CAN_MO191_DATAH)

/** \\brief  27F0, Message Object  Data Register Low */
#define CAN_MO191_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A7F0u)

/** Alias (User Manual Name) for CAN_MO191_DATAL.
* To use register names with standard convension, please use CAN_MO191_DATAL.
*/
#define	CAN_MODATAL191	(CAN_MO191_DATAL)

/** \\brief  27E0, Message Object  Function Control Register */
#define CAN_MO191_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A7E0u)

/** Alias (User Manual Name) for CAN_MO191_FCR.
* To use register names with standard convension, please use CAN_MO191_FCR.
*/
#define	CAN_MOFCR191	(CAN_MO191_FCR)

/** \\brief  27E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO191_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A7E4u)

/** Alias (User Manual Name) for CAN_MO191_FGPR.
* To use register names with standard convension, please use CAN_MO191_FGPR.
*/
#define	CAN_MOFGPR191	(CAN_MO191_FGPR)

/** \\brief  27E8, Message Object  Interrupt Pointer Register */
#define CAN_MO191_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A7E8u)

/** Alias (User Manual Name) for CAN_MO191_IPR.
* To use register names with standard convension, please use CAN_MO191_IPR.
*/
#define	CAN_MOIPR191	(CAN_MO191_IPR)

/** \\brief  280C, Message Object  Acceptance Mask Register */
#define CAN_MO192_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A80Cu)

/** Alias (User Manual Name) for CAN_MO192_AMR.
* To use register names with standard convension, please use CAN_MO192_AMR.
*/
#define	CAN_MOAMR192	(CAN_MO192_AMR)

/** \\brief  2818, Message Object  Arbitration Register */
#define CAN_MO192_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A818u)

/** Alias (User Manual Name) for CAN_MO192_AR.
* To use register names with standard convension, please use CAN_MO192_AR.
*/
#define	CAN_MOAR192	(CAN_MO192_AR)

/** \\brief  281C, Message Object  Control Register */
#define CAN_MO192_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A81Cu)

/** Alias (User Manual Name) for CAN_MO192_CTR_STAT.
* To use register names with standard convension, please use CAN_MO192_CTR_STAT.
*/
#define	CAN_MOCTR192	(CAN_MO192_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO192_CTR_STAT.
* To use register names with standard convension, please use CAN_MO192_CTR_STAT.
*/
#define	CAN_MOSTAT192	(CAN_MO192_CTR_STAT)

/** \\brief  2814, Message Object  Data Register High */
#define CAN_MO192_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A814u)

/** Alias (User Manual Name) for CAN_MO192_DATAH.
* To use register names with standard convension, please use CAN_MO192_DATAH.
*/
#define	CAN_MODATAH192	(CAN_MO192_DATAH)

/** \\brief  2810, Message Object  Data Register Low */
#define CAN_MO192_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A810u)

/** Alias (User Manual Name) for CAN_MO192_DATAL.
* To use register names with standard convension, please use CAN_MO192_DATAL.
*/
#define	CAN_MODATAL192	(CAN_MO192_DATAL)

/** \\brief  2800, Message Object  Function Control Register */
#define CAN_MO192_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A800u)

/** Alias (User Manual Name) for CAN_MO192_FCR.
* To use register names with standard convension, please use CAN_MO192_FCR.
*/
#define	CAN_MOFCR192	(CAN_MO192_FCR)

/** \\brief  2804, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO192_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A804u)

/** Alias (User Manual Name) for CAN_MO192_FGPR.
* To use register names with standard convension, please use CAN_MO192_FGPR.
*/
#define	CAN_MOFGPR192	(CAN_MO192_FGPR)

/** \\brief  2808, Message Object  Interrupt Pointer Register */
#define CAN_MO192_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A808u)

/** Alias (User Manual Name) for CAN_MO192_IPR.
* To use register names with standard convension, please use CAN_MO192_IPR.
*/
#define	CAN_MOIPR192	(CAN_MO192_IPR)

/** \\brief  282C, Message Object  Acceptance Mask Register */
#define CAN_MO193_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A82Cu)

/** Alias (User Manual Name) for CAN_MO193_AMR.
* To use register names with standard convension, please use CAN_MO193_AMR.
*/
#define	CAN_MOAMR193	(CAN_MO193_AMR)

/** \\brief  2838, Message Object  Arbitration Register */
#define CAN_MO193_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A838u)

