keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO200_DATAH.
* To use register names with standard convension, please use CAN_MO200_DATAH.
*/
#define	CAN_MODATAH200	(CAN_MO200_DATAH)

/** \\brief  2910, Message Object  Data Register Low */
#define CAN_MO200_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A910u)

/** Alias (User Manual Name) for CAN_MO200_DATAL.
* To use register names with standard convension, please use CAN_MO200_DATAL.
*/
#define	CAN_MODATAL200	(CAN_MO200_DATAL)

/** \\brief  2900, Message Object  Function Control Register */
#define CAN_MO200_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A900u)

/** Alias (User Manual Name) for CAN_MO200_FCR.
* To use register names with standard convension, please use CAN_MO200_FCR.
*/
#define	CAN_MOFCR200	(CAN_MO200_FCR)

/** \\brief  2904, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO200_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A904u)

/** Alias (User Manual Name) for CAN_MO200_FGPR.
* To use register names with standard convension, please use CAN_MO200_FGPR.
*/
#define	CAN_MOFGPR200	(CAN_MO200_FGPR)

/** \\brief  2908, Message Object  Interrupt Pointer Register */
#define CAN_MO200_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A908u)

/** Alias (User Manual Name) for CAN_MO200_IPR.
* To use register names with standard convension, please use CAN_MO200_IPR.
*/
#define	CAN_MOIPR200	(CAN_MO200_IPR)

/** \\brief  292C, Message Object  Acceptance Mask Register */
#define CAN_MO201_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A92Cu)

/** Alias (User Manual Name) for CAN_MO201_AMR.
* To use register names with standard convension, please use CAN_MO201_AMR.
*/
#define	CAN_MOAMR201	(CAN_MO201_AMR)

/** \\brief  2938, Message Object  Arbitration Register */
#define CAN_MO201_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A938u)

/** Alias (User Manual Name) for CAN_MO201_AR.
* To use register names with standard convension, please use CAN_MO201_AR.
*/
#define	CAN_MOAR201	(CAN_MO201_AR)

/** \\brief  293C, Message Object  Control Register */
#define CAN_MO201_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A93Cu)

/** Alias (User Manual Name) for CAN_MO201_CTR_STAT.
* To use register names with standard convension, please use CAN_MO201_CTR_STAT.
*/
#define	CAN_MOSTAT201	(CAN_MO201_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO201_CTR_STAT.
* To use register names with standard convension, please use CAN_MO201_CTR_STAT.
*/
#define	CAN_MOCTR201	(CAN_MO201_CTR_STAT)

/** \\brief  2934, Message Object  Data Register High */
#define CAN_MO201_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A934u)

/** Alias (User Manual Name) for CAN_MO201_DATAH.
* To use register names with standard convension, please use CAN_MO201_DATAH.
*/
#define	CAN_MODATAH201	(CAN_MO201_DATAH)

/** \\brief  2930, Message Object  Data Register Low */
#define CAN_MO201_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A930u)

/** Alias (User Manual Name) for CAN_MO201_DATAL.
* To use register names with standard convension, please use CAN_MO201_DATAL.
*/
#define	CAN_MODATAL201	(CAN_MO201_DATAL)

/** \\brief  2920, Message Object  Function Control Register */
#define CAN_MO201_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A920u)

/** Alias (User Manual Name) for CAN_MO201_FCR.
* To use register names with standard convension, please use CAN_MO201_FCR.
*/
#define	CAN_MOFCR201	(CAN_MO201_FCR)

/** \\brief  2924, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO201_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A924u)

/** Alias (User Manual Name) for CAN_MO201_FGPR.
* To use register names with standard convension, please use CAN_MO201_FGPR.
*/
#define	CAN_MOFGPR201	(CAN_MO201_FGPR)

/** \\brief  2928, Message Object  Interrupt Pointer Register */
#define CAN_MO201_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A928u)

/** Alias (User Manual Name) for CAN_MO201_IPR.
* To use register names with standard convension, please use CAN_MO201_IPR.
*/
#define	CAN_MOIPR201	(CAN_MO201_IPR)

/** \\brief  294C, Message Object  Acceptance Mask Register */
#define CAN_MO202_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A94Cu)

/** Alias (User Manual Name) for CAN_MO202_AMR.
* To use register names with standard convension, please use CAN_MO202_AMR.
*/
#define	CAN_MOAMR202	(CAN_MO202_AMR)

/** \\brief  2958, Message Object  Arbitration Register */
#define CAN_MO202_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A958u)

/** Alias (User Manual Name) for CAN_MO202_AR.
* To use register names with standard convension, please use CAN_MO202_AR.
*/
#define	CAN_MOAR202	(CAN_MO202_AR)

/** \\brief  295C, Message Object  Control Register */
#define CAN_MO202_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A95Cu)

/** Alias (User Manual Name) for CAN_MO202_CTR_STAT.
* To use register names with standard convension, please use CAN_MO202_CTR_STAT.
*/
#define	CAN_MOSTAT202	(CAN_MO202_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO202_CTR_STAT.
* To use register names with standard convension, please use CAN_MO202_CTR_STAT.
*/
#define	CAN_MOCTR202	(CAN_MO202_CTR_STAT)

/** \\brief  2954, Message Object  Data Register High */
#define CAN_MO202_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A954u)

/** Alias (User Manual Name) for CAN_MO202_DATAH.
* To use register names with standard convension, please use CAN_MO202_DATAH.
*/
#define	CAN_MODATAH202	(CAN_MO202_DATAH)

/** \\brief  2950, Message Object  Data Register Low */
#define CAN_MO202_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A950u)

/** Alias (User Manual Name) for CAN_MO202_DATAL.
* To use register names with standard convension, please use CAN_MO202_DATAL.
*/
#define	CAN_MODATAL202	(CAN_MO202_DATAL)

/** \\brief  2940, Message Object  Function Control Register */
#define CAN_MO202_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A940u)

