keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  29F0, Message Object  Data Register Low */
#define CAN_MO207_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A9F0u)

/** Alias (User Manual Name) for CAN_MO207_DATAL.
* To use register names with standard convension, please use CAN_MO207_DATAL.
*/
#define	CAN_MODATAL207	(CAN_MO207_DATAL)

/** \\brief  29E0, Message Object  Function Control Register */
#define CAN_MO207_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A9E0u)

/** Alias (User Manual Name) for CAN_MO207_FCR.
* To use register names with standard convension, please use CAN_MO207_FCR.
*/
#define	CAN_MOFCR207	(CAN_MO207_FCR)

/** \\brief  29E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO207_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A9E4u)

/** Alias (User Manual Name) for CAN_MO207_FGPR.
* To use register names with standard convension, please use CAN_MO207_FGPR.
*/
#define	CAN_MOFGPR207	(CAN_MO207_FGPR)

/** \\brief  29E8, Message Object  Interrupt Pointer Register */
#define CAN_MO207_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A9E8u)

/** Alias (User Manual Name) for CAN_MO207_IPR.
* To use register names with standard convension, please use CAN_MO207_IPR.
*/
#define	CAN_MOIPR207	(CAN_MO207_IPR)

/** \\brief  2A0C, Message Object  Acceptance Mask Register */
#define CAN_MO208_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AA0Cu)

/** Alias (User Manual Name) for CAN_MO208_AMR.
* To use register names with standard convension, please use CAN_MO208_AMR.
*/
#define	CAN_MOAMR208	(CAN_MO208_AMR)

/** \\brief  2A18, Message Object  Arbitration Register */
#define CAN_MO208_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AA18u)

/** Alias (User Manual Name) for CAN_MO208_AR.
* To use register names with standard convension, please use CAN_MO208_AR.
*/
#define	CAN_MOAR208	(CAN_MO208_AR)

/** \\brief  2A1C, Message Object  Control Register */
#define CAN_MO208_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AA1Cu)

/** Alias (User Manual Name) for CAN_MO208_CTR_STAT.
* To use register names with standard convension, please use CAN_MO208_CTR_STAT.
*/
#define	CAN_MOSTAT208	(CAN_MO208_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO208_CTR_STAT.
* To use register names with standard convension, please use CAN_MO208_CTR_STAT.
*/
#define	CAN_MOCTR208	(CAN_MO208_CTR_STAT)

/** \\brief  2A14, Message Object  Data Register High */
#define CAN_MO208_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AA14u)

/** Alias (User Manual Name) for CAN_MO208_DATAH.
* To use register names with standard convension, please use CAN_MO208_DATAH.
*/
#define	CAN_MODATAH208	(CAN_MO208_DATAH)

/** \\brief  2A10, Message Object  Data Register Low */
#define CAN_MO208_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AA10u)

/** Alias (User Manual Name) for CAN_MO208_DATAL.
* To use register names with standard convension, please use CAN_MO208_DATAL.
*/
#define	CAN_MODATAL208	(CAN_MO208_DATAL)

/** \\brief  2A00, Message Object  Function Control Register */
#define CAN_MO208_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AA00u)

/** Alias (User Manual Name) for CAN_MO208_FCR.
* To use register names with standard convension, please use CAN_MO208_FCR.
*/
#define	CAN_MOFCR208	(CAN_MO208_FCR)

/** \\brief  2A04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO208_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AA04u)

/** Alias (User Manual Name) for CAN_MO208_FGPR.
* To use register names with standard convension, please use CAN_MO208_FGPR.
*/
#define	CAN_MOFGPR208	(CAN_MO208_FGPR)

/** \\brief  2A08, Message Object  Interrupt Pointer Register */
#define CAN_MO208_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AA08u)

/** Alias (User Manual Name) for CAN_MO208_IPR.
* To use register names with standard convension, please use CAN_MO208_IPR.
*/
#define	CAN_MOIPR208	(CAN_MO208_IPR)

/** \\brief  2A2C, Message Object  Acceptance Mask Register */
#define CAN_MO209_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AA2Cu)

/** Alias (User Manual Name) for CAN_MO209_AMR.
* To use register names with standard convension, please use CAN_MO209_AMR.
*/
#define	CAN_MOAMR209	(CAN_MO209_AMR)

/** \\brief  2A38, Message Object  Arbitration Register */
#define CAN_MO209_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AA38u)

/** Alias (User Manual Name) for CAN_MO209_AR.
* To use register names with standard convension, please use CAN_MO209_AR.
*/
#define	CAN_MOAR209	(CAN_MO209_AR)

/** \\brief  2A3C, Message Object  Control Register */
#define CAN_MO209_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AA3Cu)

/** Alias (User Manual Name) for CAN_MO209_CTR_STAT.
* To use register names with standard convension, please use CAN_MO209_CTR_STAT.
*/
#define	CAN_MOSTAT209	(CAN_MO209_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO209_CTR_STAT.
* To use register names with standard convension, please use CAN_MO209_CTR_STAT.
*/
#define	CAN_MOCTR209	(CAN_MO209_CTR_STAT)

/** \\brief  2A34, Message Object  Data Register High */
#define CAN_MO209_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AA34u)

/** Alias (User Manual Name) for CAN_MO209_DATAH.
* To use register names with standard convension, please use CAN_MO209_DATAH.
*/
#define	CAN_MODATAH209	(CAN_MO209_DATAH)

/** \\brief  2A30, Message Object  Data Register Low */
#define CAN_MO209_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AA30u)

/** Alias (User Manual Name) for CAN_MO209_DATAL.
* To use register names with standard convension, please use CAN_MO209_DATAL.
*/
#define	CAN_MODATAL209	(CAN_MO209_DATAL)

/** \\brief  2A20, Message Object  Function Control Register */
#define CAN_MO209_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AA20u)

/** Alias (User Manual Name) for CAN_MO209_FCR.
* To use register names with standard convension, please use CAN_MO209_FCR.
*/
#define	CAN_MOFCR209	(CAN_MO209_FCR)

