keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  12B4, Message Object  Data Register High */
#define CAN_MO21_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00192B4u)

/** Alias (User Manual Name) for CAN_MO21_DATAH.
* To use register names with standard convension, please use CAN_MO21_DATAH.
*/
#define	CAN_MODATAH21	(CAN_MO21_DATAH)

/** \\brief  12B0, Message Object  Data Register Low */
#define CAN_MO21_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00192B0u)

/** Alias (User Manual Name) for CAN_MO21_DATAL.
* To use register names with standard convension, please use CAN_MO21_DATAL.
*/
#define	CAN_MODATAL21	(CAN_MO21_DATAL)

/** \\brief  12A0, Message Object  Function Control Register */
#define CAN_MO21_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00192A0u)

/** Alias (User Manual Name) for CAN_MO21_FCR.
* To use register names with standard convension, please use CAN_MO21_FCR.
*/
#define	CAN_MOFCR21	(CAN_MO21_FCR)

/** \\brief  12A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO21_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00192A4u)

/** Alias (User Manual Name) for CAN_MO21_FGPR.
* To use register names with standard convension, please use CAN_MO21_FGPR.
*/
#define	CAN_MOFGPR21	(CAN_MO21_FGPR)

/** \\brief  12A8, Message Object  Interrupt Pointer Register */
#define CAN_MO21_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00192A8u)

/** Alias (User Manual Name) for CAN_MO21_IPR.
* To use register names with standard convension, please use CAN_MO21_IPR.
*/
#define	CAN_MOIPR21	(CAN_MO21_IPR)

/** \\brief  2B8C, Message Object  Acceptance Mask Register */
#define CAN_MO220_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AB8Cu)

/** Alias (User Manual Name) for CAN_MO220_AMR.
* To use register names with standard convension, please use CAN_MO220_AMR.
*/
#define	CAN_MOAMR220	(CAN_MO220_AMR)

/** \\brief  2B98, Message Object  Arbitration Register */
#define CAN_MO220_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AB98u)

/** Alias (User Manual Name) for CAN_MO220_AR.
* To use register names with standard convension, please use CAN_MO220_AR.
*/
#define	CAN_MOAR220	(CAN_MO220_AR)

/** \\brief  2B9C, Message Object  Control Register */
#define CAN_MO220_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AB9Cu)

/** Alias (User Manual Name) for CAN_MO220_CTR_STAT.
* To use register names with standard convension, please use CAN_MO220_CTR_STAT.
*/
#define	CAN_MOCTR220	(CAN_MO220_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO220_CTR_STAT.
* To use register names with standard convension, please use CAN_MO220_CTR_STAT.
*/
#define	CAN_MOSTAT220	(CAN_MO220_CTR_STAT)

/** \\brief  2B94, Message Object  Data Register High */
#define CAN_MO220_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AB94u)

/** Alias (User Manual Name) for CAN_MO220_DATAH.
* To use register names with standard convension, please use CAN_MO220_DATAH.
*/
#define	CAN_MODATAH220	(CAN_MO220_DATAH)

/** \\brief  2B90, Message Object  Data Register Low */
#define CAN_MO220_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AB90u)

/** Alias (User Manual Name) for CAN_MO220_DATAL.
* To use register names with standard convension, please use CAN_MO220_DATAL.
*/
#define	CAN_MODATAL220	(CAN_MO220_DATAL)

/** \\brief  2B80, Message Object  Function Control Register */
#define CAN_MO220_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AB80u)

/** Alias (User Manual Name) for CAN_MO220_FCR.
* To use register names with standard convension, please use CAN_MO220_FCR.
*/
#define	CAN_MOFCR220	(CAN_MO220_FCR)

/** \\brief  2B84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO220_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AB84u)

/** Alias (User Manual Name) for CAN_MO220_FGPR.
* To use register names with standard convension, please use CAN_MO220_FGPR.
*/
#define	CAN_MOFGPR220	(CAN_MO220_FGPR)

/** \\brief  2B88, Message Object  Interrupt Pointer Register */
#define CAN_MO220_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AB88u)

/** Alias (User Manual Name) for CAN_MO220_IPR.
* To use register names with standard convension, please use CAN_MO220_IPR.
*/
#define	CAN_MOIPR220	(CAN_MO220_IPR)

/** \\brief  2BAC, Message Object  Acceptance Mask Register */
#define CAN_MO221_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ABACu)

/** Alias (User Manual Name) for CAN_MO221_AMR.
* To use register names with standard convension, please use CAN_MO221_AMR.
*/
#define	CAN_MOAMR221	(CAN_MO221_AMR)

/** \\brief  2BB8, Message Object  Arbitration Register */
#define CAN_MO221_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ABB8u)

/** Alias (User Manual Name) for CAN_MO221_AR.
* To use register names with standard convension, please use CAN_MO221_AR.
*/
#define	CAN_MOAR221	(CAN_MO221_AR)

/** \\brief  2BBC, Message Object  Control Register */
#define CAN_MO221_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ABBCu)

/** Alias (User Manual Name) for CAN_MO221_CTR_STAT.
* To use register names with standard convension, please use CAN_MO221_CTR_STAT.
*/
#define	CAN_MOCTR221	(CAN_MO221_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO221_CTR_STAT.
* To use register names with standard convension, please use CAN_MO221_CTR_STAT.
*/
#define	CAN_MOSTAT221	(CAN_MO221_CTR_STAT)

/** \\brief  2BB4, Message Object  Data Register High */
#define CAN_MO221_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ABB4u)

/** Alias (User Manual Name) for CAN_MO221_DATAH.
* To use register names with standard convension, please use CAN_MO221_DATAH.
*/
#define	CAN_MODATAH221	(CAN_MO221_DATAH)

/** \\brief  2BB0, Message Object  Data Register Low */
#define CAN_MO221_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ABB0u)

/** Alias (User Manual Name) for CAN_MO221_DATAL.
* To use register names with standard convension, please use CAN_MO221_DATAL.
*/
#define	CAN_MODATAL221	(CAN_MO221_DATAL)

/** \\brief  2BA0, Message Object  Function Control Register */
#define CAN_MO221_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ABA0u)

/** Alias (User Manual Name) for CAN_MO221_FCR.
* To use register names with standard convension, please use CAN_MO221_FCR.
*/
#define	CAN_MOFCR221	(CAN_MO221_FCR)

/** \\brief  2BA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO221_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ABA4u)

