keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO228_IPR.
* To use register names with standard convension, please use CAN_MO228_IPR.
*/
#define	CAN_MOIPR228	(CAN_MO228_IPR)

/** \\brief  2CAC, Message Object  Acceptance Mask Register */
#define CAN_MO229_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ACACu)

/** Alias (User Manual Name) for CAN_MO229_AMR.
* To use register names with standard convension, please use CAN_MO229_AMR.
*/
#define	CAN_MOAMR229	(CAN_MO229_AMR)

/** \\brief  2CB8, Message Object  Arbitration Register */
#define CAN_MO229_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ACB8u)

/** Alias (User Manual Name) for CAN_MO229_AR.
* To use register names with standard convension, please use CAN_MO229_AR.
*/
#define	CAN_MOAR229	(CAN_MO229_AR)

/** \\brief  2CBC, Message Object  Control Register */
#define CAN_MO229_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ACBCu)

/** Alias (User Manual Name) for CAN_MO229_CTR_STAT.
* To use register names with standard convension, please use CAN_MO229_CTR_STAT.
*/
#define	CAN_MOSTAT229	(CAN_MO229_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO229_CTR_STAT.
* To use register names with standard convension, please use CAN_MO229_CTR_STAT.
*/
#define	CAN_MOCTR229	(CAN_MO229_CTR_STAT)

/** \\brief  2CB4, Message Object  Data Register High */
#define CAN_MO229_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ACB4u)

/** Alias (User Manual Name) for CAN_MO229_DATAH.
* To use register names with standard convension, please use CAN_MO229_DATAH.
*/
#define	CAN_MODATAH229	(CAN_MO229_DATAH)

/** \\brief  2CB0, Message Object  Data Register Low */
#define CAN_MO229_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ACB0u)

/** Alias (User Manual Name) for CAN_MO229_DATAL.
* To use register names with standard convension, please use CAN_MO229_DATAL.
*/
#define	CAN_MODATAL229	(CAN_MO229_DATAL)

/** \\brief  2CA0, Message Object  Function Control Register */
#define CAN_MO229_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACA0u)

/** Alias (User Manual Name) for CAN_MO229_FCR.
* To use register names with standard convension, please use CAN_MO229_FCR.
*/
#define	CAN_MOFCR229	(CAN_MO229_FCR)

/** \\brief  2CA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO229_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACA4u)

/** Alias (User Manual Name) for CAN_MO229_FGPR.
* To use register names with standard convension, please use CAN_MO229_FGPR.
*/
#define	CAN_MOFGPR229	(CAN_MO229_FGPR)

/** \\brief  2CA8, Message Object  Interrupt Pointer Register */
#define CAN_MO229_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACA8u)

/** Alias (User Manual Name) for CAN_MO229_IPR.
* To use register names with standard convension, please use CAN_MO229_IPR.
*/
#define	CAN_MOIPR229	(CAN_MO229_IPR)

/** \\brief  12CC, Message Object  Acceptance Mask Register */
#define CAN_MO22_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00192CCu)

/** Alias (User Manual Name) for CAN_MO22_AMR.
* To use register names with standard convension, please use CAN_MO22_AMR.
*/
#define	CAN_MOAMR22	(CAN_MO22_AMR)

/** \\brief  12D8, Message Object  Arbitration Register */
#define CAN_MO22_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00192D8u)

/** Alias (User Manual Name) for CAN_MO22_AR.
* To use register names with standard convension, please use CAN_MO22_AR.
*/
#define	CAN_MOAR22	(CAN_MO22_AR)

/** \\brief  12DC, Message Object  Control Register */
#define CAN_MO22_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00192DCu)

/** Alias (User Manual Name) for CAN_MO22_CTR_STAT.
* To use register names with standard convension, please use CAN_MO22_CTR_STAT.
*/
#define	CAN_MOSTAT22	(CAN_MO22_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO22_CTR_STAT.
* To use register names with standard convension, please use CAN_MO22_CTR_STAT.
*/
#define	CAN_MOCTR22	(CAN_MO22_CTR_STAT)

/** \\brief  12D4, Message Object  Data Register High */
#define CAN_MO22_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00192D4u)

/** Alias (User Manual Name) for CAN_MO22_DATAH.
* To use register names with standard convension, please use CAN_MO22_DATAH.
*/
#define	CAN_MODATAH22	(CAN_MO22_DATAH)

/** \\brief  12D0, Message Object  Data Register Low */
#define CAN_MO22_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00192D0u)

/** Alias (User Manual Name) for CAN_MO22_DATAL.
* To use register names with standard convension, please use CAN_MO22_DATAL.
*/
#define	CAN_MODATAL22	(CAN_MO22_DATAL)

/** \\brief  12C0, Message Object  Function Control Register */
#define CAN_MO22_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00192C0u)

/** Alias (User Manual Name) for CAN_MO22_FCR.
* To use register names with standard convension, please use CAN_MO22_FCR.
*/
#define	CAN_MOFCR22	(CAN_MO22_FCR)

/** \\brief  12C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO22_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00192C4u)

/** Alias (User Manual Name) for CAN_MO22_FGPR.
* To use register names with standard convension, please use CAN_MO22_FGPR.
*/
#define	CAN_MOFGPR22	(CAN_MO22_FGPR)

/** \\brief  12C8, Message Object  Interrupt Pointer Register */
#define CAN_MO22_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00192C8u)

/** Alias (User Manual Name) for CAN_MO22_IPR.
* To use register names with standard convension, please use CAN_MO22_IPR.
*/
#define	CAN_MOIPR22	(CAN_MO22_IPR)

/** \\brief  2CCC, Message Object  Acceptance Mask Register */
#define CAN_MO230_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ACCCu)

/** Alias (User Manual Name) for CAN_MO230_AMR.
* To use register names with standard convension, please use CAN_MO230_AMR.
*/
#define	CAN_MOAMR230	(CAN_MO230_AMR)

/** \\brief  2CD8, Message Object  Arbitration Register */
#define CAN_MO230_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ACD8u)

/** Alias (User Manual Name) for CAN_MO230_AR.
* To use register names with standard convension, please use CAN_MO230_AR.
*/
#define	CAN_MOAR230	(CAN_MO230_AR)

/** \\brief  2CDC, Message Object  Control Register */
#define CAN_MO230_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ACDCu)

/** Alias (User Manual Name) for CAN_MO230_CTR_STAT.
* To use register names with standard convension, please use CAN_MO230_CTR_STAT.
*/
#define	CAN_MOCTR230	(CAN_MO230_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO230_CTR_STAT.
* To use register names with standard convension, please use CAN_MO230_CTR_STAT.
*/
#define	CAN_MOSTAT230	(CAN_MO230_CTR_STAT)

