keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2CD4, Message Object  Data Register High */
#define CAN_MO230_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ACD4u)

/** Alias (User Manual Name) for CAN_MO230_DATAH.
* To use register names with standard convension, please use CAN_MO230_DATAH.
*/
#define	CAN_MODATAH230	(CAN_MO230_DATAH)

/** \\brief  2CD0, Message Object  Data Register Low */
#define CAN_MO230_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ACD0u)

/** Alias (User Manual Name) for CAN_MO230_DATAL.
* To use register names with standard convension, please use CAN_MO230_DATAL.
*/
#define	CAN_MODATAL230	(CAN_MO230_DATAL)

/** \\brief  2CC0, Message Object  Function Control Register */
#define CAN_MO230_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACC0u)

/** Alias (User Manual Name) for CAN_MO230_FCR.
* To use register names with standard convension, please use CAN_MO230_FCR.
*/
#define	CAN_MOFCR230	(CAN_MO230_FCR)

/** \\brief  2CC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO230_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACC4u)

/** Alias (User Manual Name) for CAN_MO230_FGPR.
* To use register names with standard convension, please use CAN_MO230_FGPR.
*/
#define	CAN_MOFGPR230	(CAN_MO230_FGPR)

/** \\brief  2CC8, Message Object  Interrupt Pointer Register */
#define CAN_MO230_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACC8u)

/** Alias (User Manual Name) for CAN_MO230_IPR.
* To use register names with standard convension, please use CAN_MO230_IPR.
*/
#define	CAN_MOIPR230	(CAN_MO230_IPR)

/** \\brief  2CEC, Message Object  Acceptance Mask Register */
#define CAN_MO231_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ACECu)

/** Alias (User Manual Name) for CAN_MO231_AMR.
* To use register names with standard convension, please use CAN_MO231_AMR.
*/
#define	CAN_MOAMR231	(CAN_MO231_AMR)

/** \\brief  2CF8, Message Object  Arbitration Register */
#define CAN_MO231_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ACF8u)

/** Alias (User Manual Name) for CAN_MO231_AR.
* To use register names with standard convension, please use CAN_MO231_AR.
*/
#define	CAN_MOAR231	(CAN_MO231_AR)

/** \\brief  2CFC, Message Object  Control Register */
#define CAN_MO231_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ACFCu)

/** Alias (User Manual Name) for CAN_MO231_CTR_STAT.
* To use register names with standard convension, please use CAN_MO231_CTR_STAT.
*/
#define	CAN_MOCTR231	(CAN_MO231_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO231_CTR_STAT.
* To use register names with standard convension, please use CAN_MO231_CTR_STAT.
*/
#define	CAN_MOSTAT231	(CAN_MO231_CTR_STAT)

/** \\brief  2CF4, Message Object  Data Register High */
#define CAN_MO231_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ACF4u)

/** Alias (User Manual Name) for CAN_MO231_DATAH.
* To use register names with standard convension, please use CAN_MO231_DATAH.
*/
#define	CAN_MODATAH231	(CAN_MO231_DATAH)

/** \\brief  2CF0, Message Object  Data Register Low */
#define CAN_MO231_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ACF0u)

/** Alias (User Manual Name) for CAN_MO231_DATAL.
* To use register names with standard convension, please use CAN_MO231_DATAL.
*/
#define	CAN_MODATAL231	(CAN_MO231_DATAL)

/** \\brief  2CE0, Message Object  Function Control Register */
#define CAN_MO231_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACE0u)

/** Alias (User Manual Name) for CAN_MO231_FCR.
* To use register names with standard convension, please use CAN_MO231_FCR.
*/
#define	CAN_MOFCR231	(CAN_MO231_FCR)

/** \\brief  2CE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO231_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACE4u)

/** Alias (User Manual Name) for CAN_MO231_FGPR.
* To use register names with standard convension, please use CAN_MO231_FGPR.
*/
#define	CAN_MOFGPR231	(CAN_MO231_FGPR)

/** \\brief  2CE8, Message Object  Interrupt Pointer Register */
#define CAN_MO231_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACE8u)

/** Alias (User Manual Name) for CAN_MO231_IPR.
* To use register names with standard convension, please use CAN_MO231_IPR.
*/
#define	CAN_MOIPR231	(CAN_MO231_IPR)

/** \\brief  2D0C, Message Object  Acceptance Mask Register */
#define CAN_MO232_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD0Cu)

/** Alias (User Manual Name) for CAN_MO232_AMR.
* To use register names with standard convension, please use CAN_MO232_AMR.
*/
#define	CAN_MOAMR232	(CAN_MO232_AMR)

/** \\brief  2D18, Message Object  Arbitration Register */
#define CAN_MO232_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD18u)

/** Alias (User Manual Name) for CAN_MO232_AR.
* To use register names with standard convension, please use CAN_MO232_AR.
*/
#define	CAN_MOAR232	(CAN_MO232_AR)

/** \\brief  2D1C, Message Object  Control Register */
#define CAN_MO232_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AD1Cu)

/** Alias (User Manual Name) for CAN_MO232_CTR_STAT.
* To use register names with standard convension, please use CAN_MO232_CTR_STAT.
*/
#define	CAN_MOCTR232	(CAN_MO232_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO232_CTR_STAT.
* To use register names with standard convension, please use CAN_MO232_CTR_STAT.
*/
#define	CAN_MOSTAT232	(CAN_MO232_CTR_STAT)

/** \\brief  2D14, Message Object  Data Register High */
#define CAN_MO232_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD14u)

/** Alias (User Manual Name) for CAN_MO232_DATAH.
* To use register names with standard convension, please use CAN_MO232_DATAH.
*/
#define	CAN_MODATAH232	(CAN_MO232_DATAH)

/** \\brief  2D10, Message Object  Data Register Low */
#define CAN_MO232_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD10u)

/** Alias (User Manual Name) for CAN_MO232_DATAL.
* To use register names with standard convension, please use CAN_MO232_DATAL.
*/
#define	CAN_MODATAL232	(CAN_MO232_DATAL)

