keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2D00, Message Object  Function Control Register */
#define CAN_MO232_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD00u)

/** Alias (User Manual Name) for CAN_MO232_FCR.
* To use register names with standard convension, please use CAN_MO232_FCR.
*/
#define	CAN_MOFCR232	(CAN_MO232_FCR)

/** \\brief  2D04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO232_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD04u)

/** Alias (User Manual Name) for CAN_MO232_FGPR.
* To use register names with standard convension, please use CAN_MO232_FGPR.
*/
#define	CAN_MOFGPR232	(CAN_MO232_FGPR)

/** \\brief  2D08, Message Object  Interrupt Pointer Register */
#define CAN_MO232_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD08u)

/** Alias (User Manual Name) for CAN_MO232_IPR.
* To use register names with standard convension, please use CAN_MO232_IPR.
*/
#define	CAN_MOIPR232	(CAN_MO232_IPR)

/** \\brief  2D2C, Message Object  Acceptance Mask Register */
#define CAN_MO233_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD2Cu)

/** Alias (User Manual Name) for CAN_MO233_AMR.
* To use register names with standard convension, please use CAN_MO233_AMR.
*/
#define	CAN_MOAMR233	(CAN_MO233_AMR)

/** \\brief  2D38, Message Object  Arbitration Register */
#define CAN_MO233_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD38u)

/** Alias (User Manual Name) for CAN_MO233_AR.
* To use register names with standard convension, please use CAN_MO233_AR.
*/
#define	CAN_MOAR233	(CAN_MO233_AR)

/** \\brief  2D3C, Message Object  Control Register */
#define CAN_MO233_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AD3Cu)

/** Alias (User Manual Name) for CAN_MO233_CTR_STAT.
* To use register names with standard convension, please use CAN_MO233_CTR_STAT.
*/
#define	CAN_MOCTR233	(CAN_MO233_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO233_CTR_STAT.
* To use register names with standard convension, please use CAN_MO233_CTR_STAT.
*/
#define	CAN_MOSTAT233	(CAN_MO233_CTR_STAT)

/** \\brief  2D34, Message Object  Data Register High */
#define CAN_MO233_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD34u)

/** Alias (User Manual Name) for CAN_MO233_DATAH.
* To use register names with standard convension, please use CAN_MO233_DATAH.
*/
#define	CAN_MODATAH233	(CAN_MO233_DATAH)

/** \\brief  2D30, Message Object  Data Register Low */
#define CAN_MO233_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD30u)

/** Alias (User Manual Name) for CAN_MO233_DATAL.
* To use register names with standard convension, please use CAN_MO233_DATAL.
*/
#define	CAN_MODATAL233	(CAN_MO233_DATAL)

/** \\brief  2D20, Message Object  Function Control Register */
#define CAN_MO233_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD20u)

/** Alias (User Manual Name) for CAN_MO233_FCR.
* To use register names with standard convension, please use CAN_MO233_FCR.
*/
#define	CAN_MOFCR233	(CAN_MO233_FCR)

/** \\brief  2D24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO233_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD24u)

/** Alias (User Manual Name) for CAN_MO233_FGPR.
* To use register names with standard convension, please use CAN_MO233_FGPR.
*/
#define	CAN_MOFGPR233	(CAN_MO233_FGPR)

/** \\brief  2D28, Message Object  Interrupt Pointer Register */
#define CAN_MO233_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD28u)

/** Alias (User Manual Name) for CAN_MO233_IPR.
* To use register names with standard convension, please use CAN_MO233_IPR.
*/
#define	CAN_MOIPR233	(CAN_MO233_IPR)

/** \\brief  2D4C, Message Object  Acceptance Mask Register */
#define CAN_MO234_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD4Cu)

/** Alias (User Manual Name) for CAN_MO234_AMR.
* To use register names with standard convension, please use CAN_MO234_AMR.
*/
#define	CAN_MOAMR234	(CAN_MO234_AMR)

/** \\brief  2D58, Message Object  Arbitration Register */
#define CAN_MO234_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD58u)

/** Alias (User Manual Name) for CAN_MO234_AR.
* To use register names with standard convension, please use CAN_MO234_AR.
*/
#define	CAN_MOAR234	(CAN_MO234_AR)

/** \\brief  2D5C, Message Object  Control Register */
#define CAN_MO234_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AD5Cu)

/** Alias (User Manual Name) for CAN_MO234_CTR_STAT.
* To use register names with standard convension, please use CAN_MO234_CTR_STAT.
*/
#define	CAN_MOCTR234	(CAN_MO234_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO234_CTR_STAT.
* To use register names with standard convension, please use CAN_MO234_CTR_STAT.
*/
#define	CAN_MOSTAT234	(CAN_MO234_CTR_STAT)

/** \\brief  2D54, Message Object  Data Register High */
#define CAN_MO234_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD54u)

/** Alias (User Manual Name) for CAN_MO234_DATAH.
* To use register names with standard convension, please use CAN_MO234_DATAH.
*/
#define	CAN_MODATAH234	(CAN_MO234_DATAH)

/** \\brief  2D50, Message Object  Data Register Low */
#define CAN_MO234_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD50u)

/** Alias (User Manual Name) for CAN_MO234_DATAL.
* To use register names with standard convension, please use CAN_MO234_DATAL.
*/
#define	CAN_MODATAL234	(CAN_MO234_DATAL)

/** \\brief  2D40, Message Object  Function Control Register */
#define CAN_MO234_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD40u)

/** Alias (User Manual Name) for CAN_MO234_FCR.
* To use register names with standard convension, please use CAN_MO234_FCR.
*/
#define	CAN_MOFCR234	(CAN_MO234_FCR)

/** \\brief  2D44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO234_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD44u)

/** Alias (User Manual Name) for CAN_MO234_FGPR.
* To use register names with standard convension, please use CAN_MO234_FGPR.
*/
#define	CAN_MOFGPR234	(CAN_MO234_FGPR)

/** \\brief  2D48, Message Object  Interrupt Pointer Register */
#define CAN_MO234_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD48u)

/** Alias (User Manual Name) for CAN_MO234_IPR.
* To use register names with standard convension, please use CAN_MO234_IPR.
*/
#define	CAN_MOIPR234	(CAN_MO234_IPR)

/** \\brief  2D6C, Message Object  Acceptance Mask Register */
#define CAN_MO235_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD6Cu)

/** Alias (User Manual Name) for CAN_MO235_AMR.
* To use register names with standard convension, please use CAN_MO235_AMR.
*/
#define	CAN_MOAMR235	(CAN_MO235_AMR)

