keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2D78, Message Object  Arbitration Register */
#define CAN_MO235_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD78u)

/** Alias (User Manual Name) for CAN_MO235_AR.
* To use register names with standard convension, please use CAN_MO235_AR.
*/
#define	CAN_MOAR235	(CAN_MO235_AR)

/** \\brief  2D7C, Message Object  Control Register */
#define CAN_MO235_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AD7Cu)

/** Alias (User Manual Name) for CAN_MO235_CTR_STAT.
* To use register names with standard convension, please use CAN_MO235_CTR_STAT.
*/
#define	CAN_MOCTR235	(CAN_MO235_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO235_CTR_STAT.
* To use register names with standard convension, please use CAN_MO235_CTR_STAT.
*/
#define	CAN_MOSTAT235	(CAN_MO235_CTR_STAT)

/** \\brief  2D74, Message Object  Data Register High */
#define CAN_MO235_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD74u)

/** Alias (User Manual Name) for CAN_MO235_DATAH.
* To use register names with standard convension, please use CAN_MO235_DATAH.
*/
#define	CAN_MODATAH235	(CAN_MO235_DATAH)

/** \\brief  2D70, Message Object  Data Register Low */
#define CAN_MO235_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD70u)

/** Alias (User Manual Name) for CAN_MO235_DATAL.
* To use register names with standard convension, please use CAN_MO235_DATAL.
*/
#define	CAN_MODATAL235	(CAN_MO235_DATAL)

/** \\brief  2D60, Message Object  Function Control Register */
#define CAN_MO235_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD60u)

/** Alias (User Manual Name) for CAN_MO235_FCR.
* To use register names with standard convension, please use CAN_MO235_FCR.
*/
#define	CAN_MOFCR235	(CAN_MO235_FCR)

/** \\brief  2D64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO235_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD64u)

/** Alias (User Manual Name) for CAN_MO235_FGPR.
* To use register names with standard convension, please use CAN_MO235_FGPR.
*/
#define	CAN_MOFGPR235	(CAN_MO235_FGPR)

/** \\brief  2D68, Message Object  Interrupt Pointer Register */
#define CAN_MO235_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD68u)

/** Alias (User Manual Name) for CAN_MO235_IPR.
* To use register names with standard convension, please use CAN_MO235_IPR.
*/
#define	CAN_MOIPR235	(CAN_MO235_IPR)

/** \\brief  2D8C, Message Object  Acceptance Mask Register */
#define CAN_MO236_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD8Cu)

/** Alias (User Manual Name) for CAN_MO236_AMR.
* To use register names with standard convension, please use CAN_MO236_AMR.
*/
#define	CAN_MOAMR236	(CAN_MO236_AMR)

/** \\brief  2D98, Message Object  Arbitration Register */
#define CAN_MO236_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD98u)

/** Alias (User Manual Name) for CAN_MO236_AR.
* To use register names with standard convension, please use CAN_MO236_AR.
*/
#define	CAN_MOAR236	(CAN_MO236_AR)

/** \\brief  2D9C, Message Object  Control Register */
#define CAN_MO236_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AD9Cu)

/** Alias (User Manual Name) for CAN_MO236_CTR_STAT.
* To use register names with standard convension, please use CAN_MO236_CTR_STAT.
*/
#define	CAN_MOCTR236	(CAN_MO236_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO236_CTR_STAT.
* To use register names with standard convension, please use CAN_MO236_CTR_STAT.
*/
#define	CAN_MOSTAT236	(CAN_MO236_CTR_STAT)

/** \\brief  2D94, Message Object  Data Register High */
#define CAN_MO236_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD94u)

/** Alias (User Manual Name) for CAN_MO236_DATAH.
* To use register names with standard convension, please use CAN_MO236_DATAH.
*/
#define	CAN_MODATAH236	(CAN_MO236_DATAH)

/** \\brief  2D90, Message Object  Data Register Low */
#define CAN_MO236_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD90u)

/** Alias (User Manual Name) for CAN_MO236_DATAL.
* To use register names with standard convension, please use CAN_MO236_DATAL.
*/
#define	CAN_MODATAL236	(CAN_MO236_DATAL)

/** \\brief  2D80, Message Object  Function Control Register */
#define CAN_MO236_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD80u)

/** Alias (User Manual Name) for CAN_MO236_FCR.
* To use register names with standard convension, please use CAN_MO236_FCR.
*/
#define	CAN_MOFCR236	(CAN_MO236_FCR)

/** \\brief  2D84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO236_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD84u)

/** Alias (User Manual Name) for CAN_MO236_FGPR.
* To use register names with standard convension, please use CAN_MO236_FGPR.
*/
#define	CAN_MOFGPR236	(CAN_MO236_FGPR)

/** \\brief  2D88, Message Object  Interrupt Pointer Register */
#define CAN_MO236_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD88u)

/** Alias (User Manual Name) for CAN_MO236_IPR.
* To use register names with standard convension, please use CAN_MO236_IPR.
*/
#define	CAN_MOIPR236	(CAN_MO236_IPR)

/** \\brief  2DAC, Message Object  Acceptance Mask Register */
#define CAN_MO237_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ADACu)

/** Alias (User Manual Name) for CAN_MO237_AMR.
* To use register names with standard convension, please use CAN_MO237_AMR.
*/
#define	CAN_MOAMR237	(CAN_MO237_AMR)

/** \\brief  2DB8, Message Object  Arbitration Register */
#define CAN_MO237_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ADB8u)

/** Alias (User Manual Name) for CAN_MO237_AR.
* To use register names with standard convension, please use CAN_MO237_AR.
*/
#define	CAN_MOAR237	(CAN_MO237_AR)

/** \\brief  2DBC, Message Object  Control Register */
#define CAN_MO237_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ADBCu)

/** Alias (User Manual Name) for CAN_MO237_CTR_STAT.
* To use register names with standard convension, please use CAN_MO237_CTR_STAT.
*/
#define	CAN_MOCTR237	(CAN_MO237_CTR_STAT)

