keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO237_CTR_STAT.
* To use register names with standard convension, please use CAN_MO237_CTR_STAT.
*/
#define	CAN_MOSTAT237	(CAN_MO237_CTR_STAT)

/** \\brief  2DB4, Message Object  Data Register High */
#define CAN_MO237_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ADB4u)

/** Alias (User Manual Name) for CAN_MO237_DATAH.
* To use register names with standard convension, please use CAN_MO237_DATAH.
*/
#define	CAN_MODATAH237	(CAN_MO237_DATAH)

/** \\brief  2DB0, Message Object  Data Register Low */
#define CAN_MO237_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ADB0u)

/** Alias (User Manual Name) for CAN_MO237_DATAL.
* To use register names with standard convension, please use CAN_MO237_DATAL.
*/
#define	CAN_MODATAL237	(CAN_MO237_DATAL)

/** \\brief  2DA0, Message Object  Function Control Register */
#define CAN_MO237_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ADA0u)

/** Alias (User Manual Name) for CAN_MO237_FCR.
* To use register names with standard convension, please use CAN_MO237_FCR.
*/
#define	CAN_MOFCR237	(CAN_MO237_FCR)

/** \\brief  2DA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO237_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ADA4u)

/** Alias (User Manual Name) for CAN_MO237_FGPR.
* To use register names with standard convension, please use CAN_MO237_FGPR.
*/
#define	CAN_MOFGPR237	(CAN_MO237_FGPR)

/** \\brief  2DA8, Message Object  Interrupt Pointer Register */
#define CAN_MO237_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ADA8u)

/** Alias (User Manual Name) for CAN_MO237_IPR.
* To use register names with standard convension, please use CAN_MO237_IPR.
*/
#define	CAN_MOIPR237	(CAN_MO237_IPR)

/** \\brief  2DCC, Message Object  Acceptance Mask Register */
#define CAN_MO238_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ADCCu)

/** Alias (User Manual Name) for CAN_MO238_AMR.
* To use register names with standard convension, please use CAN_MO238_AMR.
*/
#define	CAN_MOAMR238	(CAN_MO238_AMR)

/** \\brief  2DD8, Message Object  Arbitration Register */
#define CAN_MO238_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ADD8u)

/** Alias (User Manual Name) for CAN_MO238_AR.
* To use register names with standard convension, please use CAN_MO238_AR.
*/
#define	CAN_MOAR238	(CAN_MO238_AR)

/** \\brief  2DDC, Message Object  Control Register */
#define CAN_MO238_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ADDCu)

/** Alias (User Manual Name) for CAN_MO238_CTR_STAT.
* To use register names with standard convension, please use CAN_MO238_CTR_STAT.
*/
#define	CAN_MOCTR238	(CAN_MO238_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO238_CTR_STAT.
* To use register names with standard convension, please use CAN_MO238_CTR_STAT.
*/
#define	CAN_MOSTAT238	(CAN_MO238_CTR_STAT)

/** \\brief  2DD4, Message Object  Data Register High */
#define CAN_MO238_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ADD4u)

/** Alias (User Manual Name) for CAN_MO238_DATAH.
* To use register names with standard convension, please use CAN_MO238_DATAH.
*/
#define	CAN_MODATAH238	(CAN_MO238_DATAH)

/** \\brief  2DD0, Message Object  Data Register Low */
#define CAN_MO238_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ADD0u)

/** Alias (User Manual Name) for CAN_MO238_DATAL.
* To use register names with standard convension, please use CAN_MO238_DATAL.
*/
#define	CAN_MODATAL238	(CAN_MO238_DATAL)

/** \\brief  2DC0, Message Object  Function Control Register */
#define CAN_MO238_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ADC0u)

/** Alias (User Manual Name) for CAN_MO238_FCR.
* To use register names with standard convension, please use CAN_MO238_FCR.
*/
#define	CAN_MOFCR238	(CAN_MO238_FCR)

/** \\brief  2DC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO238_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ADC4u)

/** Alias (User Manual Name) for CAN_MO238_FGPR.
* To use register names with standard convension, please use CAN_MO238_FGPR.
*/
#define	CAN_MOFGPR238	(CAN_MO238_FGPR)

/** \\brief  2DC8, Message Object  Interrupt Pointer Register */
#define CAN_MO238_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ADC8u)

/** Alias (User Manual Name) for CAN_MO238_IPR.
* To use register names with standard convension, please use CAN_MO238_IPR.
*/
#define	CAN_MOIPR238	(CAN_MO238_IPR)

/** \\brief  2DEC, Message Object  Acceptance Mask Register */
#define CAN_MO239_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ADECu)

/** Alias (User Manual Name) for CAN_MO239_AMR.
* To use register names with standard convension, please use CAN_MO239_AMR.
*/
#define	CAN_MOAMR239	(CAN_MO239_AMR)

/** \\brief  2DF8, Message Object  Arbitration Register */
#define CAN_MO239_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ADF8u)

/** Alias (User Manual Name) for CAN_MO239_AR.
* To use register names with standard convension, please use CAN_MO239_AR.
*/
#define	CAN_MOAR239	(CAN_MO239_AR)

/** \\brief  2DFC, Message Object  Control Register */
#define CAN_MO239_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ADFCu)

/** Alias (User Manual Name) for CAN_MO239_CTR_STAT.
* To use register names with standard convension, please use CAN_MO239_CTR_STAT.
*/
#define	CAN_MOCTR239	(CAN_MO239_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO239_CTR_STAT.
* To use register names with standard convension, please use CAN_MO239_CTR_STAT.
*/
#define	CAN_MOSTAT239	(CAN_MO239_CTR_STAT)

/** \\brief  2DF4, Message Object  Data Register High */
#define CAN_MO239_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ADF4u)

/** Alias (User Manual Name) for CAN_MO239_DATAH.
* To use register names with standard convension, please use CAN_MO239_DATAH.
*/
#define	CAN_MODATAH239	(CAN_MO239_DATAH)

/** \\brief  2DF0, Message Object  Data Register Low */
#define CAN_MO239_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ADF0u)

/** Alias (User Manual Name) for CAN_MO239_DATAL.
* To use register names with standard convension, please use CAN_MO239_DATAL.
*/
#define	CAN_MODATAL239	(CAN_MO239_DATAL)

/** \\brief  2DE0, Message Object  Function Control Register */
#define CAN_MO239_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ADE0u)

/** Alias (User Manual Name) for CAN_MO239_FCR.
* To use register names with standard convension, please use CAN_MO239_FCR.
*/
#define	CAN_MOFCR239	(CAN_MO239_FCR)

/** \\brief  2DE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO239_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ADE4u)

/** Alias (User Manual Name) for CAN_MO239_FGPR.
* To use register names with standard convension, please use CAN_MO239_FGPR.
*/
#define	CAN_MOFGPR239	(CAN_MO239_FGPR)

/** \\brief  2DE8, Message Object  Interrupt Pointer Register */
#define CAN_MO239_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ADE8u)

/** Alias (User Manual Name) for CAN_MO239_IPR.
* To use register names with standard convension, please use CAN_MO239_IPR.
*/
#define	CAN_MOIPR239	(CAN_MO239_IPR)

/** \\brief  12EC, Message Object  Acceptance Mask Register */
#define CAN_MO23_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00192ECu)

/** Alias (User Manual Name) for CAN_MO23_AMR.
* To use register names with standard convension, please use CAN_MO23_AMR.
*/
#define	CAN_MOAMR23	(CAN_MO23_AMR)

