keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  12F8, Message Object  Arbitration Register */
#define CAN_MO23_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00192F8u)

/** Alias (User Manual Name) for CAN_MO23_AR.
* To use register names with standard convension, please use CAN_MO23_AR.
*/
#define	CAN_MOAR23	(CAN_MO23_AR)

/** \\brief  12FC, Message Object  Control Register */
#define CAN_MO23_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00192FCu)

/** Alias (User Manual Name) for CAN_MO23_CTR_STAT.
* To use register names with standard convension, please use CAN_MO23_CTR_STAT.
*/
#define	CAN_MOSTAT23	(CAN_MO23_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO23_CTR_STAT.
* To use register names with standard convension, please use CAN_MO23_CTR_STAT.
*/
#define	CAN_MOCTR23	(CAN_MO23_CTR_STAT)

/** \\brief  12F4, Message Object  Data Register High */
#define CAN_MO23_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00192F4u)

/** Alias (User Manual Name) for CAN_MO23_DATAH.
* To use register names with standard convension, please use CAN_MO23_DATAH.
*/
#define	CAN_MODATAH23	(CAN_MO23_DATAH)

/** \\brief  12F0, Message Object  Data Register Low */
#define CAN_MO23_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00192F0u)

/** Alias (User Manual Name) for CAN_MO23_DATAL.
* To use register names with standard convension, please use CAN_MO23_DATAL.
*/
#define	CAN_MODATAL23	(CAN_MO23_DATAL)

/** \\brief  12E0, Message Object  Function Control Register */
#define CAN_MO23_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00192E0u)

/** Alias (User Manual Name) for CAN_MO23_FCR.
* To use register names with standard convension, please use CAN_MO23_FCR.
*/
#define	CAN_MOFCR23	(CAN_MO23_FCR)

/** \\brief  12E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO23_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00192E4u)

/** Alias (User Manual Name) for CAN_MO23_FGPR.
* To use register names with standard convension, please use CAN_MO23_FGPR.
*/
#define	CAN_MOFGPR23	(CAN_MO23_FGPR)

/** \\brief  12E8, Message Object  Interrupt Pointer Register */
#define CAN_MO23_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00192E8u)

/** Alias (User Manual Name) for CAN_MO23_IPR.
* To use register names with standard convension, please use CAN_MO23_IPR.
*/
#define	CAN_MOIPR23	(CAN_MO23_IPR)

/** \\brief  2E0C, Message Object  Acceptance Mask Register */
#define CAN_MO240_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE0Cu)

/** Alias (User Manual Name) for CAN_MO240_AMR.
* To use register names with standard convension, please use CAN_MO240_AMR.
*/
#define	CAN_MOAMR240	(CAN_MO240_AMR)

/** \\brief  2E18, Message Object  Arbitration Register */
#define CAN_MO240_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE18u)

/** Alias (User Manual Name) for CAN_MO240_AR.
* To use register names with standard convension, please use CAN_MO240_AR.
*/
#define	CAN_MOAR240	(CAN_MO240_AR)

/** \\brief  2E1C, Message Object  Control Register */
#define CAN_MO240_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AE1Cu)

/** Alias (User Manual Name) for CAN_MO240_CTR_STAT.
* To use register names with standard convension, please use CAN_MO240_CTR_STAT.
*/
#define	CAN_MOSTAT240	(CAN_MO240_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO240_CTR_STAT.
* To use register names with standard convension, please use CAN_MO240_CTR_STAT.
*/
#define	CAN_MOCTR240	(CAN_MO240_CTR_STAT)

/** \\brief  2E14, Message Object  Data Register High */
#define CAN_MO240_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE14u)

/** Alias (User Manual Name) for CAN_MO240_DATAH.
* To use register names with standard convension, please use CAN_MO240_DATAH.
*/
#define	CAN_MODATAH240	(CAN_MO240_DATAH)

/** \\brief  2E10, Message Object  Data Register Low */
#define CAN_MO240_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE10u)

/** Alias (User Manual Name) for CAN_MO240_DATAL.
* To use register names with standard convension, please use CAN_MO240_DATAL.
*/
#define	CAN_MODATAL240	(CAN_MO240_DATAL)

/** \\brief  2E00, Message Object  Function Control Register */
#define CAN_MO240_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE00u)

/** Alias (User Manual Name) for CAN_MO240_FCR.
* To use register names with standard convension, please use CAN_MO240_FCR.
*/
#define	CAN_MOFCR240	(CAN_MO240_FCR)

/** \\brief  2E04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO240_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE04u)

/** Alias (User Manual Name) for CAN_MO240_FGPR.
* To use register names with standard convension, please use CAN_MO240_FGPR.
*/
#define	CAN_MOFGPR240	(CAN_MO240_FGPR)

/** \\brief  2E08, Message Object  Interrupt Pointer Register */
#define CAN_MO240_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE08u)

/** Alias (User Manual Name) for CAN_MO240_IPR.
* To use register names with standard convension, please use CAN_MO240_IPR.
*/
#define	CAN_MOIPR240	(CAN_MO240_IPR)

/** \\brief  2E2C, Message Object  Acceptance Mask Register */
#define CAN_MO241_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE2Cu)

/** Alias (User Manual Name) for CAN_MO241_AMR.
* To use register names with standard convension, please use CAN_MO241_AMR.
*/
#define	CAN_MOAMR241	(CAN_MO241_AMR)

/** \\brief  2E38, Message Object  Arbitration Register */
#define CAN_MO241_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE38u)

/** Alias (User Manual Name) for CAN_MO241_AR.
* To use register names with standard convension, please use CAN_MO241_AR.
*/
#define	CAN_MOAR241	(CAN_MO241_AR)

/** \\brief  2E3C, Message Object  Control Register */
#define CAN_MO241_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AE3Cu)

/** Alias (User Manual Name) for CAN_MO241_CTR_STAT.
* To use register names with standard convension, please use CAN_MO241_CTR_STAT.
*/
#define	CAN_MOSTAT241	(CAN_MO241_CTR_STAT)

