keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO241_CTR_STAT.
* To use register names with standard convension, please use CAN_MO241_CTR_STAT.
*/
#define	CAN_MOCTR241	(CAN_MO241_CTR_STAT)

/** \\brief  2E34, Message Object  Data Register High */
#define CAN_MO241_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE34u)

/** Alias (User Manual Name) for CAN_MO241_DATAH.
* To use register names with standard convension, please use CAN_MO241_DATAH.
*/
#define	CAN_MODATAH241	(CAN_MO241_DATAH)

/** \\brief  2E30, Message Object  Data Register Low */
#define CAN_MO241_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE30u)

/** Alias (User Manual Name) for CAN_MO241_DATAL.
* To use register names with standard convension, please use CAN_MO241_DATAL.
*/
#define	CAN_MODATAL241	(CAN_MO241_DATAL)

/** \\brief  2E20, Message Object  Function Control Register */
#define CAN_MO241_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE20u)

/** Alias (User Manual Name) for CAN_MO241_FCR.
* To use register names with standard convension, please use CAN_MO241_FCR.
*/
#define	CAN_MOFCR241	(CAN_MO241_FCR)

/** \\brief  2E24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO241_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE24u)

/** Alias (User Manual Name) for CAN_MO241_FGPR.
* To use register names with standard convension, please use CAN_MO241_FGPR.
*/
#define	CAN_MOFGPR241	(CAN_MO241_FGPR)

/** \\brief  2E28, Message Object  Interrupt Pointer Register */
#define CAN_MO241_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE28u)

/** Alias (User Manual Name) for CAN_MO241_IPR.
* To use register names with standard convension, please use CAN_MO241_IPR.
*/
#define	CAN_MOIPR241	(CAN_MO241_IPR)

/** \\brief  2E4C, Message Object  Acceptance Mask Register */
#define CAN_MO242_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE4Cu)

/** Alias (User Manual Name) for CAN_MO242_AMR.
* To use register names with standard convension, please use CAN_MO242_AMR.
*/
#define	CAN_MOAMR242	(CAN_MO242_AMR)

/** \\brief  2E58, Message Object  Arbitration Register */
#define CAN_MO242_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE58u)

/** Alias (User Manual Name) for CAN_MO242_AR.
* To use register names with standard convension, please use CAN_MO242_AR.
*/
#define	CAN_MOAR242	(CAN_MO242_AR)

/** \\brief  2E5C, Message Object  Control Register */
#define CAN_MO242_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AE5Cu)

/** Alias (User Manual Name) for CAN_MO242_CTR_STAT.
* To use register names with standard convension, please use CAN_MO242_CTR_STAT.
*/
#define	CAN_MOSTAT242	(CAN_MO242_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO242_CTR_STAT.
* To use register names with standard convension, please use CAN_MO242_CTR_STAT.
*/
#define	CAN_MOCTR242	(CAN_MO242_CTR_STAT)

/** \\brief  2E54, Message Object  Data Register High */
#define CAN_MO242_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE54u)

/** Alias (User Manual Name) for CAN_MO242_DATAH.
* To use register names with standard convension, please use CAN_MO242_DATAH.
*/
#define	CAN_MODATAH242	(CAN_MO242_DATAH)

/** \\brief  2E50, Message Object  Data Register Low */
#define CAN_MO242_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE50u)

/** Alias (User Manual Name) for CAN_MO242_DATAL.
* To use register names with standard convension, please use CAN_MO242_DATAL.
*/
#define	CAN_MODATAL242	(CAN_MO242_DATAL)

/** \\brief  2E40, Message Object  Function Control Register */
#define CAN_MO242_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE40u)

/** Alias (User Manual Name) for CAN_MO242_FCR.
* To use register names with standard convension, please use CAN_MO242_FCR.
*/
#define	CAN_MOFCR242	(CAN_MO242_FCR)

/** \\brief  2E44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO242_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE44u)

/** Alias (User Manual Name) for CAN_MO242_FGPR.
* To use register names with standard convension, please use CAN_MO242_FGPR.
*/
#define	CAN_MOFGPR242	(CAN_MO242_FGPR)

/** \\brief  2E48, Message Object  Interrupt Pointer Register */
#define CAN_MO242_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE48u)

/** Alias (User Manual Name) for CAN_MO242_IPR.
* To use register names with standard convension, please use CAN_MO242_IPR.
*/
#define	CAN_MOIPR242	(CAN_MO242_IPR)

/** \\brief  2E6C, Message Object  Acceptance Mask Register */
#define CAN_MO243_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE6Cu)

/** Alias (User Manual Name) for CAN_MO243_AMR.
* To use register names with standard convension, please use CAN_MO243_AMR.
*/
#define	CAN_MOAMR243	(CAN_MO243_AMR)

/** \\brief  2E78, Message Object  Arbitration Register */
#define CAN_MO243_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE78u)

/** Alias (User Manual Name) for CAN_MO243_AR.
* To use register names with standard convension, please use CAN_MO243_AR.
*/
#define	CAN_MOAR243	(CAN_MO243_AR)

/** \\brief  2E7C, Message Object  Control Register */
#define CAN_MO243_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AE7Cu)

/** Alias (User Manual Name) for CAN_MO243_CTR_STAT.
* To use register names with standard convension, please use CAN_MO243_CTR_STAT.
*/
#define	CAN_MOSTAT243	(CAN_MO243_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO243_CTR_STAT.
* To use register names with standard convension, please use CAN_MO243_CTR_STAT.
*/
#define	CAN_MOCTR243	(CAN_MO243_CTR_STAT)

/** \\brief  2E74, Message Object  Data Register High */
#define CAN_MO243_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE74u)

/** Alias (User Manual Name) for CAN_MO243_DATAH.
* To use register names with standard convension, please use CAN_MO243_DATAH.
*/
#define	CAN_MODATAH243	(CAN_MO243_DATAH)

/** \\brief  2E70, Message Object  Data Register Low */
#define CAN_MO243_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE70u)

/** Alias (User Manual Name) for CAN_MO243_DATAL.
* To use register names with standard convension, please use CAN_MO243_DATAL.
*/
#define	CAN_MODATAL243	(CAN_MO243_DATAL)

/** \\brief  2E60, Message Object  Function Control Register */
#define CAN_MO243_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE60u)

/** Alias (User Manual Name) for CAN_MO243_FCR.
* To use register names with standard convension, please use CAN_MO243_FCR.
*/
#define	CAN_MOFCR243	(CAN_MO243_FCR)

