keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO245_IPR.
* To use register names with standard convension, please use CAN_MO245_IPR.
*/
#define	CAN_MOIPR245	(CAN_MO245_IPR)

/** \\brief  2ECC, Message Object  Acceptance Mask Register */
#define CAN_MO246_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AECCu)

/** Alias (User Manual Name) for CAN_MO246_AMR.
* To use register names with standard convension, please use CAN_MO246_AMR.
*/
#define	CAN_MOAMR246	(CAN_MO246_AMR)

/** \\brief  2ED8, Message Object  Arbitration Register */
#define CAN_MO246_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AED8u)

/** Alias (User Manual Name) for CAN_MO246_AR.
* To use register names with standard convension, please use CAN_MO246_AR.
*/
#define	CAN_MOAR246	(CAN_MO246_AR)

/** \\brief  2EDC, Message Object  Control Register */
#define CAN_MO246_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AEDCu)

/** Alias (User Manual Name) for CAN_MO246_CTR_STAT.
* To use register names with standard convension, please use CAN_MO246_CTR_STAT.
*/
#define	CAN_MOSTAT246	(CAN_MO246_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO246_CTR_STAT.
* To use register names with standard convension, please use CAN_MO246_CTR_STAT.
*/
#define	CAN_MOCTR246	(CAN_MO246_CTR_STAT)

/** \\brief  2ED4, Message Object  Data Register High */
#define CAN_MO246_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AED4u)

/** Alias (User Manual Name) for CAN_MO246_DATAH.
* To use register names with standard convension, please use CAN_MO246_DATAH.
*/
#define	CAN_MODATAH246	(CAN_MO246_DATAH)

/** \\brief  2ED0, Message Object  Data Register Low */
#define CAN_MO246_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AED0u)

/** Alias (User Manual Name) for CAN_MO246_DATAL.
* To use register names with standard convension, please use CAN_MO246_DATAL.
*/
#define	CAN_MODATAL246	(CAN_MO246_DATAL)

/** \\brief  2EC0, Message Object  Function Control Register */
#define CAN_MO246_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AEC0u)

/** Alias (User Manual Name) for CAN_MO246_FCR.
* To use register names with standard convension, please use CAN_MO246_FCR.
*/
#define	CAN_MOFCR246	(CAN_MO246_FCR)

/** \\brief  2EC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO246_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AEC4u)

/** Alias (User Manual Name) for CAN_MO246_FGPR.
* To use register names with standard convension, please use CAN_MO246_FGPR.
*/
#define	CAN_MOFGPR246	(CAN_MO246_FGPR)

/** \\brief  2EC8, Message Object  Interrupt Pointer Register */
#define CAN_MO246_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AEC8u)

/** Alias (User Manual Name) for CAN_MO246_IPR.
* To use register names with standard convension, please use CAN_MO246_IPR.
*/
#define	CAN_MOIPR246	(CAN_MO246_IPR)

/** \\brief  2EEC, Message Object  Acceptance Mask Register */
#define CAN_MO247_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AEECu)

/** Alias (User Manual Name) for CAN_MO247_AMR.
* To use register names with standard convension, please use CAN_MO247_AMR.
*/
#define	CAN_MOAMR247	(CAN_MO247_AMR)

/** \\brief  2EF8, Message Object  Arbitration Register */
#define CAN_MO247_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AEF8u)

/** Alias (User Manual Name) for CAN_MO247_AR.
* To use register names with standard convension, please use CAN_MO247_AR.
*/
#define	CAN_MOAR247	(CAN_MO247_AR)

/** \\brief  2EFC, Message Object  Control Register */
#define CAN_MO247_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AEFCu)

/** Alias (User Manual Name) for CAN_MO247_CTR_STAT.
* To use register names with standard convension, please use CAN_MO247_CTR_STAT.
*/
#define	CAN_MOSTAT247	(CAN_MO247_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO247_CTR_STAT.
* To use register names with standard convension, please use CAN_MO247_CTR_STAT.
*/
#define	CAN_MOCTR247	(CAN_MO247_CTR_STAT)

/** \\brief  2EF4, Message Object  Data Register High */
#define CAN_MO247_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AEF4u)

/** Alias (User Manual Name) for CAN_MO247_DATAH.
* To use register names with standard convension, please use CAN_MO247_DATAH.
*/
#define	CAN_MODATAH247	(CAN_MO247_DATAH)

/** \\brief  2EF0, Message Object  Data Register Low */
#define CAN_MO247_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AEF0u)

/** Alias (User Manual Name) for CAN_MO247_DATAL.
* To use register names with standard convension, please use CAN_MO247_DATAL.
*/
#define	CAN_MODATAL247	(CAN_MO247_DATAL)

/** \\brief  2EE0, Message Object  Function Control Register */
#define CAN_MO247_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AEE0u)

/** Alias (User Manual Name) for CAN_MO247_FCR.
* To use register names with standard convension, please use CAN_MO247_FCR.
*/
#define	CAN_MOFCR247	(CAN_MO247_FCR)

/** \\brief  2EE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO247_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AEE4u)

/** Alias (User Manual Name) for CAN_MO247_FGPR.
* To use register names with standard convension, please use CAN_MO247_FGPR.
*/
#define	CAN_MOFGPR247	(CAN_MO247_FGPR)

/** \\brief  2EE8, Message Object  Interrupt Pointer Register */
#define CAN_MO247_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AEE8u)

/** Alias (User Manual Name) for CAN_MO247_IPR.
* To use register names with standard convension, please use CAN_MO247_IPR.
*/
#define	CAN_MOIPR247	(CAN_MO247_IPR)

/** \\brief  2F0C, Message Object  Acceptance Mask Register */
#define CAN_MO248_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF0Cu)

/** Alias (User Manual Name) for CAN_MO248_AMR.
* To use register names with standard convension, please use CAN_MO248_AMR.
*/
#define	CAN_MOAMR248	(CAN_MO248_AMR)

/** \\brief  2F18, Message Object  Arbitration Register */
#define CAN_MO248_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF18u)

/** Alias (User Manual Name) for CAN_MO248_AR.
* To use register names with standard convension, please use CAN_MO248_AR.
*/
#define	CAN_MOAR248	(CAN_MO248_AR)

