keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2F1C, Message Object  Control Register */
#define CAN_MO248_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AF1Cu)

/** Alias (User Manual Name) for CAN_MO248_CTR_STAT.
* To use register names with standard convension, please use CAN_MO248_CTR_STAT.
*/
#define	CAN_MOSTAT248	(CAN_MO248_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO248_CTR_STAT.
* To use register names with standard convension, please use CAN_MO248_CTR_STAT.
*/
#define	CAN_MOCTR248	(CAN_MO248_CTR_STAT)

/** \\brief  2F14, Message Object  Data Register High */
#define CAN_MO248_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF14u)

/** Alias (User Manual Name) for CAN_MO248_DATAH.
* To use register names with standard convension, please use CAN_MO248_DATAH.
*/
#define	CAN_MODATAH248	(CAN_MO248_DATAH)

/** \\brief  2F10, Message Object  Data Register Low */
#define CAN_MO248_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF10u)

/** Alias (User Manual Name) for CAN_MO248_DATAL.
* To use register names with standard convension, please use CAN_MO248_DATAL.
*/
#define	CAN_MODATAL248	(CAN_MO248_DATAL)

/** \\brief  2F00, Message Object  Function Control Register */
#define CAN_MO248_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF00u)

/** Alias (User Manual Name) for CAN_MO248_FCR.
* To use register names with standard convension, please use CAN_MO248_FCR.
*/
#define	CAN_MOFCR248	(CAN_MO248_FCR)

/** \\brief  2F04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO248_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF04u)

/** Alias (User Manual Name) for CAN_MO248_FGPR.
* To use register names with standard convension, please use CAN_MO248_FGPR.
*/
#define	CAN_MOFGPR248	(CAN_MO248_FGPR)

/** \\brief  2F08, Message Object  Interrupt Pointer Register */
#define CAN_MO248_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF08u)

/** Alias (User Manual Name) for CAN_MO248_IPR.
* To use register names with standard convension, please use CAN_MO248_IPR.
*/
#define	CAN_MOIPR248	(CAN_MO248_IPR)

/** \\brief  2F2C, Message Object  Acceptance Mask Register */
#define CAN_MO249_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF2Cu)

/** Alias (User Manual Name) for CAN_MO249_AMR.
* To use register names with standard convension, please use CAN_MO249_AMR.
*/
#define	CAN_MOAMR249	(CAN_MO249_AMR)

/** \\brief  2F38, Message Object  Arbitration Register */
#define CAN_MO249_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF38u)

/** Alias (User Manual Name) for CAN_MO249_AR.
* To use register names with standard convension, please use CAN_MO249_AR.
*/
#define	CAN_MOAR249	(CAN_MO249_AR)

/** \\brief  2F3C, Message Object  Control Register */
#define CAN_MO249_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AF3Cu)

/** Alias (User Manual Name) for CAN_MO249_CTR_STAT.
* To use register names with standard convension, please use CAN_MO249_CTR_STAT.
*/
#define	CAN_MOSTAT249	(CAN_MO249_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO249_CTR_STAT.
* To use register names with standard convension, please use CAN_MO249_CTR_STAT.
*/
#define	CAN_MOCTR249	(CAN_MO249_CTR_STAT)

/** \\brief  2F34, Message Object  Data Register High */
#define CAN_MO249_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF34u)

/** Alias (User Manual Name) for CAN_MO249_DATAH.
* To use register names with standard convension, please use CAN_MO249_DATAH.
*/
#define	CAN_MODATAH249	(CAN_MO249_DATAH)

/** \\brief  2F30, Message Object  Data Register Low */
#define CAN_MO249_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF30u)

/** Alias (User Manual Name) for CAN_MO249_DATAL.
* To use register names with standard convension, please use CAN_MO249_DATAL.
*/
#define	CAN_MODATAL249	(CAN_MO249_DATAL)

/** \\brief  2F20, Message Object  Function Control Register */
#define CAN_MO249_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF20u)

/** Alias (User Manual Name) for CAN_MO249_FCR.
* To use register names with standard convension, please use CAN_MO249_FCR.
*/
#define	CAN_MOFCR249	(CAN_MO249_FCR)

/** \\brief  2F24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO249_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF24u)

/** Alias (User Manual Name) for CAN_MO249_FGPR.
* To use register names with standard convension, please use CAN_MO249_FGPR.
*/
#define	CAN_MOFGPR249	(CAN_MO249_FGPR)

/** \\brief  2F28, Message Object  Interrupt Pointer Register */
#define CAN_MO249_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF28u)

/** Alias (User Manual Name) for CAN_MO249_IPR.
* To use register names with standard convension, please use CAN_MO249_IPR.
*/
#define	CAN_MOIPR249	(CAN_MO249_IPR)

/** \\brief  130C, Message Object  Acceptance Mask Register */
#define CAN_MO24_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001930Cu)

/** Alias (User Manual Name) for CAN_MO24_AMR.
* To use register names with standard convension, please use CAN_MO24_AMR.
*/
#define	CAN_MOAMR24	(CAN_MO24_AMR)

/** \\brief  1318, Message Object  Arbitration Register */
#define CAN_MO24_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019318u)

/** Alias (User Manual Name) for CAN_MO24_AR.
* To use register names with standard convension, please use CAN_MO24_AR.
*/
#define	CAN_MOAR24	(CAN_MO24_AR)

/** \\brief  131C, Message Object  Control Register */
#define CAN_MO24_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001931Cu)

/** Alias (User Manual Name) for CAN_MO24_CTR_STAT.
* To use register names with standard convension, please use CAN_MO24_CTR_STAT.
*/
#define	CAN_MOSTAT24	(CAN_MO24_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO24_CTR_STAT.
* To use register names with standard convension, please use CAN_MO24_CTR_STAT.
*/
#define	CAN_MOCTR24	(CAN_MO24_CTR_STAT)

/** \\brief  1314, Message Object  Data Register High */
#define CAN_MO24_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019314u)

/** Alias (User Manual Name) for CAN_MO24_DATAH.
* To use register names with standard convension, please use CAN_MO24_DATAH.
*/
#define	CAN_MODATAH24	(CAN_MO24_DATAH)

/** \\brief  1310, Message Object  Data Register Low */
#define CAN_MO24_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019310u)

/** Alias (User Manual Name) for CAN_MO24_DATAL.
* To use register names with standard convension, please use CAN_MO24_DATAL.
*/
#define	CAN_MODATAL24	(CAN_MO24_DATAL)

