keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  51C, Node Timer Clock Control Register */
#define CAN_N3_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF001851Cu)

/** Alias (User Manual Name) for CAN_N3_TCCR.
* To use register names with standard convension, please use CAN_N3_TCCR.
*/
#define	CAN_NTCCR3	(CAN_N3_TCCR)

/** \\brief  52C, Node Timer C Transmit Trigger Register */
#define CAN_N3_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF001852Cu)

/** Alias (User Manual Name) for CAN_N3_TCTTR.
* To use register names with standard convension, please use CAN_N3_TCTTR.
*/
#define	CAN_NTCTTR3	(CAN_N3_TCTTR)

/** \\brief  520, Node Timer Receive Timeout Register */
#define CAN_N3_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0018520u)

/** Alias (User Manual Name) for CAN_N3_TRTR.
* To use register names with standard convension, please use CAN_N3_TRTR.
*/
#define	CAN_NTRTR3	(CAN_N3_TRTR)

/** \\brief  E8, OCDS Control and Status */
#define CAN_OCS /*lint --e(923)*/ (*(volatile Ifx_CAN_OCS*)0xF00180E8u)

/** \\brief  1C4, Panel Control Register */
#define CAN_PANCTR /*lint --e(923)*/ (*(volatile Ifx_CAN_PANCTR*)0xF00181C4u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Can_Cfg_Canr
 * \{  */

/** \\brief  FC, Access Enable Register 0 */
#define CANR_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCEN0*)0xF00280FCu)

/** \\brief  F8, Access Enable Register 1 */
#define CANR_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_CAN_ACCEN1*)0xF00280F8u)

/** \\brief  0, CAN Clock Control Register */
#define CANR_CLC /*lint --e(923)*/ (*(volatile Ifx_CAN_CLC*)0xF0028000u)

/** \\brief  C, CAN Fractional Divider Register */
#define CANR_FDR /*lint --e(923)*/ (*(volatile Ifx_CAN_FDR*)0xF002800Cu)

/** \\brief  8, Module Identification Register */
#define CANR_ID /*lint --e(923)*/ (*(volatile Ifx_CAN_ID*)0xF0028008u)

/** \\brief  F4, Kernel Reset Register 0 */
#define CANR_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CAN_KRST0*)0xF00280F4u)

/** \\brief  F0, Kernel Reset Register 1 */
#define CANR_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CAN_KRST1*)0xF00280F0u)

/** \\brief  EC, Kernel Reset Status Clear Register */
#define CANR_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CAN_KRSTCLR*)0xF00280ECu)

/** \\brief  100, List Register */
#define CANR_LIST0 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028100u)

/** \\brief  104, List Register */
#define CANR_LIST1 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028104u)

/** \\brief  128, List Register */
#define CANR_LIST10 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028128u)

/** \\brief  12C, List Register */
#define CANR_LIST11 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF002812Cu)

/** \\brief  130, List Register */
#define CANR_LIST12 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028130u)

/** \\brief  134, List Register */
#define CANR_LIST13 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028134u)

/** \\brief  138, List Register */
#define CANR_LIST14 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028138u)

/** \\brief  13C, List Register */
#define CANR_LIST15 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF002813Cu)

/** \\brief  108, List Register */
#define CANR_LIST2 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028108u)

/** \\brief  10C, List Register */
#define CANR_LIST3 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF002810Cu)

/** \\brief  110, List Register */
#define CANR_LIST4 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028110u)

/** \\brief  114, List Register */
#define CANR_LIST5 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028114u)

/** \\brief  118, List Register */
#define CANR_LIST6 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028118u)

/** \\brief  11C, List Register */
#define CANR_LIST7 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF002811Cu)

/** \\brief  120, List Register */
#define CANR_LIST8 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028120u)

/** \\brief  124, List Register */
#define CANR_LIST9 /*lint --e(923)*/ (*(volatile Ifx_CAN_LIST*)0xF0028124u)

/** \\brief  1C8, Module Control Register */
#define CANR_MCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MCR*)0xF00281C8u)

/** \\brief  1D0, Measure Control Register */
#define CANR_MECR /*lint --e(923)*/ (*(volatile Ifx_CAN_MECR*)0xF00281D0u)

/** \\brief  1D4, Measure Status Register */
#define CANR_MESTAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MESTAT*)0xF00281D4u)

/** \\brief  1CC, Module Interrupt Trigger Register */
#define CANR_MITR /*lint --e(923)*/ (*(volatile Ifx_CAN_MITR*)0xF00281CCu)

/** \\brief  100C, Message Object  Acceptance Mask Register */
#define CANR_MO0_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002900Cu)

/** Alias (User Manual Name) for CANR_MO0_AMR.
* To use register names with standard convension, please use CANR_MO0_AMR.
*/
#define	CANR_MOAMR0	(CANR_MO0_AMR)

/** \\brief  1018, Message Object  Arbitration Register */
#define CANR_MO0_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029018u)

/** Alias (User Manual Name) for CANR_MO0_AR.
* To use register names with standard convension, please use CANR_MO0_AR.
*/
#define	CANR_MOAR0	(CANR_MO0_AR)

/** \\brief  101C, Message Object  Control Register */
#define CANR_MO0_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002901Cu)

/** Alias (User Manual Name) for CANR_MO0_CTR_STAT.
* To use register names with standard convension, please use CANR_MO0_CTR_STAT.
*/
#define	CANR_MOSTAT0	(CANR_MO0_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO0_CTR_STAT.
* To use register names with standard convension, please use CANR_MO0_CTR_STAT.
*/
#define	CANR_MOCTR0	(CANR_MO0_CTR_STAT)

/** \\brief  1014, Message Object  Data Register High */
#define CANR_MO0_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029014u)

/** Alias (User Manual Name) for CANR_MO0_DATAH.
* To use register names with standard convension, please use CANR_MO0_DATAH.
*/
#define	CANR_MODATAH0	(CANR_MO0_DATAH)

