keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1CA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO101_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029CA4u)

/** Alias (User Manual Name) for CANR_MO101_FGPR.
* To use register names with standard convension, please use CANR_MO101_FGPR.
*/
#define	CANR_MOFGPR101	(CANR_MO101_FGPR)

/** \\brief  1CA8, Message Object  Interrupt Pointer Register */
#define CANR_MO101_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029CA8u)

/** Alias (User Manual Name) for CANR_MO101_IPR.
* To use register names with standard convension, please use CANR_MO101_IPR.
*/
#define	CANR_MOIPR101	(CANR_MO101_IPR)

/** \\brief  1CCC, Message Object  Acceptance Mask Register */
#define CANR_MO102_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029CCCu)

/** Alias (User Manual Name) for CANR_MO102_AMR.
* To use register names with standard convension, please use CANR_MO102_AMR.
*/
#define	CANR_MOAMR102	(CANR_MO102_AMR)

/** \\brief  1CD8, Message Object  Arbitration Register */
#define CANR_MO102_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029CD8u)

/** Alias (User Manual Name) for CANR_MO102_AR.
* To use register names with standard convension, please use CANR_MO102_AR.
*/
#define	CANR_MOAR102	(CANR_MO102_AR)

/** \\brief  1CDC, Message Object  Control Register */
#define CANR_MO102_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029CDCu)

/** Alias (User Manual Name) for CANR_MO102_CTR_STAT.
* To use register names with standard convension, please use CANR_MO102_CTR_STAT.
*/
#define	CANR_MOCTR102	(CANR_MO102_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO102_CTR_STAT.
* To use register names with standard convension, please use CANR_MO102_CTR_STAT.
*/
#define	CANR_MOSTAT102	(CANR_MO102_CTR_STAT)

/** \\brief  1CD4, Message Object  Data Register High */
#define CANR_MO102_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029CD4u)

/** Alias (User Manual Name) for CANR_MO102_DATAH.
* To use register names with standard convension, please use CANR_MO102_DATAH.
*/
#define	CANR_MODATAH102	(CANR_MO102_DATAH)

/** \\brief  1CD0, Message Object  Data Register Low */
#define CANR_MO102_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029CD0u)

/** Alias (User Manual Name) for CANR_MO102_DATAL.
* To use register names with standard convension, please use CANR_MO102_DATAL.
*/
#define	CANR_MODATAL102	(CANR_MO102_DATAL)

/** \\brief  1CC0, Message Object  Function Control Register */
#define CANR_MO102_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029CC0u)

/** Alias (User Manual Name) for CANR_MO102_FCR.
* To use register names with standard convension, please use CANR_MO102_FCR.
*/
#define	CANR_MOFCR102	(CANR_MO102_FCR)

/** \\brief  1CC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO102_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029CC4u)

/** Alias (User Manual Name) for CANR_MO102_FGPR.
* To use register names with standard convension, please use CANR_MO102_FGPR.
*/
#define	CANR_MOFGPR102	(CANR_MO102_FGPR)

/** \\brief  1CC8, Message Object  Interrupt Pointer Register */
#define CANR_MO102_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029CC8u)

/** Alias (User Manual Name) for CANR_MO102_IPR.
* To use register names with standard convension, please use CANR_MO102_IPR.
*/
#define	CANR_MOIPR102	(CANR_MO102_IPR)

/** \\brief  1CEC, Message Object  Acceptance Mask Register */
#define CANR_MO103_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029CECu)

/** Alias (User Manual Name) for CANR_MO103_AMR.
* To use register names with standard convension, please use CANR_MO103_AMR.
*/
#define	CANR_MOAMR103	(CANR_MO103_AMR)

/** \\brief  1CF8, Message Object  Arbitration Register */
#define CANR_MO103_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029CF8u)

/** Alias (User Manual Name) for CANR_MO103_AR.
* To use register names with standard convension, please use CANR_MO103_AR.
*/
#define	CANR_MOAR103	(CANR_MO103_AR)

/** \\brief  1CFC, Message Object  Control Register */
#define CANR_MO103_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029CFCu)

/** Alias (User Manual Name) for CANR_MO103_CTR_STAT.
* To use register names with standard convension, please use CANR_MO103_CTR_STAT.
*/
#define	CANR_MOSTAT103	(CANR_MO103_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO103_CTR_STAT.
* To use register names with standard convension, please use CANR_MO103_CTR_STAT.
*/
#define	CANR_MOCTR103	(CANR_MO103_CTR_STAT)

/** \\brief  1CF4, Message Object  Data Register High */
#define CANR_MO103_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029CF4u)

/** Alias (User Manual Name) for CANR_MO103_DATAH.
* To use register names with standard convension, please use CANR_MO103_DATAH.
*/
#define	CANR_MODATAH103	(CANR_MO103_DATAH)

/** \\brief  1CF0, Message Object  Data Register Low */
#define CANR_MO103_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029CF0u)

/** Alias (User Manual Name) for CANR_MO103_DATAL.
* To use register names with standard convension, please use CANR_MO103_DATAL.
*/
#define	CANR_MODATAL103	(CANR_MO103_DATAL)

/** \\brief  1CE0, Message Object  Function Control Register */
#define CANR_MO103_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029CE0u)

/** Alias (User Manual Name) for CANR_MO103_FCR.
* To use register names with standard convension, please use CANR_MO103_FCR.
*/
#define	CANR_MOFCR103	(CANR_MO103_FCR)

/** \\brief  1CE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO103_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029CE4u)

/** Alias (User Manual Name) for CANR_MO103_FGPR.
* To use register names with standard convension, please use CANR_MO103_FGPR.
*/
#define	CANR_MOFGPR103	(CANR_MO103_FGPR)

/** \\brief  1CE8, Message Object  Interrupt Pointer Register */
#define CANR_MO103_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029CE8u)

/** Alias (User Manual Name) for CANR_MO103_IPR.
* To use register names with standard convension, please use CANR_MO103_IPR.
*/
#define	CANR_MOIPR103	(CANR_MO103_IPR)

/** \\brief  1D0C, Message Object  Acceptance Mask Register */
#define CANR_MO104_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D0Cu)

/** Alias (User Manual Name) for CANR_MO104_AMR.
* To use register names with standard convension, please use CANR_MO104_AMR.
*/
#define	CANR_MOAMR104	(CANR_MO104_AMR)

/** \\brief  1D18, Message Object  Arbitration Register */
#define CANR_MO104_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D18u)

/** Alias (User Manual Name) for CANR_MO104_AR.
* To use register names with standard convension, please use CANR_MO104_AR.
*/
#define	CANR_MOAR104	(CANR_MO104_AR)

/** \\brief  1D1C, Message Object  Control Register */
#define CANR_MO104_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029D1Cu)

/** Alias (User Manual Name) for CANR_MO104_CTR_STAT.
* To use register names with standard convension, please use CANR_MO104_CTR_STAT.
*/
#define	CANR_MOCTR104	(CANR_MO104_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO104_CTR_STAT.
* To use register names with standard convension, please use CANR_MO104_CTR_STAT.
*/
#define	CANR_MOSTAT104	(CANR_MO104_CTR_STAT)

/** \\brief  1D14, Message Object  Data Register High */
#define CANR_MO104_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D14u)

/** Alias (User Manual Name) for CANR_MO104_DATAH.
* To use register names with standard convension, please use CANR_MO104_DATAH.
*/
#define	CANR_MODATAH104	(CANR_MO104_DATAH)

/** \\brief  1D10, Message Object  Data Register Low */
#define CANR_MO104_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029D10u)

/** Alias (User Manual Name) for CANR_MO104_DATAL.
* To use register names with standard convension, please use CANR_MO104_DATAL.
*/
#define	CANR_MODATAL104	(CANR_MO104_DATAL)

/** \\brief  1D00, Message Object  Function Control Register */
#define CANR_MO104_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029D00u)

/** Alias (User Manual Name) for CANR_MO104_FCR.
* To use register names with standard convension, please use CANR_MO104_FCR.
*/
#define	CANR_MOFCR104	(CANR_MO104_FCR)

