keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1D04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO104_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029D04u)

/** Alias (User Manual Name) for CANR_MO104_FGPR.
* To use register names with standard convension, please use CANR_MO104_FGPR.
*/
#define	CANR_MOFGPR104	(CANR_MO104_FGPR)

/** \\brief  1D08, Message Object  Interrupt Pointer Register */
#define CANR_MO104_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029D08u)

/** Alias (User Manual Name) for CANR_MO104_IPR.
* To use register names with standard convension, please use CANR_MO104_IPR.
*/
#define	CANR_MOIPR104	(CANR_MO104_IPR)

/** \\brief  1D2C, Message Object  Acceptance Mask Register */
#define CANR_MO105_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D2Cu)

/** Alias (User Manual Name) for CANR_MO105_AMR.
* To use register names with standard convension, please use CANR_MO105_AMR.
*/
#define	CANR_MOAMR105	(CANR_MO105_AMR)

/** \\brief  1D38, Message Object  Arbitration Register */
#define CANR_MO105_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D38u)

/** Alias (User Manual Name) for CANR_MO105_AR.
* To use register names with standard convension, please use CANR_MO105_AR.
*/
#define	CANR_MOAR105	(CANR_MO105_AR)

/** \\brief  1D3C, Message Object  Control Register */
#define CANR_MO105_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029D3Cu)

/** Alias (User Manual Name) for CANR_MO105_CTR_STAT.
* To use register names with standard convension, please use CANR_MO105_CTR_STAT.
*/
#define	CANR_MOSTAT105	(CANR_MO105_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO105_CTR_STAT.
* To use register names with standard convension, please use CANR_MO105_CTR_STAT.
*/
#define	CANR_MOCTR105	(CANR_MO105_CTR_STAT)

/** \\brief  1D34, Message Object  Data Register High */
#define CANR_MO105_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D34u)

/** Alias (User Manual Name) for CANR_MO105_DATAH.
* To use register names with standard convension, please use CANR_MO105_DATAH.
*/
#define	CANR_MODATAH105	(CANR_MO105_DATAH)

/** \\brief  1D30, Message Object  Data Register Low */
#define CANR_MO105_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029D30u)

/** Alias (User Manual Name) for CANR_MO105_DATAL.
* To use register names with standard convension, please use CANR_MO105_DATAL.
*/
#define	CANR_MODATAL105	(CANR_MO105_DATAL)

/** \\brief  1D20, Message Object  Function Control Register */
#define CANR_MO105_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029D20u)

/** Alias (User Manual Name) for CANR_MO105_FCR.
* To use register names with standard convension, please use CANR_MO105_FCR.
*/
#define	CANR_MOFCR105	(CANR_MO105_FCR)

/** \\brief  1D24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO105_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029D24u)

/** Alias (User Manual Name) for CANR_MO105_FGPR.
* To use register names with standard convension, please use CANR_MO105_FGPR.
*/
#define	CANR_MOFGPR105	(CANR_MO105_FGPR)

/** \\brief  1D28, Message Object  Interrupt Pointer Register */
#define CANR_MO105_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029D28u)

/** Alias (User Manual Name) for CANR_MO105_IPR.
* To use register names with standard convension, please use CANR_MO105_IPR.
*/
#define	CANR_MOIPR105	(CANR_MO105_IPR)

/** \\brief  1D4C, Message Object  Acceptance Mask Register */
#define CANR_MO106_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D4Cu)

/** Alias (User Manual Name) for CANR_MO106_AMR.
* To use register names with standard convension, please use CANR_MO106_AMR.
*/
#define	CANR_MOAMR106	(CANR_MO106_AMR)

/** \\brief  1D58, Message Object  Arbitration Register */
#define CANR_MO106_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D58u)

/** Alias (User Manual Name) for CANR_MO106_AR.
* To use register names with standard convension, please use CANR_MO106_AR.
*/
#define	CANR_MOAR106	(CANR_MO106_AR)

/** \\brief  1D5C, Message Object  Control Register */
#define CANR_MO106_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029D5Cu)

/** Alias (User Manual Name) for CANR_MO106_CTR_STAT.
* To use register names with standard convension, please use CANR_MO106_CTR_STAT.
*/
#define	CANR_MOCTR106	(CANR_MO106_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO106_CTR_STAT.
* To use register names with standard convension, please use CANR_MO106_CTR_STAT.
*/
#define	CANR_MOSTAT106	(CANR_MO106_CTR_STAT)

/** \\brief  1D54, Message Object  Data Register High */
#define CANR_MO106_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D54u)

/** Alias (User Manual Name) for CANR_MO106_DATAH.
* To use register names with standard convension, please use CANR_MO106_DATAH.
*/
#define	CANR_MODATAH106	(CANR_MO106_DATAH)

/** \\brief  1D50, Message Object  Data Register Low */
#define CANR_MO106_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029D50u)

/** Alias (User Manual Name) for CANR_MO106_DATAL.
* To use register names with standard convension, please use CANR_MO106_DATAL.
*/
#define	CANR_MODATAL106	(CANR_MO106_DATAL)

/** \\brief  1D40, Message Object  Function Control Register */
#define CANR_MO106_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029D40u)

/** Alias (User Manual Name) for CANR_MO106_FCR.
* To use register names with standard convension, please use CANR_MO106_FCR.
*/
#define	CANR_MOFCR106	(CANR_MO106_FCR)

/** \\brief  1D44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO106_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029D44u)

/** Alias (User Manual Name) for CANR_MO106_FGPR.
* To use register names with standard convension, please use CANR_MO106_FGPR.
*/
#define	CANR_MOFGPR106	(CANR_MO106_FGPR)

/** \\brief  1D48, Message Object  Interrupt Pointer Register */
#define CANR_MO106_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029D48u)

/** Alias (User Manual Name) for CANR_MO106_IPR.
* To use register names with standard convension, please use CANR_MO106_IPR.
*/
#define	CANR_MOIPR106	(CANR_MO106_IPR)

/** \\brief  1D6C, Message Object  Acceptance Mask Register */
#define CANR_MO107_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029D6Cu)

/** Alias (User Manual Name) for CANR_MO107_AMR.
* To use register names with standard convension, please use CANR_MO107_AMR.
*/
#define	CANR_MOAMR107	(CANR_MO107_AMR)

/** \\brief  1D78, Message Object  Arbitration Register */
#define CANR_MO107_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029D78u)

/** Alias (User Manual Name) for CANR_MO107_AR.
* To use register names with standard convension, please use CANR_MO107_AR.
*/
#define	CANR_MOAR107	(CANR_MO107_AR)

/** \\brief  1D7C, Message Object  Control Register */
#define CANR_MO107_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029D7Cu)

/** Alias (User Manual Name) for CANR_MO107_CTR_STAT.
* To use register names with standard convension, please use CANR_MO107_CTR_STAT.
*/
#define	CANR_MOCTR107	(CANR_MO107_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO107_CTR_STAT.
* To use register names with standard convension, please use CANR_MO107_CTR_STAT.
*/
#define	CANR_MOSTAT107	(CANR_MO107_CTR_STAT)

/** \\brief  1D74, Message Object  Data Register High */
#define CANR_MO107_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029D74u)

