keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO109_FCR.
* To use register names with standard convension, please use CANR_MO109_FCR.
*/
#define	CANR_MOFCR109	(CANR_MO109_FCR)

/** \\brief  1DA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO109_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029DA4u)

/** Alias (User Manual Name) for CANR_MO109_FGPR.
* To use register names with standard convension, please use CANR_MO109_FGPR.
*/
#define	CANR_MOFGPR109	(CANR_MO109_FGPR)

/** \\brief  1DA8, Message Object  Interrupt Pointer Register */
#define CANR_MO109_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029DA8u)

/** Alias (User Manual Name) for CANR_MO109_IPR.
* To use register names with standard convension, please use CANR_MO109_IPR.
*/
#define	CANR_MOIPR109	(CANR_MO109_IPR)

/** \\brief  114C, Message Object  Acceptance Mask Register */
#define CANR_MO10_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002914Cu)

/** Alias (User Manual Name) for CANR_MO10_AMR.
* To use register names with standard convension, please use CANR_MO10_AMR.
*/
#define	CANR_MOAMR10	(CANR_MO10_AMR)

/** \\brief  1158, Message Object  Arbitration Register */
#define CANR_MO10_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029158u)

/** Alias (User Manual Name) for CANR_MO10_AR.
* To use register names with standard convension, please use CANR_MO10_AR.
*/
#define	CANR_MOAR10	(CANR_MO10_AR)

/** \\brief  115C, Message Object  Control Register */
#define CANR_MO10_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002915Cu)

/** Alias (User Manual Name) for CANR_MO10_CTR_STAT.
* To use register names with standard convension, please use CANR_MO10_CTR_STAT.
*/
#define	CANR_MOCTR10	(CANR_MO10_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO10_CTR_STAT.
* To use register names with standard convension, please use CANR_MO10_CTR_STAT.
*/
#define	CANR_MOSTAT10	(CANR_MO10_CTR_STAT)

/** \\brief  1154, Message Object  Data Register High */
#define CANR_MO10_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029154u)

/** Alias (User Manual Name) for CANR_MO10_DATAH.
* To use register names with standard convension, please use CANR_MO10_DATAH.
*/
#define	CANR_MODATAH10	(CANR_MO10_DATAH)

/** \\brief  1150, Message Object  Data Register Low */
#define CANR_MO10_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029150u)

/** Alias (User Manual Name) for CANR_MO10_DATAL.
* To use register names with standard convension, please use CANR_MO10_DATAL.
*/
#define	CANR_MODATAL10	(CANR_MO10_DATAL)

/** \\brief  1140, Message Object  Function Control Register */
#define CANR_MO10_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029140u)

/** Alias (User Manual Name) for CANR_MO10_FCR.
* To use register names with standard convension, please use CANR_MO10_FCR.
*/
#define	CANR_MOFCR10	(CANR_MO10_FCR)

/** \\brief  1144, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO10_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029144u)

/** Alias (User Manual Name) for CANR_MO10_FGPR.
* To use register names with standard convension, please use CANR_MO10_FGPR.
*/
#define	CANR_MOFGPR10	(CANR_MO10_FGPR)

/** \\brief  1148, Message Object  Interrupt Pointer Register */
#define CANR_MO10_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029148u)

/** Alias (User Manual Name) for CANR_MO10_IPR.
* To use register names with standard convension, please use CANR_MO10_IPR.
*/
#define	CANR_MOIPR10	(CANR_MO10_IPR)

/** \\brief  1DCC, Message Object  Acceptance Mask Register */
#define CANR_MO110_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029DCCu)

/** Alias (User Manual Name) for CANR_MO110_AMR.
* To use register names with standard convension, please use CANR_MO110_AMR.
*/
#define	CANR_MOAMR110	(CANR_MO110_AMR)

/** \\brief  1DD8, Message Object  Arbitration Register */
#define CANR_MO110_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029DD8u)

/** Alias (User Manual Name) for CANR_MO110_AR.
* To use register names with standard convension, please use CANR_MO110_AR.
*/
#define	CANR_MOAR110	(CANR_MO110_AR)

/** \\brief  1DDC, Message Object  Control Register */
#define CANR_MO110_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029DDCu)

/** Alias (User Manual Name) for CANR_MO110_CTR_STAT.
* To use register names with standard convension, please use CANR_MO110_CTR_STAT.
*/
#define	CANR_MOCTR110	(CANR_MO110_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO110_CTR_STAT.
* To use register names with standard convension, please use CANR_MO110_CTR_STAT.
*/
#define	CANR_MOSTAT110	(CANR_MO110_CTR_STAT)

/** \\brief  1DD4, Message Object  Data Register High */
#define CANR_MO110_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029DD4u)

/** Alias (User Manual Name) for CANR_MO110_DATAH.
* To use register names with standard convension, please use CANR_MO110_DATAH.
*/
#define	CANR_MODATAH110	(CANR_MO110_DATAH)

/** \\brief  1DD0, Message Object  Data Register Low */
#define CANR_MO110_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029DD0u)

/** Alias (User Manual Name) for CANR_MO110_DATAL.
* To use register names with standard convension, please use CANR_MO110_DATAL.
*/
#define	CANR_MODATAL110	(CANR_MO110_DATAL)

/** \\brief  1DC0, Message Object  Function Control Register */
#define CANR_MO110_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029DC0u)

/** Alias (User Manual Name) for CANR_MO110_FCR.
* To use register names with standard convension, please use CANR_MO110_FCR.
*/
#define	CANR_MOFCR110	(CANR_MO110_FCR)

/** \\brief  1DC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO110_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029DC4u)

/** Alias (User Manual Name) for CANR_MO110_FGPR.
* To use register names with standard convension, please use CANR_MO110_FGPR.
*/
#define	CANR_MOFGPR110	(CANR_MO110_FGPR)

/** \\brief  1DC8, Message Object  Interrupt Pointer Register */
#define CANR_MO110_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029DC8u)

/** Alias (User Manual Name) for CANR_MO110_IPR.
* To use register names with standard convension, please use CANR_MO110_IPR.
*/
#define	CANR_MOIPR110	(CANR_MO110_IPR)

/** \\brief  1DEC, Message Object  Acceptance Mask Register */
#define CANR_MO111_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029DECu)

/** Alias (User Manual Name) for CANR_MO111_AMR.
* To use register names with standard convension, please use CANR_MO111_AMR.
*/
#define	CANR_MOAMR111	(CANR_MO111_AMR)

/** \\brief  1DF8, Message Object  Arbitration Register */
#define CANR_MO111_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029DF8u)

