keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO111_AR.
* To use register names with standard convension, please use CANR_MO111_AR.
*/
#define	CANR_MOAR111	(CANR_MO111_AR)

/** \\brief  1DFC, Message Object  Control Register */
#define CANR_MO111_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029DFCu)

/** Alias (User Manual Name) for CANR_MO111_CTR_STAT.
* To use register names with standard convension, please use CANR_MO111_CTR_STAT.
*/
#define	CANR_MOCTR111	(CANR_MO111_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO111_CTR_STAT.
* To use register names with standard convension, please use CANR_MO111_CTR_STAT.
*/
#define	CANR_MOSTAT111	(CANR_MO111_CTR_STAT)

/** \\brief  1DF4, Message Object  Data Register High */
#define CANR_MO111_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029DF4u)

/** Alias (User Manual Name) for CANR_MO111_DATAH.
* To use register names with standard convension, please use CANR_MO111_DATAH.
*/
#define	CANR_MODATAH111	(CANR_MO111_DATAH)

/** \\brief  1DF0, Message Object  Data Register Low */
#define CANR_MO111_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029DF0u)

/** Alias (User Manual Name) for CANR_MO111_DATAL.
* To use register names with standard convension, please use CANR_MO111_DATAL.
*/
#define	CANR_MODATAL111	(CANR_MO111_DATAL)

/** \\brief  1DE0, Message Object  Function Control Register */
#define CANR_MO111_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029DE0u)

/** Alias (User Manual Name) for CANR_MO111_FCR.
* To use register names with standard convension, please use CANR_MO111_FCR.
*/
#define	CANR_MOFCR111	(CANR_MO111_FCR)

/** \\brief  1DE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO111_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029DE4u)

/** Alias (User Manual Name) for CANR_MO111_FGPR.
* To use register names with standard convension, please use CANR_MO111_FGPR.
*/
#define	CANR_MOFGPR111	(CANR_MO111_FGPR)

/** \\brief  1DE8, Message Object  Interrupt Pointer Register */
#define CANR_MO111_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029DE8u)

/** Alias (User Manual Name) for CANR_MO111_IPR.
* To use register names with standard convension, please use CANR_MO111_IPR.
*/
#define	CANR_MOIPR111	(CANR_MO111_IPR)

/** \\brief  1E0C, Message Object  Acceptance Mask Register */
#define CANR_MO112_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E0Cu)

/** Alias (User Manual Name) for CANR_MO112_AMR.
* To use register names with standard convension, please use CANR_MO112_AMR.
*/
#define	CANR_MOAMR112	(CANR_MO112_AMR)

/** \\brief  1E18, Message Object  Arbitration Register */
#define CANR_MO112_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E18u)

/** Alias (User Manual Name) for CANR_MO112_AR.
* To use register names with standard convension, please use CANR_MO112_AR.
*/
#define	CANR_MOAR112	(CANR_MO112_AR)

/** \\brief  1E1C, Message Object  Control Register */
#define CANR_MO112_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029E1Cu)

/** Alias (User Manual Name) for CANR_MO112_CTR_STAT.
* To use register names with standard convension, please use CANR_MO112_CTR_STAT.
*/
#define	CANR_MOCTR112	(CANR_MO112_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO112_CTR_STAT.
* To use register names with standard convension, please use CANR_MO112_CTR_STAT.
*/
#define	CANR_MOSTAT112	(CANR_MO112_CTR_STAT)

/** \\brief  1E14, Message Object  Data Register High */
#define CANR_MO112_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E14u)

/** Alias (User Manual Name) for CANR_MO112_DATAH.
* To use register names with standard convension, please use CANR_MO112_DATAH.
*/
#define	CANR_MODATAH112	(CANR_MO112_DATAH)

/** \\brief  1E10, Message Object  Data Register Low */
#define CANR_MO112_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E10u)

/** Alias (User Manual Name) for CANR_MO112_DATAL.
* To use register names with standard convension, please use CANR_MO112_DATAL.
*/
#define	CANR_MODATAL112	(CANR_MO112_DATAL)

/** \\brief  1E00, Message Object  Function Control Register */
#define CANR_MO112_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E00u)

/** Alias (User Manual Name) for CANR_MO112_FCR.
* To use register names with standard convension, please use CANR_MO112_FCR.
*/
#define	CANR_MOFCR112	(CANR_MO112_FCR)

/** \\brief  1E04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO112_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E04u)

/** Alias (User Manual Name) for CANR_MO112_FGPR.
* To use register names with standard convension, please use CANR_MO112_FGPR.
*/
#define	CANR_MOFGPR112	(CANR_MO112_FGPR)

/** \\brief  1E08, Message Object  Interrupt Pointer Register */
#define CANR_MO112_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E08u)

/** Alias (User Manual Name) for CANR_MO112_IPR.
* To use register names with standard convension, please use CANR_MO112_IPR.
*/
#define	CANR_MOIPR112	(CANR_MO112_IPR)

/** \\brief  1E2C, Message Object  Acceptance Mask Register */
#define CANR_MO113_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E2Cu)

/** Alias (User Manual Name) for CANR_MO113_AMR.
* To use register names with standard convension, please use CANR_MO113_AMR.
*/
#define	CANR_MOAMR113	(CANR_MO113_AMR)

/** \\brief  1E38, Message Object  Arbitration Register */
#define CANR_MO113_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E38u)

/** Alias (User Manual Name) for CANR_MO113_AR.
* To use register names with standard convension, please use CANR_MO113_AR.
*/
#define	CANR_MOAR113	(CANR_MO113_AR)

/** \\brief  1E3C, Message Object  Control Register */
#define CANR_MO113_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029E3Cu)

/** Alias (User Manual Name) for CANR_MO113_CTR_STAT.
* To use register names with standard convension, please use CANR_MO113_CTR_STAT.
*/
#define	CANR_MOCTR113	(CANR_MO113_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO113_CTR_STAT.
* To use register names with standard convension, please use CANR_MO113_CTR_STAT.
*/
#define	CANR_MOSTAT113	(CANR_MO113_CTR_STAT)

/** \\brief  1E34, Message Object  Data Register High */
#define CANR_MO113_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E34u)

/** Alias (User Manual Name) for CANR_MO113_DATAH.
* To use register names with standard convension, please use CANR_MO113_DATAH.
*/
#define	CANR_MODATAH113	(CANR_MO113_DATAH)

/** \\brief  1E30, Message Object  Data Register Low */
#define CANR_MO113_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E30u)

/** Alias (User Manual Name) for CANR_MO113_DATAL.
* To use register names with standard convension, please use CANR_MO113_DATAL.
*/
#define	CANR_MODATAL113	(CANR_MO113_DATAL)

/** \\brief  1E20, Message Object  Function Control Register */
#define CANR_MO113_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E20u)

/** Alias (User Manual Name) for CANR_MO113_FCR.
* To use register names with standard convension, please use CANR_MO113_FCR.
*/
#define	CANR_MOFCR113	(CANR_MO113_FCR)

/** \\brief  1E24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO113_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E24u)

/** Alias (User Manual Name) for CANR_MO113_FGPR.
* To use register names with standard convension, please use CANR_MO113_FGPR.
*/
#define	CANR_MOFGPR113	(CANR_MO113_FGPR)

/** \\brief  1E28, Message Object  Interrupt Pointer Register */
#define CANR_MO113_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E28u)

/** Alias (User Manual Name) for CANR_MO113_IPR.
* To use register names with standard convension, please use CANR_MO113_IPR.
*/
#define	CANR_MOIPR113	(CANR_MO113_IPR)

