keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1E4C, Message Object  Acceptance Mask Register */
#define CANR_MO114_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E4Cu)

/** Alias (User Manual Name) for CANR_MO114_AMR.
* To use register names with standard convension, please use CANR_MO114_AMR.
*/
#define	CANR_MOAMR114	(CANR_MO114_AMR)

/** \\brief  1E58, Message Object  Arbitration Register */
#define CANR_MO114_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E58u)

/** Alias (User Manual Name) for CANR_MO114_AR.
* To use register names with standard convension, please use CANR_MO114_AR.
*/
#define	CANR_MOAR114	(CANR_MO114_AR)

/** \\brief  1E5C, Message Object  Control Register */
#define CANR_MO114_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029E5Cu)

/** Alias (User Manual Name) for CANR_MO114_CTR_STAT.
* To use register names with standard convension, please use CANR_MO114_CTR_STAT.
*/
#define	CANR_MOCTR114	(CANR_MO114_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO114_CTR_STAT.
* To use register names with standard convension, please use CANR_MO114_CTR_STAT.
*/
#define	CANR_MOSTAT114	(CANR_MO114_CTR_STAT)

/** \\brief  1E54, Message Object  Data Register High */
#define CANR_MO114_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E54u)

/** Alias (User Manual Name) for CANR_MO114_DATAH.
* To use register names with standard convension, please use CANR_MO114_DATAH.
*/
#define	CANR_MODATAH114	(CANR_MO114_DATAH)

/** \\brief  1E50, Message Object  Data Register Low */
#define CANR_MO114_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E50u)

/** Alias (User Manual Name) for CANR_MO114_DATAL.
* To use register names with standard convension, please use CANR_MO114_DATAL.
*/
#define	CANR_MODATAL114	(CANR_MO114_DATAL)

/** \\brief  1E40, Message Object  Function Control Register */
#define CANR_MO114_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E40u)

/** Alias (User Manual Name) for CANR_MO114_FCR.
* To use register names with standard convension, please use CANR_MO114_FCR.
*/
#define	CANR_MOFCR114	(CANR_MO114_FCR)

/** \\brief  1E44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO114_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E44u)

/** Alias (User Manual Name) for CANR_MO114_FGPR.
* To use register names with standard convension, please use CANR_MO114_FGPR.
*/
#define	CANR_MOFGPR114	(CANR_MO114_FGPR)

/** \\brief  1E48, Message Object  Interrupt Pointer Register */
#define CANR_MO114_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E48u)

/** Alias (User Manual Name) for CANR_MO114_IPR.
* To use register names with standard convension, please use CANR_MO114_IPR.
*/
#define	CANR_MOIPR114	(CANR_MO114_IPR)

/** \\brief  1E6C, Message Object  Acceptance Mask Register */
#define CANR_MO115_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E6Cu)

/** Alias (User Manual Name) for CANR_MO115_AMR.
* To use register names with standard convension, please use CANR_MO115_AMR.
*/
#define	CANR_MOAMR115	(CANR_MO115_AMR)

/** \\brief  1E78, Message Object  Arbitration Register */
#define CANR_MO115_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E78u)

/** Alias (User Manual Name) for CANR_MO115_AR.
* To use register names with standard convension, please use CANR_MO115_AR.
*/
#define	CANR_MOAR115	(CANR_MO115_AR)

/** \\brief  1E7C, Message Object  Control Register */
#define CANR_MO115_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029E7Cu)

/** Alias (User Manual Name) for CANR_MO115_CTR_STAT.
* To use register names with standard convension, please use CANR_MO115_CTR_STAT.
*/
#define	CANR_MOCTR115	(CANR_MO115_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO115_CTR_STAT.
* To use register names with standard convension, please use CANR_MO115_CTR_STAT.
*/
#define	CANR_MOSTAT115	(CANR_MO115_CTR_STAT)

/** \\brief  1E74, Message Object  Data Register High */
#define CANR_MO115_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E74u)

/** Alias (User Manual Name) for CANR_MO115_DATAH.
* To use register names with standard convension, please use CANR_MO115_DATAH.
*/
#define	CANR_MODATAH115	(CANR_MO115_DATAH)

/** \\brief  1E70, Message Object  Data Register Low */
#define CANR_MO115_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E70u)

/** Alias (User Manual Name) for CANR_MO115_DATAL.
* To use register names with standard convension, please use CANR_MO115_DATAL.
*/
#define	CANR_MODATAL115	(CANR_MO115_DATAL)

/** \\brief  1E60, Message Object  Function Control Register */
#define CANR_MO115_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E60u)

/** Alias (User Manual Name) for CANR_MO115_FCR.
* To use register names with standard convension, please use CANR_MO115_FCR.
*/
#define	CANR_MOFCR115	(CANR_MO115_FCR)

/** \\brief  1E64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO115_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E64u)

/** Alias (User Manual Name) for CANR_MO115_FGPR.
* To use register names with standard convension, please use CANR_MO115_FGPR.
*/
#define	CANR_MOFGPR115	(CANR_MO115_FGPR)

/** \\brief  1E68, Message Object  Interrupt Pointer Register */
#define CANR_MO115_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E68u)

/** Alias (User Manual Name) for CANR_MO115_IPR.
* To use register names with standard convension, please use CANR_MO115_IPR.
*/
#define	CANR_MOIPR115	(CANR_MO115_IPR)

/** \\brief  1E8C, Message Object  Acceptance Mask Register */
#define CANR_MO116_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029E8Cu)

/** Alias (User Manual Name) for CANR_MO116_AMR.
* To use register names with standard convension, please use CANR_MO116_AMR.
*/
#define	CANR_MOAMR116	(CANR_MO116_AMR)

/** \\brief  1E98, Message Object  Arbitration Register */
#define CANR_MO116_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029E98u)

