keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO116_AR.
* To use register names with standard convension, please use CANR_MO116_AR.
*/
#define	CANR_MOAR116	(CANR_MO116_AR)

/** \\brief  1E9C, Message Object  Control Register */
#define CANR_MO116_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029E9Cu)

/** Alias (User Manual Name) for CANR_MO116_CTR_STAT.
* To use register names with standard convension, please use CANR_MO116_CTR_STAT.
*/
#define	CANR_MOCTR116	(CANR_MO116_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO116_CTR_STAT.
* To use register names with standard convension, please use CANR_MO116_CTR_STAT.
*/
#define	CANR_MOSTAT116	(CANR_MO116_CTR_STAT)

/** \\brief  1E94, Message Object  Data Register High */
#define CANR_MO116_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029E94u)

/** Alias (User Manual Name) for CANR_MO116_DATAH.
* To use register names with standard convension, please use CANR_MO116_DATAH.
*/
#define	CANR_MODATAH116	(CANR_MO116_DATAH)

/** \\brief  1E90, Message Object  Data Register Low */
#define CANR_MO116_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029E90u)

/** Alias (User Manual Name) for CANR_MO116_DATAL.
* To use register names with standard convension, please use CANR_MO116_DATAL.
*/
#define	CANR_MODATAL116	(CANR_MO116_DATAL)

/** \\brief  1E80, Message Object  Function Control Register */
#define CANR_MO116_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029E80u)

/** Alias (User Manual Name) for CANR_MO116_FCR.
* To use register names with standard convension, please use CANR_MO116_FCR.
*/
#define	CANR_MOFCR116	(CANR_MO116_FCR)

/** \\brief  1E84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO116_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029E84u)

/** Alias (User Manual Name) for CANR_MO116_FGPR.
* To use register names with standard convension, please use CANR_MO116_FGPR.
*/
#define	CANR_MOFGPR116	(CANR_MO116_FGPR)

/** \\brief  1E88, Message Object  Interrupt Pointer Register */
#define CANR_MO116_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029E88u)

/** Alias (User Manual Name) for CANR_MO116_IPR.
* To use register names with standard convension, please use CANR_MO116_IPR.
*/
#define	CANR_MOIPR116	(CANR_MO116_IPR)

/** \\brief  1EAC, Message Object  Acceptance Mask Register */
#define CANR_MO117_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029EACu)

/** Alias (User Manual Name) for CANR_MO117_AMR.
* To use register names with standard convension, please use CANR_MO117_AMR.
*/
#define	CANR_MOAMR117	(CANR_MO117_AMR)

/** \\brief  1EB8, Message Object  Arbitration Register */
#define CANR_MO117_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029EB8u)

/** Alias (User Manual Name) for CANR_MO117_AR.
* To use register names with standard convension, please use CANR_MO117_AR.
*/
#define	CANR_MOAR117	(CANR_MO117_AR)

/** \\brief  1EBC, Message Object  Control Register */
#define CANR_MO117_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029EBCu)

/** Alias (User Manual Name) for CANR_MO117_CTR_STAT.
* To use register names with standard convension, please use CANR_MO117_CTR_STAT.
*/
#define	CANR_MOCTR117	(CANR_MO117_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO117_CTR_STAT.
* To use register names with standard convension, please use CANR_MO117_CTR_STAT.
*/
#define	CANR_MOSTAT117	(CANR_MO117_CTR_STAT)

/** \\brief  1EB4, Message Object  Data Register High */
#define CANR_MO117_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029EB4u)

/** Alias (User Manual Name) for CANR_MO117_DATAH.
* To use register names with standard convension, please use CANR_MO117_DATAH.
*/
#define	CANR_MODATAH117	(CANR_MO117_DATAH)

/** \\brief  1EB0, Message Object  Data Register Low */
#define CANR_MO117_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029EB0u)

/** Alias (User Manual Name) for CANR_MO117_DATAL.
* To use register names with standard convension, please use CANR_MO117_DATAL.
*/
#define	CANR_MODATAL117	(CANR_MO117_DATAL)

/** \\brief  1EA0, Message Object  Function Control Register */
#define CANR_MO117_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029EA0u)

/** Alias (User Manual Name) for CANR_MO117_FCR.
* To use register names with standard convension, please use CANR_MO117_FCR.
*/
#define	CANR_MOFCR117	(CANR_MO117_FCR)

/** \\brief  1EA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO117_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029EA4u)

/** Alias (User Manual Name) for CANR_MO117_FGPR.
* To use register names with standard convension, please use CANR_MO117_FGPR.
*/
#define	CANR_MOFGPR117	(CANR_MO117_FGPR)

/** \\brief  1EA8, Message Object  Interrupt Pointer Register */
#define CANR_MO117_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029EA8u)

/** Alias (User Manual Name) for CANR_MO117_IPR.
* To use register names with standard convension, please use CANR_MO117_IPR.
*/
#define	CANR_MOIPR117	(CANR_MO117_IPR)

/** \\brief  1ECC, Message Object  Acceptance Mask Register */
#define CANR_MO118_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029ECCu)

/** Alias (User Manual Name) for CANR_MO118_AMR.
* To use register names with standard convension, please use CANR_MO118_AMR.
*/
#define	CANR_MOAMR118	(CANR_MO118_AMR)

/** \\brief  1ED8, Message Object  Arbitration Register */
#define CANR_MO118_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029ED8u)

/** Alias (User Manual Name) for CANR_MO118_AR.
* To use register names with standard convension, please use CANR_MO118_AR.
*/
#define	CANR_MOAR118	(CANR_MO118_AR)

/** \\brief  1EDC, Message Object  Control Register */
#define CANR_MO118_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029EDCu)

/** Alias (User Manual Name) for CANR_MO118_CTR_STAT.
* To use register names with standard convension, please use CANR_MO118_CTR_STAT.
*/
#define	CANR_MOCTR118	(CANR_MO118_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO118_CTR_STAT.
* To use register names with standard convension, please use CANR_MO118_CTR_STAT.
*/
#define	CANR_MOSTAT118	(CANR_MO118_CTR_STAT)

/** \\brief  1ED4, Message Object  Data Register High */
#define CANR_MO118_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029ED4u)

/** Alias (User Manual Name) for CANR_MO118_DATAH.
* To use register names with standard convension, please use CANR_MO118_DATAH.
*/
#define	CANR_MODATAH118	(CANR_MO118_DATAH)

/** \\brief  1ED0, Message Object  Data Register Low */
#define CANR_MO118_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029ED0u)

/** Alias (User Manual Name) for CANR_MO118_DATAL.
* To use register names with standard convension, please use CANR_MO118_DATAL.
*/
#define	CANR_MODATAL118	(CANR_MO118_DATAL)

/** \\brief  1EC0, Message Object  Function Control Register */
#define CANR_MO118_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029EC0u)

/** Alias (User Manual Name) for CANR_MO118_FCR.
* To use register names with standard convension, please use CANR_MO118_FCR.
*/
#define	CANR_MOFCR118	(CANR_MO118_FCR)

/** \\brief  1EC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO118_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029EC4u)

/** Alias (User Manual Name) for CANR_MO118_FGPR.
* To use register names with standard convension, please use CANR_MO118_FGPR.
*/
#define	CANR_MOFGPR118	(CANR_MO118_FGPR)

