keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1EC8, Message Object  Interrupt Pointer Register */
#define CANR_MO118_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029EC8u)

/** Alias (User Manual Name) for CANR_MO118_IPR.
* To use register names with standard convension, please use CANR_MO118_IPR.
*/
#define	CANR_MOIPR118	(CANR_MO118_IPR)

/** \\brief  1EEC, Message Object  Acceptance Mask Register */
#define CANR_MO119_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029EECu)

/** Alias (User Manual Name) for CANR_MO119_AMR.
* To use register names with standard convension, please use CANR_MO119_AMR.
*/
#define	CANR_MOAMR119	(CANR_MO119_AMR)

/** \\brief  1EF8, Message Object  Arbitration Register */
#define CANR_MO119_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029EF8u)

/** Alias (User Manual Name) for CANR_MO119_AR.
* To use register names with standard convension, please use CANR_MO119_AR.
*/
#define	CANR_MOAR119	(CANR_MO119_AR)

/** \\brief  1EFC, Message Object  Control Register */
#define CANR_MO119_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029EFCu)

/** Alias (User Manual Name) for CANR_MO119_CTR_STAT.
* To use register names with standard convension, please use CANR_MO119_CTR_STAT.
*/
#define	CANR_MOCTR119	(CANR_MO119_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO119_CTR_STAT.
* To use register names with standard convension, please use CANR_MO119_CTR_STAT.
*/
#define	CANR_MOSTAT119	(CANR_MO119_CTR_STAT)

/** \\brief  1EF4, Message Object  Data Register High */
#define CANR_MO119_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029EF4u)

/** Alias (User Manual Name) for CANR_MO119_DATAH.
* To use register names with standard convension, please use CANR_MO119_DATAH.
*/
#define	CANR_MODATAH119	(CANR_MO119_DATAH)

/** \\brief  1EF0, Message Object  Data Register Low */
#define CANR_MO119_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029EF0u)

/** Alias (User Manual Name) for CANR_MO119_DATAL.
* To use register names with standard convension, please use CANR_MO119_DATAL.
*/
#define	CANR_MODATAL119	(CANR_MO119_DATAL)

/** \\brief  1EE0, Message Object  Function Control Register */
#define CANR_MO119_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029EE0u)

/** Alias (User Manual Name) for CANR_MO119_FCR.
* To use register names with standard convension, please use CANR_MO119_FCR.
*/
#define	CANR_MOFCR119	(CANR_MO119_FCR)

/** \\brief  1EE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO119_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029EE4u)

/** Alias (User Manual Name) for CANR_MO119_FGPR.
* To use register names with standard convension, please use CANR_MO119_FGPR.
*/
#define	CANR_MOFGPR119	(CANR_MO119_FGPR)

/** \\brief  1EE8, Message Object  Interrupt Pointer Register */
#define CANR_MO119_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029EE8u)

/** Alias (User Manual Name) for CANR_MO119_IPR.
* To use register names with standard convension, please use CANR_MO119_IPR.
*/
#define	CANR_MOIPR119	(CANR_MO119_IPR)

/** \\brief  116C, Message Object  Acceptance Mask Register */
#define CANR_MO11_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002916Cu)

/** Alias (User Manual Name) for CANR_MO11_AMR.
* To use register names with standard convension, please use CANR_MO11_AMR.
*/
#define	CANR_MOAMR11	(CANR_MO11_AMR)

/** \\brief  1178, Message Object  Arbitration Register */
#define CANR_MO11_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029178u)

/** Alias (User Manual Name) for CANR_MO11_AR.
* To use register names with standard convension, please use CANR_MO11_AR.
*/
#define	CANR_MOAR11	(CANR_MO11_AR)

/** \\brief  117C, Message Object  Control Register */
#define CANR_MO11_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002917Cu)

/** Alias (User Manual Name) for CANR_MO11_CTR_STAT.
* To use register names with standard convension, please use CANR_MO11_CTR_STAT.
*/
#define	CANR_MOCTR11	(CANR_MO11_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO11_CTR_STAT.
* To use register names with standard convension, please use CANR_MO11_CTR_STAT.
*/
#define	CANR_MOSTAT11	(CANR_MO11_CTR_STAT)

/** \\brief  1174, Message Object  Data Register High */
#define CANR_MO11_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029174u)

/** Alias (User Manual Name) for CANR_MO11_DATAH.
* To use register names with standard convension, please use CANR_MO11_DATAH.
*/
#define	CANR_MODATAH11	(CANR_MO11_DATAH)

/** \\brief  1170, Message Object  Data Register Low */
#define CANR_MO11_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029170u)

/** Alias (User Manual Name) for CANR_MO11_DATAL.
* To use register names with standard convension, please use CANR_MO11_DATAL.
*/
#define	CANR_MODATAL11	(CANR_MO11_DATAL)

/** \\brief  1160, Message Object  Function Control Register */
#define CANR_MO11_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029160u)

/** Alias (User Manual Name) for CANR_MO11_FCR.
* To use register names with standard convension, please use CANR_MO11_FCR.
*/
#define	CANR_MOFCR11	(CANR_MO11_FCR)

/** \\brief  1164, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO11_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029164u)

/** Alias (User Manual Name) for CANR_MO11_FGPR.
* To use register names with standard convension, please use CANR_MO11_FGPR.
*/
#define	CANR_MOFGPR11	(CANR_MO11_FGPR)

/** \\brief  1168, Message Object  Interrupt Pointer Register */
#define CANR_MO11_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029168u)

/** Alias (User Manual Name) for CANR_MO11_IPR.
* To use register names with standard convension, please use CANR_MO11_IPR.
*/
#define	CANR_MOIPR11	(CANR_MO11_IPR)

/** \\brief  1F0C, Message Object  Acceptance Mask Register */
#define CANR_MO120_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F0Cu)

/** Alias (User Manual Name) for CANR_MO120_AMR.
* To use register names with standard convension, please use CANR_MO120_AMR.
*/
#define	CANR_MOAMR120	(CANR_MO120_AMR)

/** \\brief  1F18, Message Object  Arbitration Register */
#define CANR_MO120_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F18u)

/** Alias (User Manual Name) for CANR_MO120_AR.
* To use register names with standard convension, please use CANR_MO120_AR.
*/
#define	CANR_MOAR120	(CANR_MO120_AR)

/** \\brief  1F1C, Message Object  Control Register */
#define CANR_MO120_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029F1Cu)

/** Alias (User Manual Name) for CANR_MO120_CTR_STAT.
* To use register names with standard convension, please use CANR_MO120_CTR_STAT.
*/
#define	CANR_MOSTAT120	(CANR_MO120_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO120_CTR_STAT.
* To use register names with standard convension, please use CANR_MO120_CTR_STAT.
*/
#define	CANR_MOCTR120	(CANR_MO120_CTR_STAT)

/** \\brief  1F14, Message Object  Data Register High */
#define CANR_MO120_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F14u)

/** Alias (User Manual Name) for CANR_MO120_DATAH.
* To use register names with standard convension, please use CANR_MO120_DATAH.
*/
#define	CANR_MODATAH120	(CANR_MO120_DATAH)

