keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1F10, Message Object  Data Register Low */
#define CANR_MO120_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F10u)

/** Alias (User Manual Name) for CANR_MO120_DATAL.
* To use register names with standard convension, please use CANR_MO120_DATAL.
*/
#define	CANR_MODATAL120	(CANR_MO120_DATAL)

/** \\brief  1F00, Message Object  Function Control Register */
#define CANR_MO120_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F00u)

/** Alias (User Manual Name) for CANR_MO120_FCR.
* To use register names with standard convension, please use CANR_MO120_FCR.
*/
#define	CANR_MOFCR120	(CANR_MO120_FCR)

/** \\brief  1F04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO120_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F04u)

/** Alias (User Manual Name) for CANR_MO120_FGPR.
* To use register names with standard convension, please use CANR_MO120_FGPR.
*/
#define	CANR_MOFGPR120	(CANR_MO120_FGPR)

/** \\brief  1F08, Message Object  Interrupt Pointer Register */
#define CANR_MO120_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F08u)

/** Alias (User Manual Name) for CANR_MO120_IPR.
* To use register names with standard convension, please use CANR_MO120_IPR.
*/
#define	CANR_MOIPR120	(CANR_MO120_IPR)

/** \\brief  1F2C, Message Object  Acceptance Mask Register */
#define CANR_MO121_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F2Cu)

/** Alias (User Manual Name) for CANR_MO121_AMR.
* To use register names with standard convension, please use CANR_MO121_AMR.
*/
#define	CANR_MOAMR121	(CANR_MO121_AMR)

/** \\brief  1F38, Message Object  Arbitration Register */
#define CANR_MO121_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F38u)

/** Alias (User Manual Name) for CANR_MO121_AR.
* To use register names with standard convension, please use CANR_MO121_AR.
*/
#define	CANR_MOAR121	(CANR_MO121_AR)

/** \\brief  1F3C, Message Object  Control Register */
#define CANR_MO121_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029F3Cu)

/** Alias (User Manual Name) for CANR_MO121_CTR_STAT.
* To use register names with standard convension, please use CANR_MO121_CTR_STAT.
*/
#define	CANR_MOSTAT121	(CANR_MO121_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO121_CTR_STAT.
* To use register names with standard convension, please use CANR_MO121_CTR_STAT.
*/
#define	CANR_MOCTR121	(CANR_MO121_CTR_STAT)

/** \\brief  1F34, Message Object  Data Register High */
#define CANR_MO121_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F34u)

/** Alias (User Manual Name) for CANR_MO121_DATAH.
* To use register names with standard convension, please use CANR_MO121_DATAH.
*/
#define	CANR_MODATAH121	(CANR_MO121_DATAH)

/** \\brief  1F30, Message Object  Data Register Low */
#define CANR_MO121_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F30u)

/** Alias (User Manual Name) for CANR_MO121_DATAL.
* To use register names with standard convension, please use CANR_MO121_DATAL.
*/
#define	CANR_MODATAL121	(CANR_MO121_DATAL)

/** \\brief  1F20, Message Object  Function Control Register */
#define CANR_MO121_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F20u)

/** Alias (User Manual Name) for CANR_MO121_FCR.
* To use register names with standard convension, please use CANR_MO121_FCR.
*/
#define	CANR_MOFCR121	(CANR_MO121_FCR)

/** \\brief  1F24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO121_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F24u)

/** Alias (User Manual Name) for CANR_MO121_FGPR.
* To use register names with standard convension, please use CANR_MO121_FGPR.
*/
#define	CANR_MOFGPR121	(CANR_MO121_FGPR)

/** \\brief  1F28, Message Object  Interrupt Pointer Register */
#define CANR_MO121_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F28u)

/** Alias (User Manual Name) for CANR_MO121_IPR.
* To use register names with standard convension, please use CANR_MO121_IPR.
*/
#define	CANR_MOIPR121	(CANR_MO121_IPR)

/** \\brief  1F4C, Message Object  Acceptance Mask Register */
#define CANR_MO122_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F4Cu)

/** Alias (User Manual Name) for CANR_MO122_AMR.
* To use register names with standard convension, please use CANR_MO122_AMR.
*/
#define	CANR_MOAMR122	(CANR_MO122_AMR)

/** \\brief  1F58, Message Object  Arbitration Register */
#define CANR_MO122_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F58u)

/** Alias (User Manual Name) for CANR_MO122_AR.
* To use register names with standard convension, please use CANR_MO122_AR.
*/
#define	CANR_MOAR122	(CANR_MO122_AR)

/** \\brief  1F5C, Message Object  Control Register */
#define CANR_MO122_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029F5Cu)

/** Alias (User Manual Name) for CANR_MO122_CTR_STAT.
* To use register names with standard convension, please use CANR_MO122_CTR_STAT.
*/
#define	CANR_MOCTR122	(CANR_MO122_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO122_CTR_STAT.
* To use register names with standard convension, please use CANR_MO122_CTR_STAT.
*/
#define	CANR_MOSTAT122	(CANR_MO122_CTR_STAT)

/** \\brief  1F54, Message Object  Data Register High */
#define CANR_MO122_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F54u)

/** Alias (User Manual Name) for CANR_MO122_DATAH.
* To use register names with standard convension, please use CANR_MO122_DATAH.
*/
#define	CANR_MODATAH122	(CANR_MO122_DATAH)

/** \\brief  1F50, Message Object  Data Register Low */
#define CANR_MO122_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F50u)

/** Alias (User Manual Name) for CANR_MO122_DATAL.
* To use register names with standard convension, please use CANR_MO122_DATAL.
*/
#define	CANR_MODATAL122	(CANR_MO122_DATAL)

/** \\brief  1F40, Message Object  Function Control Register */
#define CANR_MO122_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F40u)

/** Alias (User Manual Name) for CANR_MO122_FCR.
* To use register names with standard convension, please use CANR_MO122_FCR.
*/
#define	CANR_MOFCR122	(CANR_MO122_FCR)

/** \\brief  1F44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO122_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F44u)

/** Alias (User Manual Name) for CANR_MO122_FGPR.
* To use register names with standard convension, please use CANR_MO122_FGPR.
*/
#define	CANR_MOFGPR122	(CANR_MO122_FGPR)

