keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1F48, Message Object  Interrupt Pointer Register */
#define CANR_MO122_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F48u)

/** Alias (User Manual Name) for CANR_MO122_IPR.
* To use register names with standard convension, please use CANR_MO122_IPR.
*/
#define	CANR_MOIPR122	(CANR_MO122_IPR)

/** \\brief  1F6C, Message Object  Acceptance Mask Register */
#define CANR_MO123_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F6Cu)

/** Alias (User Manual Name) for CANR_MO123_AMR.
* To use register names with standard convension, please use CANR_MO123_AMR.
*/
#define	CANR_MOAMR123	(CANR_MO123_AMR)

/** \\brief  1F78, Message Object  Arbitration Register */
#define CANR_MO123_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F78u)

/** Alias (User Manual Name) for CANR_MO123_AR.
* To use register names with standard convension, please use CANR_MO123_AR.
*/
#define	CANR_MOAR123	(CANR_MO123_AR)

/** \\brief  1F7C, Message Object  Control Register */
#define CANR_MO123_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029F7Cu)

/** Alias (User Manual Name) for CANR_MO123_CTR_STAT.
* To use register names with standard convension, please use CANR_MO123_CTR_STAT.
*/
#define	CANR_MOSTAT123	(CANR_MO123_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO123_CTR_STAT.
* To use register names with standard convension, please use CANR_MO123_CTR_STAT.
*/
#define	CANR_MOCTR123	(CANR_MO123_CTR_STAT)

/** \\brief  1F74, Message Object  Data Register High */
#define CANR_MO123_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F74u)

/** Alias (User Manual Name) for CANR_MO123_DATAH.
* To use register names with standard convension, please use CANR_MO123_DATAH.
*/
#define	CANR_MODATAH123	(CANR_MO123_DATAH)

/** \\brief  1F70, Message Object  Data Register Low */
#define CANR_MO123_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F70u)

/** Alias (User Manual Name) for CANR_MO123_DATAL.
* To use register names with standard convension, please use CANR_MO123_DATAL.
*/
#define	CANR_MODATAL123	(CANR_MO123_DATAL)

/** \\brief  1F60, Message Object  Function Control Register */
#define CANR_MO123_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F60u)

/** Alias (User Manual Name) for CANR_MO123_FCR.
* To use register names with standard convension, please use CANR_MO123_FCR.
*/
#define	CANR_MOFCR123	(CANR_MO123_FCR)

/** \\brief  1F64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO123_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F64u)

/** Alias (User Manual Name) for CANR_MO123_FGPR.
* To use register names with standard convension, please use CANR_MO123_FGPR.
*/
#define	CANR_MOFGPR123	(CANR_MO123_FGPR)

/** \\brief  1F68, Message Object  Interrupt Pointer Register */
#define CANR_MO123_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F68u)

/** Alias (User Manual Name) for CANR_MO123_IPR.
* To use register names with standard convension, please use CANR_MO123_IPR.
*/
#define	CANR_MOIPR123	(CANR_MO123_IPR)

/** \\brief  1F8C, Message Object  Acceptance Mask Register */
#define CANR_MO124_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029F8Cu)

/** Alias (User Manual Name) for CANR_MO124_AMR.
* To use register names with standard convension, please use CANR_MO124_AMR.
*/
#define	CANR_MOAMR124	(CANR_MO124_AMR)

/** \\brief  1F98, Message Object  Arbitration Register */
#define CANR_MO124_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029F98u)

/** Alias (User Manual Name) for CANR_MO124_AR.
* To use register names with standard convension, please use CANR_MO124_AR.
*/
#define	CANR_MOAR124	(CANR_MO124_AR)

/** \\brief  1F9C, Message Object  Control Register */
#define CANR_MO124_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029F9Cu)

/** Alias (User Manual Name) for CANR_MO124_CTR_STAT.
* To use register names with standard convension, please use CANR_MO124_CTR_STAT.
*/
#define	CANR_MOSTAT124	(CANR_MO124_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO124_CTR_STAT.
* To use register names with standard convension, please use CANR_MO124_CTR_STAT.
*/
#define	CANR_MOCTR124	(CANR_MO124_CTR_STAT)

/** \\brief  1F94, Message Object  Data Register High */
#define CANR_MO124_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029F94u)

/** Alias (User Manual Name) for CANR_MO124_DATAH.
* To use register names with standard convension, please use CANR_MO124_DATAH.
*/
#define	CANR_MODATAH124	(CANR_MO124_DATAH)

/** \\brief  1F90, Message Object  Data Register Low */
#define CANR_MO124_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029F90u)

/** Alias (User Manual Name) for CANR_MO124_DATAL.
* To use register names with standard convension, please use CANR_MO124_DATAL.
*/
#define	CANR_MODATAL124	(CANR_MO124_DATAL)

/** \\brief  1F80, Message Object  Function Control Register */
#define CANR_MO124_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029F80u)

/** Alias (User Manual Name) for CANR_MO124_FCR.
* To use register names with standard convension, please use CANR_MO124_FCR.
*/
#define	CANR_MOFCR124	(CANR_MO124_FCR)

/** \\brief  1F84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO124_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029F84u)

/** Alias (User Manual Name) for CANR_MO124_FGPR.
* To use register names with standard convension, please use CANR_MO124_FGPR.
*/
#define	CANR_MOFGPR124	(CANR_MO124_FGPR)

/** \\brief  1F88, Message Object  Interrupt Pointer Register */
#define CANR_MO124_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029F88u)

/** Alias (User Manual Name) for CANR_MO124_IPR.
* To use register names with standard convension, please use CANR_MO124_IPR.
*/
#define	CANR_MOIPR124	(CANR_MO124_IPR)

/** \\brief  1FAC, Message Object  Acceptance Mask Register */
#define CANR_MO125_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029FACu)

/** Alias (User Manual Name) for CANR_MO125_AMR.
* To use register names with standard convension, please use CANR_MO125_AMR.
*/
#define	CANR_MOAMR125	(CANR_MO125_AMR)

/** \\brief  1FB8, Message Object  Arbitration Register */
#define CANR_MO125_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029FB8u)

/** Alias (User Manual Name) for CANR_MO125_AR.
* To use register names with standard convension, please use CANR_MO125_AR.
*/
#define	CANR_MOAR125	(CANR_MO125_AR)

/** \\brief  1FBC, Message Object  Control Register */
#define CANR_MO125_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029FBCu)

