keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO125_CTR_STAT.
* To use register names with standard convension, please use CANR_MO125_CTR_STAT.
*/
#define	CANR_MOSTAT125	(CANR_MO125_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO125_CTR_STAT.
* To use register names with standard convension, please use CANR_MO125_CTR_STAT.
*/
#define	CANR_MOCTR125	(CANR_MO125_CTR_STAT)

/** \\brief  1FB4, Message Object  Data Register High */
#define CANR_MO125_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029FB4u)

/** Alias (User Manual Name) for CANR_MO125_DATAH.
* To use register names with standard convension, please use CANR_MO125_DATAH.
*/
#define	CANR_MODATAH125	(CANR_MO125_DATAH)

/** \\brief  1FB0, Message Object  Data Register Low */
#define CANR_MO125_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029FB0u)

/** Alias (User Manual Name) for CANR_MO125_DATAL.
* To use register names with standard convension, please use CANR_MO125_DATAL.
*/
#define	CANR_MODATAL125	(CANR_MO125_DATAL)

/** \\brief  1FA0, Message Object  Function Control Register */
#define CANR_MO125_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029FA0u)

/** Alias (User Manual Name) for CANR_MO125_FCR.
* To use register names with standard convension, please use CANR_MO125_FCR.
*/
#define	CANR_MOFCR125	(CANR_MO125_FCR)

/** \\brief  1FA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO125_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029FA4u)

/** Alias (User Manual Name) for CANR_MO125_FGPR.
* To use register names with standard convension, please use CANR_MO125_FGPR.
*/
#define	CANR_MOFGPR125	(CANR_MO125_FGPR)

/** \\brief  1FA8, Message Object  Interrupt Pointer Register */
#define CANR_MO125_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029FA8u)

/** Alias (User Manual Name) for CANR_MO125_IPR.
* To use register names with standard convension, please use CANR_MO125_IPR.
*/
#define	CANR_MOIPR125	(CANR_MO125_IPR)

/** \\brief  1FCC, Message Object  Acceptance Mask Register */
#define CANR_MO126_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029FCCu)

/** Alias (User Manual Name) for CANR_MO126_AMR.
* To use register names with standard convension, please use CANR_MO126_AMR.
*/
#define	CANR_MOAMR126	(CANR_MO126_AMR)

/** \\brief  1FD8, Message Object  Arbitration Register */
#define CANR_MO126_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029FD8u)

/** Alias (User Manual Name) for CANR_MO126_AR.
* To use register names with standard convension, please use CANR_MO126_AR.
*/
#define	CANR_MOAR126	(CANR_MO126_AR)

/** \\brief  1FDC, Message Object  Control Register */
#define CANR_MO126_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029FDCu)

/** Alias (User Manual Name) for CANR_MO126_CTR_STAT.
* To use register names with standard convension, please use CANR_MO126_CTR_STAT.
*/
#define	CANR_MOSTAT126	(CANR_MO126_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO126_CTR_STAT.
* To use register names with standard convension, please use CANR_MO126_CTR_STAT.
*/
#define	CANR_MOCTR126	(CANR_MO126_CTR_STAT)

/** \\brief  1FD4, Message Object  Data Register High */
#define CANR_MO126_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029FD4u)

/** Alias (User Manual Name) for CANR_MO126_DATAH.
* To use register names with standard convension, please use CANR_MO126_DATAH.
*/
#define	CANR_MODATAH126	(CANR_MO126_DATAH)

/** \\brief  1FD0, Message Object  Data Register Low */
#define CANR_MO126_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029FD0u)

/** Alias (User Manual Name) for CANR_MO126_DATAL.
* To use register names with standard convension, please use CANR_MO126_DATAL.
*/
#define	CANR_MODATAL126	(CANR_MO126_DATAL)

/** \\brief  1FC0, Message Object  Function Control Register */
#define CANR_MO126_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029FC0u)

/** Alias (User Manual Name) for CANR_MO126_FCR.
* To use register names with standard convension, please use CANR_MO126_FCR.
*/
#define	CANR_MOFCR126	(CANR_MO126_FCR)

/** \\brief  1FC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO126_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029FC4u)

/** Alias (User Manual Name) for CANR_MO126_FGPR.
* To use register names with standard convension, please use CANR_MO126_FGPR.
*/
#define	CANR_MOFGPR126	(CANR_MO126_FGPR)

/** \\brief  1FC8, Message Object  Interrupt Pointer Register */
#define CANR_MO126_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029FC8u)

/** Alias (User Manual Name) for CANR_MO126_IPR.
* To use register names with standard convension, please use CANR_MO126_IPR.
*/
#define	CANR_MOIPR126	(CANR_MO126_IPR)

/** \\brief  1FEC, Message Object  Acceptance Mask Register */
#define CANR_MO127_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029FECu)

/** Alias (User Manual Name) for CANR_MO127_AMR.
* To use register names with standard convension, please use CANR_MO127_AMR.
*/
#define	CANR_MOAMR127	(CANR_MO127_AMR)

/** \\brief  1FF8, Message Object  Arbitration Register */
#define CANR_MO127_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029FF8u)

/** Alias (User Manual Name) for CANR_MO127_AR.
* To use register names with standard convension, please use CANR_MO127_AR.
*/
#define	CANR_MOAR127	(CANR_MO127_AR)

/** \\brief  1FFC, Message Object  Control Register */
#define CANR_MO127_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029FFCu)

/** Alias (User Manual Name) for CANR_MO127_CTR_STAT.
* To use register names with standard convension, please use CANR_MO127_CTR_STAT.
*/
#define	CANR_MOSTAT127	(CANR_MO127_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO127_CTR_STAT.
* To use register names with standard convension, please use CANR_MO127_CTR_STAT.
*/
#define	CANR_MOCTR127	(CANR_MO127_CTR_STAT)

/** \\brief  1FF4, Message Object  Data Register High */
#define CANR_MO127_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029FF4u)

/** Alias (User Manual Name) for CANR_MO127_DATAH.
* To use register names with standard convension, please use CANR_MO127_DATAH.
*/
#define	CANR_MODATAH127	(CANR_MO127_DATAH)

/** \\brief  1FF0, Message Object  Data Register Low */
#define CANR_MO127_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029FF0u)

/** Alias (User Manual Name) for CANR_MO127_DATAL.
* To use register names with standard convension, please use CANR_MO127_DATAL.
*/
#define	CANR_MODATAL127	(CANR_MO127_DATAL)

/** \\brief  1FE0, Message Object  Function Control Register */
#define CANR_MO127_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029FE0u)

/** Alias (User Manual Name) for CANR_MO127_FCR.
* To use register names with standard convension, please use CANR_MO127_FCR.
*/
#define	CANR_MOFCR127	(CANR_MO127_FCR)

/** \\brief  1FE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO127_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029FE4u)

/** Alias (User Manual Name) for CANR_MO127_FGPR.
* To use register names with standard convension, please use CANR_MO127_FGPR.
*/
#define	CANR_MOFGPR127	(CANR_MO127_FGPR)

/** \\brief  1FE8, Message Object  Interrupt Pointer Register */
#define CANR_MO127_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029FE8u)

/** Alias (User Manual Name) for CANR_MO127_IPR.
* To use register names with standard convension, please use CANR_MO127_IPR.
*/
#define	CANR_MOIPR127	(CANR_MO127_IPR)

/** \\brief  200C, Message Object  Acceptance Mask Register */
#define CANR_MO128_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A00Cu)

/** \\brief  2018, Message Object  Arbitration Register */
#define CANR_MO128_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A018u)

/** \\brief  201C, Message Object  Control Register */
#define CANR_MO128_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A01Cu)

/** \\brief  2014, Message Object  Data Register High */
#define CANR_MO128_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A014u)

/** \\brief  2010, Message Object  Data Register Low */
#define CANR_MO128_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A010u)

/** \\brief  2000, Message Object  Function Control Register */
#define CANR_MO128_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A000u)

/** \\brief  2004, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO128_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A004u)

