keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2008, Message Object  Interrupt Pointer Register */
#define CANR_MO128_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A008u)

/** \\brief  202C, Message Object  Acceptance Mask Register */
#define CANR_MO129_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A02Cu)

/** \\brief  2038, Message Object  Arbitration Register */
#define CANR_MO129_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A038u)

/** \\brief  203C, Message Object  Control Register */
#define CANR_MO129_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A03Cu)

/** \\brief  2034, Message Object  Data Register High */
#define CANR_MO129_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A034u)

/** \\brief  2030, Message Object  Data Register Low */
#define CANR_MO129_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A030u)

/** \\brief  2020, Message Object  Function Control Register */
#define CANR_MO129_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A020u)

/** \\brief  2024, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO129_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A024u)

/** \\brief  2028, Message Object  Interrupt Pointer Register */
#define CANR_MO129_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A028u)

/** \\brief  118C, Message Object  Acceptance Mask Register */
#define CANR_MO12_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002918Cu)

/** Alias (User Manual Name) for CANR_MO12_AMR.
* To use register names with standard convension, please use CANR_MO12_AMR.
*/
#define	CANR_MOAMR12	(CANR_MO12_AMR)

/** \\brief  1198, Message Object  Arbitration Register */
#define CANR_MO12_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029198u)

/** Alias (User Manual Name) for CANR_MO12_AR.
* To use register names with standard convension, please use CANR_MO12_AR.
*/
#define	CANR_MOAR12	(CANR_MO12_AR)

/** \\brief  119C, Message Object  Control Register */
#define CANR_MO12_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002919Cu)

/** Alias (User Manual Name) for CANR_MO12_CTR_STAT.
* To use register names with standard convension, please use CANR_MO12_CTR_STAT.
*/
#define	CANR_MOCTR12	(CANR_MO12_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO12_CTR_STAT.
* To use register names with standard convension, please use CANR_MO12_CTR_STAT.
*/
#define	CANR_MOSTAT12	(CANR_MO12_CTR_STAT)

/** \\brief  1194, Message Object  Data Register High */
#define CANR_MO12_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029194u)

/** Alias (User Manual Name) for CANR_MO12_DATAH.
* To use register names with standard convension, please use CANR_MO12_DATAH.
*/
#define	CANR_MODATAH12	(CANR_MO12_DATAH)

/** \\brief  1190, Message Object  Data Register Low */
#define CANR_MO12_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029190u)

/** Alias (User Manual Name) for CANR_MO12_DATAL.
* To use register names with standard convension, please use CANR_MO12_DATAL.
*/
#define	CANR_MODATAL12	(CANR_MO12_DATAL)

/** \\brief  1180, Message Object  Function Control Register */
#define CANR_MO12_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029180u)

/** Alias (User Manual Name) for CANR_MO12_FCR.
* To use register names with standard convension, please use CANR_MO12_FCR.
*/
#define	CANR_MOFCR12	(CANR_MO12_FCR)

/** \\brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO12_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029184u)

/** Alias (User Manual Name) for CANR_MO12_FGPR.
* To use register names with standard convension, please use CANR_MO12_FGPR.
*/
#define	CANR_MOFGPR12	(CANR_MO12_FGPR)

/** \\brief  1188, Message Object  Interrupt Pointer Register */
#define CANR_MO12_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029188u)

/** Alias (User Manual Name) for CANR_MO12_IPR.
* To use register names with standard convension, please use CANR_MO12_IPR.
*/
#define	CANR_MOIPR12	(CANR_MO12_IPR)

/** \\brief  204C, Message Object  Acceptance Mask Register */
#define CANR_MO130_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A04Cu)

/** \\brief  2058, Message Object  Arbitration Register */
#define CANR_MO130_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A058u)

/** \\brief  205C, Message Object  Control Register */
#define CANR_MO130_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A05Cu)

/** \\brief  2054, Message Object  Data Register High */
#define CANR_MO130_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A054u)

/** \\brief  2050, Message Object  Data Register Low */
#define CANR_MO130_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A050u)

/** \\brief  2040, Message Object  Function Control Register */
#define CANR_MO130_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A040u)

/** \\brief  2044, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO130_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A044u)

/** \\brief  2048, Message Object  Interrupt Pointer Register */
#define CANR_MO130_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A048u)

/** \\brief  206C, Message Object  Acceptance Mask Register */
#define CANR_MO131_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A06Cu)

/** \\brief  2078, Message Object  Arbitration Register */
#define CANR_MO131_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A078u)

/** \\brief  207C, Message Object  Control Register */
#define CANR_MO131_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A07Cu)

/** \\brief  2074, Message Object  Data Register High */
#define CANR_MO131_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A074u)

/** \\brief  2070, Message Object  Data Register Low */
#define CANR_MO131_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A070u)

/** \\brief  2060, Message Object  Function Control Register */
#define CANR_MO131_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A060u)

/** \\brief  2064, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO131_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A064u)

