keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2068, Message Object  Interrupt Pointer Register */
#define CANR_MO131_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A068u)

/** \\brief  208C, Message Object  Acceptance Mask Register */
#define CANR_MO132_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A08Cu)

/** \\brief  2098, Message Object  Arbitration Register */
#define CANR_MO132_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A098u)

/** \\brief  209C, Message Object  Control Register */
#define CANR_MO132_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A09Cu)

/** \\brief  2094, Message Object  Data Register High */
#define CANR_MO132_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A094u)

/** \\brief  2090, Message Object  Data Register Low */
#define CANR_MO132_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A090u)

/** \\brief  2080, Message Object  Function Control Register */
#define CANR_MO132_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A080u)

/** \\brief  2084, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO132_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A084u)

/** \\brief  2088, Message Object  Interrupt Pointer Register */
#define CANR_MO132_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A088u)

/** \\brief  20AC, Message Object  Acceptance Mask Register */
#define CANR_MO133_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A0ACu)

/** \\brief  20B8, Message Object  Arbitration Register */
#define CANR_MO133_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A0B8u)

/** \\brief  20BC, Message Object  Control Register */
#define CANR_MO133_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A0BCu)

/** \\brief  20B4, Message Object  Data Register High */
#define CANR_MO133_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A0B4u)

/** \\brief  20B0, Message Object  Data Register Low */
#define CANR_MO133_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A0B0u)

/** \\brief  20A0, Message Object  Function Control Register */
#define CANR_MO133_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A0A0u)

/** \\brief  20A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO133_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A0A4u)

/** \\brief  20A8, Message Object  Interrupt Pointer Register */
#define CANR_MO133_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A0A8u)

/** \\brief  20CC, Message Object  Acceptance Mask Register */
#define CANR_MO134_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A0CCu)

/** \\brief  20D8, Message Object  Arbitration Register */
#define CANR_MO134_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A0D8u)

/** \\brief  20DC, Message Object  Control Register */
#define CANR_MO134_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A0DCu)

/** \\brief  20D4, Message Object  Data Register High */
#define CANR_MO134_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A0D4u)

/** \\brief  20D0, Message Object  Data Register Low */
#define CANR_MO134_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A0D0u)

/** \\brief  20C0, Message Object  Function Control Register */
#define CANR_MO134_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A0C0u)

/** \\brief  20C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO134_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A0C4u)

/** \\brief  20C8, Message Object  Interrupt Pointer Register */
#define CANR_MO134_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A0C8u)

/** \\brief  20EC, Message Object  Acceptance Mask Register */
#define CANR_MO135_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A0ECu)

/** \\brief  20F8, Message Object  Arbitration Register */
#define CANR_MO135_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A0F8u)

/** \\brief  20FC, Message Object  Control Register */
#define CANR_MO135_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A0FCu)

/** \\brief  20F4, Message Object  Data Register High */
#define CANR_MO135_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A0F4u)

/** \\brief  20F0, Message Object  Data Register Low */
#define CANR_MO135_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A0F0u)

/** \\brief  20E0, Message Object  Function Control Register */
#define CANR_MO135_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A0E0u)

/** \\brief  20E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO135_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A0E4u)

/** \\brief  20E8, Message Object  Interrupt Pointer Register */
#define CANR_MO135_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A0E8u)

/** \\brief  210C, Message Object  Acceptance Mask Register */
#define CANR_MO136_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A10Cu)

/** \\brief  2118, Message Object  Arbitration Register */
#define CANR_MO136_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A118u)

/** \\brief  211C, Message Object  Control Register */
#define CANR_MO136_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A11Cu)

/** \\brief  2114, Message Object  Data Register High */
#define CANR_MO136_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A114u)

/** \\brief  2110, Message Object  Data Register Low */
#define CANR_MO136_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A110u)

/** \\brief  2100, Message Object  Function Control Register */
#define CANR_MO136_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A100u)

/** \\brief  2104, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO136_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A104u)

/** \\brief  2108, Message Object  Interrupt Pointer Register */
#define CANR_MO136_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A108u)

