keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  212C, Message Object  Acceptance Mask Register */
#define CANR_MO137_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A12Cu)

/** \\brief  2138, Message Object  Arbitration Register */
#define CANR_MO137_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A138u)

/** \\brief  213C, Message Object  Control Register */
#define CANR_MO137_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A13Cu)

/** \\brief  2134, Message Object  Data Register High */
#define CANR_MO137_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A134u)

/** \\brief  2130, Message Object  Data Register Low */
#define CANR_MO137_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A130u)

/** \\brief  2120, Message Object  Function Control Register */
#define CANR_MO137_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A120u)

/** \\brief  2124, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO137_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A124u)

/** \\brief  2128, Message Object  Interrupt Pointer Register */
#define CANR_MO137_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A128u)

/** \\brief  214C, Message Object  Acceptance Mask Register */
#define CANR_MO138_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A14Cu)

/** \\brief  2158, Message Object  Arbitration Register */
#define CANR_MO138_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A158u)

/** \\brief  215C, Message Object  Control Register */
#define CANR_MO138_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A15Cu)

/** \\brief  2154, Message Object  Data Register High */
#define CANR_MO138_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A154u)

/** \\brief  2150, Message Object  Data Register Low */
#define CANR_MO138_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A150u)

/** \\brief  2140, Message Object  Function Control Register */
#define CANR_MO138_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A140u)

/** \\brief  2144, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO138_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A144u)

/** \\brief  2148, Message Object  Interrupt Pointer Register */
#define CANR_MO138_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A148u)

/** \\brief  216C, Message Object  Acceptance Mask Register */
#define CANR_MO139_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A16Cu)

/** \\brief  2178, Message Object  Arbitration Register */
#define CANR_MO139_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A178u)

/** \\brief  217C, Message Object  Control Register */
#define CANR_MO139_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A17Cu)

/** \\brief  2174, Message Object  Data Register High */
#define CANR_MO139_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A174u)

/** \\brief  2170, Message Object  Data Register Low */
#define CANR_MO139_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A170u)

/** \\brief  2160, Message Object  Function Control Register */
#define CANR_MO139_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A160u)

/** \\brief  2164, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO139_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A164u)

/** \\brief  2168, Message Object  Interrupt Pointer Register */
#define CANR_MO139_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A168u)

/** \\brief  11AC, Message Object  Acceptance Mask Register */
#define CANR_MO13_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291ACu)

/** Alias (User Manual Name) for CANR_MO13_AMR.
* To use register names with standard convension, please use CANR_MO13_AMR.
*/
#define	CANR_MOAMR13	(CANR_MO13_AMR)

/** \\brief  11B8, Message Object  Arbitration Register */
#define CANR_MO13_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291B8u)

/** Alias (User Manual Name) for CANR_MO13_AR.
* To use register names with standard convension, please use CANR_MO13_AR.
*/
#define	CANR_MOAR13	(CANR_MO13_AR)

/** \\brief  11BC, Message Object  Control Register */
#define CANR_MO13_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00291BCu)

/** Alias (User Manual Name) for CANR_MO13_CTR_STAT.
* To use register names with standard convension, please use CANR_MO13_CTR_STAT.
*/
#define	CANR_MOCTR13	(CANR_MO13_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO13_CTR_STAT.
* To use register names with standard convension, please use CANR_MO13_CTR_STAT.
*/
#define	CANR_MOSTAT13	(CANR_MO13_CTR_STAT)

/** \\brief  11B4, Message Object  Data Register High */
#define CANR_MO13_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291B4u)

/** Alias (User Manual Name) for CANR_MO13_DATAH.
* To use register names with standard convension, please use CANR_MO13_DATAH.
*/
#define	CANR_MODATAH13	(CANR_MO13_DATAH)

/** \\brief  11B0, Message Object  Data Register Low */
#define CANR_MO13_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291B0u)

/** Alias (User Manual Name) for CANR_MO13_DATAL.
* To use register names with standard convension, please use CANR_MO13_DATAL.
*/
#define	CANR_MODATAL13	(CANR_MO13_DATAL)

/** \\brief  11A0, Message Object  Function Control Register */
#define CANR_MO13_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291A0u)

/** Alias (User Manual Name) for CANR_MO13_FCR.
* To use register names with standard convension, please use CANR_MO13_FCR.
*/
#define	CANR_MOFCR13	(CANR_MO13_FCR)

/** \\brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO13_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291A4u)

/** Alias (User Manual Name) for CANR_MO13_FGPR.
* To use register names with standard convension, please use CANR_MO13_FGPR.
*/
#define	CANR_MOFGPR13	(CANR_MO13_FGPR)

/** \\brief  11A8, Message Object  Interrupt Pointer Register */
#define CANR_MO13_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291A8u)

/** Alias (User Manual Name) for CANR_MO13_IPR.
* To use register names with standard convension, please use CANR_MO13_IPR.
*/
#define	CANR_MOIPR13	(CANR_MO13_IPR)

