keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  218C, Message Object  Acceptance Mask Register */
#define CANR_MO140_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A18Cu)

/** \\brief  2198, Message Object  Arbitration Register */
#define CANR_MO140_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A198u)

/** \\brief  219C, Message Object  Control Register */
#define CANR_MO140_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A19Cu)

/** \\brief  2194, Message Object  Data Register High */
#define CANR_MO140_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A194u)

/** \\brief  2190, Message Object  Data Register Low */
#define CANR_MO140_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A190u)

/** \\brief  2180, Message Object  Function Control Register */
#define CANR_MO140_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A180u)

/** \\brief  2184, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO140_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A184u)

/** \\brief  2188, Message Object  Interrupt Pointer Register */
#define CANR_MO140_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A188u)

/** \\brief  21AC, Message Object  Acceptance Mask Register */
#define CANR_MO141_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A1ACu)

/** \\brief  21B8, Message Object  Arbitration Register */
#define CANR_MO141_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A1B8u)

/** \\brief  21BC, Message Object  Control Register */
#define CANR_MO141_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A1BCu)

/** \\brief  21B4, Message Object  Data Register High */
#define CANR_MO141_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A1B4u)

/** \\brief  21B0, Message Object  Data Register Low */
#define CANR_MO141_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A1B0u)

/** \\brief  21A0, Message Object  Function Control Register */
#define CANR_MO141_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A1A0u)

/** \\brief  21A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO141_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A1A4u)

/** \\brief  21A8, Message Object  Interrupt Pointer Register */
#define CANR_MO141_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A1A8u)

/** \\brief  21CC, Message Object  Acceptance Mask Register */
#define CANR_MO142_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A1CCu)

/** \\brief  21D8, Message Object  Arbitration Register */
#define CANR_MO142_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A1D8u)

/** \\brief  21DC, Message Object  Control Register */
#define CANR_MO142_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A1DCu)

/** \\brief  21D4, Message Object  Data Register High */
#define CANR_MO142_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A1D4u)

/** \\brief  21D0, Message Object  Data Register Low */
#define CANR_MO142_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A1D0u)

/** \\brief  21C0, Message Object  Function Control Register */
#define CANR_MO142_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A1C0u)

/** \\brief  21C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO142_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A1C4u)

/** \\brief  21C8, Message Object  Interrupt Pointer Register */
#define CANR_MO142_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A1C8u)

/** \\brief  21EC, Message Object  Acceptance Mask Register */
#define CANR_MO143_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A1ECu)

/** \\brief  21F8, Message Object  Arbitration Register */
#define CANR_MO143_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A1F8u)

/** \\brief  21FC, Message Object  Control Register */
#define CANR_MO143_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A1FCu)

/** \\brief  21F4, Message Object  Data Register High */
#define CANR_MO143_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A1F4u)

/** \\brief  21F0, Message Object  Data Register Low */
#define CANR_MO143_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A1F0u)

/** \\brief  21E0, Message Object  Function Control Register */
#define CANR_MO143_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A1E0u)

/** \\brief  21E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO143_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A1E4u)

/** \\brief  21E8, Message Object  Interrupt Pointer Register */
#define CANR_MO143_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A1E8u)

/** \\brief  220C, Message Object  Acceptance Mask Register */
#define CANR_MO144_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A20Cu)

/** \\brief  2218, Message Object  Arbitration Register */
#define CANR_MO144_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A218u)

/** \\brief  221C, Message Object  Control Register */
#define CANR_MO144_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A21Cu)

/** \\brief  2214, Message Object  Data Register High */
#define CANR_MO144_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A214u)

/** \\brief  2210, Message Object  Data Register Low */
#define CANR_MO144_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A210u)

/** \\brief  2200, Message Object  Function Control Register */
#define CANR_MO144_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A200u)

/** \\brief  2204, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO144_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A204u)

/** \\brief  2208, Message Object  Interrupt Pointer Register */
#define CANR_MO144_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A208u)

/** \\brief  222C, Message Object  Acceptance Mask Register */
#define CANR_MO145_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A22Cu)

/** \\brief  2238, Message Object  Arbitration Register */
#define CANR_MO145_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A238u)

