keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  223C, Message Object  Control Register */
#define CANR_MO145_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A23Cu)

/** \\brief  2234, Message Object  Data Register High */
#define CANR_MO145_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A234u)

/** \\brief  2230, Message Object  Data Register Low */
#define CANR_MO145_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A230u)

/** \\brief  2220, Message Object  Function Control Register */
#define CANR_MO145_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A220u)

/** \\brief  2224, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO145_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A224u)

/** \\brief  2228, Message Object  Interrupt Pointer Register */
#define CANR_MO145_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A228u)

/** \\brief  224C, Message Object  Acceptance Mask Register */
#define CANR_MO146_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A24Cu)

/** \\brief  2258, Message Object  Arbitration Register */
#define CANR_MO146_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A258u)

/** \\brief  225C, Message Object  Control Register */
#define CANR_MO146_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A25Cu)

/** \\brief  2254, Message Object  Data Register High */
#define CANR_MO146_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A254u)

/** \\brief  2250, Message Object  Data Register Low */
#define CANR_MO146_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A250u)

/** \\brief  2240, Message Object  Function Control Register */
#define CANR_MO146_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A240u)

/** \\brief  2244, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO146_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A244u)

/** \\brief  2248, Message Object  Interrupt Pointer Register */
#define CANR_MO146_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A248u)

/** \\brief  226C, Message Object  Acceptance Mask Register */
#define CANR_MO147_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A26Cu)

/** \\brief  2278, Message Object  Arbitration Register */
#define CANR_MO147_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A278u)

/** \\brief  227C, Message Object  Control Register */
#define CANR_MO147_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A27Cu)

/** \\brief  2274, Message Object  Data Register High */
#define CANR_MO147_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A274u)

/** \\brief  2270, Message Object  Data Register Low */
#define CANR_MO147_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A270u)

/** \\brief  2260, Message Object  Function Control Register */
#define CANR_MO147_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A260u)

/** \\brief  2264, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO147_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A264u)

/** \\brief  2268, Message Object  Interrupt Pointer Register */
#define CANR_MO147_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A268u)

/** \\brief  228C, Message Object  Acceptance Mask Register */
#define CANR_MO148_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A28Cu)

/** \\brief  2298, Message Object  Arbitration Register */
#define CANR_MO148_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A298u)

/** \\brief  229C, Message Object  Control Register */
#define CANR_MO148_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A29Cu)

/** \\brief  2294, Message Object  Data Register High */
#define CANR_MO148_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A294u)

/** \\brief  2290, Message Object  Data Register Low */
#define CANR_MO148_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A290u)

/** \\brief  2280, Message Object  Function Control Register */
#define CANR_MO148_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A280u)

/** \\brief  2284, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO148_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A284u)

/** \\brief  2288, Message Object  Interrupt Pointer Register */
#define CANR_MO148_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A288u)

/** \\brief  22AC, Message Object  Acceptance Mask Register */
#define CANR_MO149_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A2ACu)

/** \\brief  22B8, Message Object  Arbitration Register */
#define CANR_MO149_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A2B8u)

/** \\brief  22BC, Message Object  Control Register */
#define CANR_MO149_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A2BCu)

/** \\brief  22B4, Message Object  Data Register High */
#define CANR_MO149_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A2B4u)

/** \\brief  22B0, Message Object  Data Register Low */
#define CANR_MO149_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A2B0u)

/** \\brief  22A0, Message Object  Function Control Register */
#define CANR_MO149_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A2A0u)

/** \\brief  22A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO149_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A2A4u)

/** \\brief  22A8, Message Object  Interrupt Pointer Register */
#define CANR_MO149_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A2A8u)

/** \\brief  11CC, Message Object  Acceptance Mask Register */
#define CANR_MO14_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291CCu)

/** Alias (User Manual Name) for CANR_MO14_AMR.
* To use register names with standard convension, please use CANR_MO14_AMR.
*/
#define	CANR_MOAMR14	(CANR_MO14_AMR)

/** \\brief  11D8, Message Object  Arbitration Register */
#define CANR_MO14_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291D8u)

/** Alias (User Manual Name) for CANR_MO14_AR.
* To use register names with standard convension, please use CANR_MO14_AR.
*/
#define	CANR_MOAR14	(CANR_MO14_AR)

/** \\brief  11DC, Message Object  Control Register */
#define CANR_MO14_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00291DCu)

/** Alias (User Manual Name) for CANR_MO14_CTR_STAT.
* To use register names with standard convension, please use CANR_MO14_CTR_STAT.
*/
#define	CANR_MOCTR14	(CANR_MO14_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO14_CTR_STAT.
* To use register names with standard convension, please use CANR_MO14_CTR_STAT.
*/
#define	CANR_MOSTAT14	(CANR_MO14_CTR_STAT)

/** \\brief  11D4, Message Object  Data Register High */
#define CANR_MO14_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291D4u)

/** Alias (User Manual Name) for CANR_MO14_DATAH.
* To use register names with standard convension, please use CANR_MO14_DATAH.
*/
#define	CANR_MODATAH14	(CANR_MO14_DATAH)

