keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  11D0, Message Object  Data Register Low */
#define CANR_MO14_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291D0u)

/** Alias (User Manual Name) for CANR_MO14_DATAL.
* To use register names with standard convension, please use CANR_MO14_DATAL.
*/
#define	CANR_MODATAL14	(CANR_MO14_DATAL)

/** \\brief  11C0, Message Object  Function Control Register */
#define CANR_MO14_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291C0u)

/** Alias (User Manual Name) for CANR_MO14_FCR.
* To use register names with standard convension, please use CANR_MO14_FCR.
*/
#define	CANR_MOFCR14	(CANR_MO14_FCR)

/** \\brief  11C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO14_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291C4u)

/** Alias (User Manual Name) for CANR_MO14_FGPR.
* To use register names with standard convension, please use CANR_MO14_FGPR.
*/
#define	CANR_MOFGPR14	(CANR_MO14_FGPR)

/** \\brief  11C8, Message Object  Interrupt Pointer Register */
#define CANR_MO14_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291C8u)

/** Alias (User Manual Name) for CANR_MO14_IPR.
* To use register names with standard convension, please use CANR_MO14_IPR.
*/
#define	CANR_MOIPR14	(CANR_MO14_IPR)

/** \\brief  22CC, Message Object  Acceptance Mask Register */
#define CANR_MO150_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A2CCu)

/** \\brief  22D8, Message Object  Arbitration Register */
#define CANR_MO150_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A2D8u)

/** \\brief  22DC, Message Object  Control Register */
#define CANR_MO150_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A2DCu)

/** \\brief  22D4, Message Object  Data Register High */
#define CANR_MO150_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A2D4u)

/** \\brief  22D0, Message Object  Data Register Low */
#define CANR_MO150_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A2D0u)

/** \\brief  22C0, Message Object  Function Control Register */
#define CANR_MO150_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A2C0u)

/** \\brief  22C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO150_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A2C4u)

/** \\brief  22C8, Message Object  Interrupt Pointer Register */
#define CANR_MO150_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A2C8u)

/** \\brief  22EC, Message Object  Acceptance Mask Register */
#define CANR_MO151_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A2ECu)

/** \\brief  22F8, Message Object  Arbitration Register */
#define CANR_MO151_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A2F8u)

/** \\brief  22FC, Message Object  Control Register */
#define CANR_MO151_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A2FCu)

/** \\brief  22F4, Message Object  Data Register High */
#define CANR_MO151_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A2F4u)

/** \\brief  22F0, Message Object  Data Register Low */
#define CANR_MO151_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A2F0u)

/** \\brief  22E0, Message Object  Function Control Register */
#define CANR_MO151_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A2E0u)

/** \\brief  22E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO151_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A2E4u)

/** \\brief  22E8, Message Object  Interrupt Pointer Register */
#define CANR_MO151_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A2E8u)

/** \\brief  230C, Message Object  Acceptance Mask Register */
#define CANR_MO152_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A30Cu)

/** \\brief  2318, Message Object  Arbitration Register */
#define CANR_MO152_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A318u)

/** \\brief  231C, Message Object  Control Register */
#define CANR_MO152_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A31Cu)

/** \\brief  2314, Message Object  Data Register High */
#define CANR_MO152_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A314u)

/** \\brief  2310, Message Object  Data Register Low */
#define CANR_MO152_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A310u)

/** \\brief  2300, Message Object  Function Control Register */
#define CANR_MO152_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A300u)

/** \\brief  2304, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO152_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A304u)

/** \\brief  2308, Message Object  Interrupt Pointer Register */
#define CANR_MO152_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A308u)

/** \\brief  232C, Message Object  Acceptance Mask Register */
#define CANR_MO153_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A32Cu)

/** \\brief  2338, Message Object  Arbitration Register */
#define CANR_MO153_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A338u)

/** \\brief  233C, Message Object  Control Register */
#define CANR_MO153_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A33Cu)

/** \\brief  2334, Message Object  Data Register High */
#define CANR_MO153_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A334u)

/** \\brief  2330, Message Object  Data Register Low */
#define CANR_MO153_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A330u)

/** \\brief  2320, Message Object  Function Control Register */
#define CANR_MO153_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A320u)

/** \\brief  2324, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO153_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A324u)

/** \\brief  2328, Message Object  Interrupt Pointer Register */
#define CANR_MO153_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A328u)

/** \\brief  234C, Message Object  Acceptance Mask Register */
#define CANR_MO154_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A34Cu)

/** \\brief  2358, Message Object  Arbitration Register */
#define CANR_MO154_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A358u)

