keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  235C, Message Object  Control Register */
#define CANR_MO154_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A35Cu)

/** \\brief  2354, Message Object  Data Register High */
#define CANR_MO154_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A354u)

/** \\brief  2350, Message Object  Data Register Low */
#define CANR_MO154_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A350u)

/** \\brief  2340, Message Object  Function Control Register */
#define CANR_MO154_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A340u)

/** \\brief  2344, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO154_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A344u)

/** \\brief  2348, Message Object  Interrupt Pointer Register */
#define CANR_MO154_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A348u)

/** \\brief  236C, Message Object  Acceptance Mask Register */
#define CANR_MO155_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A36Cu)

/** \\brief  2378, Message Object  Arbitration Register */
#define CANR_MO155_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A378u)

/** \\brief  237C, Message Object  Control Register */
#define CANR_MO155_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A37Cu)

/** \\brief  2374, Message Object  Data Register High */
#define CANR_MO155_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A374u)

/** \\brief  2370, Message Object  Data Register Low */
#define CANR_MO155_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A370u)

/** \\brief  2360, Message Object  Function Control Register */
#define CANR_MO155_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A360u)

/** \\brief  2364, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO155_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A364u)

/** \\brief  2368, Message Object  Interrupt Pointer Register */
#define CANR_MO155_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A368u)

/** \\brief  238C, Message Object  Acceptance Mask Register */
#define CANR_MO156_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A38Cu)

/** \\brief  2398, Message Object  Arbitration Register */
#define CANR_MO156_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A398u)

/** \\brief  239C, Message Object  Control Register */
#define CANR_MO156_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A39Cu)

/** \\brief  2394, Message Object  Data Register High */
#define CANR_MO156_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A394u)

/** \\brief  2390, Message Object  Data Register Low */
#define CANR_MO156_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A390u)

/** \\brief  2380, Message Object  Function Control Register */
#define CANR_MO156_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A380u)

/** \\brief  2384, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO156_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A384u)

/** \\brief  2388, Message Object  Interrupt Pointer Register */
#define CANR_MO156_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A388u)

/** \\brief  23AC, Message Object  Acceptance Mask Register */
#define CANR_MO157_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A3ACu)

/** \\brief  23B8, Message Object  Arbitration Register */
#define CANR_MO157_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A3B8u)

/** \\brief  23BC, Message Object  Control Register */
#define CANR_MO157_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A3BCu)

/** \\brief  23B4, Message Object  Data Register High */
#define CANR_MO157_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A3B4u)

/** \\brief  23B0, Message Object  Data Register Low */
#define CANR_MO157_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A3B0u)

/** \\brief  23A0, Message Object  Function Control Register */
#define CANR_MO157_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A3A0u)

/** \\brief  23A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO157_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A3A4u)

/** \\brief  23A8, Message Object  Interrupt Pointer Register */
#define CANR_MO157_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A3A8u)

/** \\brief  23CC, Message Object  Acceptance Mask Register */
#define CANR_MO158_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A3CCu)

/** \\brief  23D8, Message Object  Arbitration Register */
#define CANR_MO158_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A3D8u)

/** \\brief  23DC, Message Object  Control Register */
#define CANR_MO158_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A3DCu)

/** \\brief  23D4, Message Object  Data Register High */
#define CANR_MO158_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A3D4u)

/** \\brief  23D0, Message Object  Data Register Low */
#define CANR_MO158_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A3D0u)

/** \\brief  23C0, Message Object  Function Control Register */
#define CANR_MO158_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A3C0u)

/** \\brief  23C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO158_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A3C4u)

/** \\brief  23C8, Message Object  Interrupt Pointer Register */
#define CANR_MO158_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A3C8u)

/** \\brief  23EC, Message Object  Acceptance Mask Register */
#define CANR_MO159_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A3ECu)

/** \\brief  23F8, Message Object  Arbitration Register */
#define CANR_MO159_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A3F8u)

/** \\brief  23FC, Message Object  Control Register */
#define CANR_MO159_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A3FCu)

/** \\brief  23F4, Message Object  Data Register High */
#define CANR_MO159_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A3F4u)

/** \\brief  23F0, Message Object  Data Register Low */
#define CANR_MO159_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A3F0u)

/** \\brief  23E0, Message Object  Function Control Register */
#define CANR_MO159_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A3E0u)

/** \\brief  23E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO159_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A3E4u)

/** \\brief  23E8, Message Object  Interrupt Pointer Register */
#define CANR_MO159_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A3E8u)

/** \\brief  11EC, Message Object  Acceptance Mask Register */
#define CANR_MO15_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00291ECu)

/** Alias (User Manual Name) for CANR_MO15_AMR.
* To use register names with standard convension, please use CANR_MO15_AMR.
*/
#define	CANR_MOAMR15	(CANR_MO15_AMR)

/** \\brief  11F8, Message Object  Arbitration Register */
#define CANR_MO15_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00291F8u)

/** Alias (User Manual Name) for CANR_MO15_AR.
* To use register names with standard convension, please use CANR_MO15_AR.
*/
#define	CANR_MOAR15	(CANR_MO15_AR)

