keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  11FC, Message Object  Control Register */
#define CANR_MO15_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00291FCu)

/** Alias (User Manual Name) for CANR_MO15_CTR_STAT.
* To use register names with standard convension, please use CANR_MO15_CTR_STAT.
*/
#define	CANR_MOCTR15	(CANR_MO15_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO15_CTR_STAT.
* To use register names with standard convension, please use CANR_MO15_CTR_STAT.
*/
#define	CANR_MOSTAT15	(CANR_MO15_CTR_STAT)

/** \\brief  11F4, Message Object  Data Register High */
#define CANR_MO15_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00291F4u)

/** Alias (User Manual Name) for CANR_MO15_DATAH.
* To use register names with standard convension, please use CANR_MO15_DATAH.
*/
#define	CANR_MODATAH15	(CANR_MO15_DATAH)

/** \\brief  11F0, Message Object  Data Register Low */
#define CANR_MO15_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00291F0u)

/** Alias (User Manual Name) for CANR_MO15_DATAL.
* To use register names with standard convension, please use CANR_MO15_DATAL.
*/
#define	CANR_MODATAL15	(CANR_MO15_DATAL)

/** \\brief  11E0, Message Object  Function Control Register */
#define CANR_MO15_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00291E0u)

/** Alias (User Manual Name) for CANR_MO15_FCR.
* To use register names with standard convension, please use CANR_MO15_FCR.
*/
#define	CANR_MOFCR15	(CANR_MO15_FCR)

/** \\brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO15_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00291E4u)

/** Alias (User Manual Name) for CANR_MO15_FGPR.
* To use register names with standard convension, please use CANR_MO15_FGPR.
*/
#define	CANR_MOFGPR15	(CANR_MO15_FGPR)

/** \\brief  11E8, Message Object  Interrupt Pointer Register */
#define CANR_MO15_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00291E8u)

/** Alias (User Manual Name) for CANR_MO15_IPR.
* To use register names with standard convension, please use CANR_MO15_IPR.
*/
#define	CANR_MOIPR15	(CANR_MO15_IPR)

/** \\brief  240C, Message Object  Acceptance Mask Register */
#define CANR_MO160_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A40Cu)

/** \\brief  2418, Message Object  Arbitration Register */
#define CANR_MO160_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A418u)

/** \\brief  241C, Message Object  Control Register */
#define CANR_MO160_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A41Cu)

/** \\brief  2414, Message Object  Data Register High */
#define CANR_MO160_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A414u)

/** \\brief  2410, Message Object  Data Register Low */
#define CANR_MO160_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A410u)

/** \\brief  2400, Message Object  Function Control Register */
#define CANR_MO160_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A400u)

/** \\brief  2404, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO160_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A404u)

/** \\brief  2408, Message Object  Interrupt Pointer Register */
#define CANR_MO160_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A408u)

/** \\brief  242C, Message Object  Acceptance Mask Register */
#define CANR_MO161_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A42Cu)

/** \\brief  2438, Message Object  Arbitration Register */
#define CANR_MO161_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A438u)

/** \\brief  243C, Message Object  Control Register */
#define CANR_MO161_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A43Cu)

/** \\brief  2434, Message Object  Data Register High */
#define CANR_MO161_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A434u)

/** \\brief  2430, Message Object  Data Register Low */
#define CANR_MO161_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A430u)

/** \\brief  2420, Message Object  Function Control Register */
#define CANR_MO161_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A420u)

/** \\brief  2424, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO161_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A424u)

/** \\brief  2428, Message Object  Interrupt Pointer Register */
#define CANR_MO161_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A428u)

/** \\brief  244C, Message Object  Acceptance Mask Register */
#define CANR_MO162_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A44Cu)

/** \\brief  2458, Message Object  Arbitration Register */
#define CANR_MO162_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A458u)

/** \\brief  245C, Message Object  Control Register */
#define CANR_MO162_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A45Cu)

/** \\brief  2454, Message Object  Data Register High */
#define CANR_MO162_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A454u)

/** \\brief  2450, Message Object  Data Register Low */
#define CANR_MO162_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A450u)

/** \\brief  2440, Message Object  Function Control Register */
#define CANR_MO162_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A440u)

/** \\brief  2444, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO162_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A444u)

/** \\brief  2448, Message Object  Interrupt Pointer Register */
#define CANR_MO162_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A448u)

/** \\brief  246C, Message Object  Acceptance Mask Register */
#define CANR_MO163_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A46Cu)

/** \\brief  2478, Message Object  Arbitration Register */
#define CANR_MO163_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A478u)

/** \\brief  247C, Message Object  Control Register */
#define CANR_MO163_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A47Cu)

/** \\brief  2474, Message Object  Data Register High */
#define CANR_MO163_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A474u)

/** \\brief  2470, Message Object  Data Register Low */
#define CANR_MO163_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A470u)

/** \\brief  2460, Message Object  Function Control Register */
#define CANR_MO163_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A460u)

/** \\brief  2464, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO163_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A464u)

/** \\brief  2468, Message Object  Interrupt Pointer Register */
#define CANR_MO163_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A468u)

