keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  248C, Message Object  Acceptance Mask Register */
#define CANR_MO164_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A48Cu)

/** \\brief  2498, Message Object  Arbitration Register */
#define CANR_MO164_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A498u)

/** \\brief  249C, Message Object  Control Register */
#define CANR_MO164_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A49Cu)

/** \\brief  2494, Message Object  Data Register High */
#define CANR_MO164_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A494u)

/** \\brief  2490, Message Object  Data Register Low */
#define CANR_MO164_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A490u)

/** \\brief  2480, Message Object  Function Control Register */
#define CANR_MO164_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A480u)

/** \\brief  2484, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO164_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A484u)

/** \\brief  2488, Message Object  Interrupt Pointer Register */
#define CANR_MO164_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A488u)

/** \\brief  24AC, Message Object  Acceptance Mask Register */
#define CANR_MO165_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A4ACu)

/** \\brief  24B8, Message Object  Arbitration Register */
#define CANR_MO165_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A4B8u)

/** \\brief  24BC, Message Object  Control Register */
#define CANR_MO165_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A4BCu)

/** \\brief  24B4, Message Object  Data Register High */
#define CANR_MO165_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A4B4u)

/** \\brief  24B0, Message Object  Data Register Low */
#define CANR_MO165_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A4B0u)

/** \\brief  24A0, Message Object  Function Control Register */
#define CANR_MO165_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A4A0u)

/** \\brief  24A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO165_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A4A4u)

/** \\brief  24A8, Message Object  Interrupt Pointer Register */
#define CANR_MO165_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A4A8u)

/** \\brief  24CC, Message Object  Acceptance Mask Register */
#define CANR_MO166_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A4CCu)

/** \\brief  24D8, Message Object  Arbitration Register */
#define CANR_MO166_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A4D8u)

/** \\brief  24DC, Message Object  Control Register */
#define CANR_MO166_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A4DCu)

/** \\brief  24D4, Message Object  Data Register High */
#define CANR_MO166_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A4D4u)

/** \\brief  24D0, Message Object  Data Register Low */
#define CANR_MO166_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A4D0u)

/** \\brief  24C0, Message Object  Function Control Register */
#define CANR_MO166_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A4C0u)

/** \\brief  24C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO166_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A4C4u)

/** \\brief  24C8, Message Object  Interrupt Pointer Register */
#define CANR_MO166_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A4C8u)

/** \\brief  24EC, Message Object  Acceptance Mask Register */
#define CANR_MO167_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A4ECu)

/** \\brief  24F8, Message Object  Arbitration Register */
#define CANR_MO167_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A4F8u)

/** \\brief  24FC, Message Object  Control Register */
#define CANR_MO167_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A4FCu)

/** \\brief  24F4, Message Object  Data Register High */
#define CANR_MO167_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A4F4u)

/** \\brief  24F0, Message Object  Data Register Low */
#define CANR_MO167_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A4F0u)

/** \\brief  24E0, Message Object  Function Control Register */
#define CANR_MO167_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A4E0u)

/** \\brief  24E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO167_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A4E4u)

/** \\brief  24E8, Message Object  Interrupt Pointer Register */
#define CANR_MO167_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A4E8u)

/** \\brief  250C, Message Object  Acceptance Mask Register */
#define CANR_MO168_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A50Cu)

/** \\brief  2518, Message Object  Arbitration Register */
#define CANR_MO168_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A518u)

/** \\brief  251C, Message Object  Control Register */
#define CANR_MO168_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A51Cu)

/** \\brief  2514, Message Object  Data Register High */
#define CANR_MO168_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A514u)

/** \\brief  2510, Message Object  Data Register Low */
#define CANR_MO168_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A510u)

/** \\brief  2500, Message Object  Function Control Register */
#define CANR_MO168_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A500u)

/** \\brief  2504, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO168_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A504u)

/** \\brief  2508, Message Object  Interrupt Pointer Register */
#define CANR_MO168_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A508u)

/** \\brief  252C, Message Object  Acceptance Mask Register */
#define CANR_MO169_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A52Cu)

/** \\brief  2538, Message Object  Arbitration Register */
#define CANR_MO169_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A538u)

/** \\brief  253C, Message Object  Control Register */
#define CANR_MO169_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A53Cu)

/** \\brief  2534, Message Object  Data Register High */
#define CANR_MO169_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A534u)

/** \\brief  2530, Message Object  Data Register Low */
#define CANR_MO169_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A530u)

/** \\brief  2520, Message Object  Function Control Register */
#define CANR_MO169_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A520u)

/** \\brief  2524, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO169_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A524u)

/** \\brief  2528, Message Object  Interrupt Pointer Register */
#define CANR_MO169_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A528u)

/** \\brief  120C, Message Object  Acceptance Mask Register */
#define CANR_MO16_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002920Cu)

