keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO16_AMR.
* To use register names with standard convension, please use CANR_MO16_AMR.
*/
#define	CANR_MOAMR16	(CANR_MO16_AMR)

/** \\brief  1218, Message Object  Arbitration Register */
#define CANR_MO16_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029218u)

/** Alias (User Manual Name) for CANR_MO16_AR.
* To use register names with standard convension, please use CANR_MO16_AR.
*/
#define	CANR_MOAR16	(CANR_MO16_AR)

/** \\brief  121C, Message Object  Control Register */
#define CANR_MO16_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002921Cu)

/** Alias (User Manual Name) for CANR_MO16_CTR_STAT.
* To use register names with standard convension, please use CANR_MO16_CTR_STAT.
*/
#define	CANR_MOCTR16	(CANR_MO16_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO16_CTR_STAT.
* To use register names with standard convension, please use CANR_MO16_CTR_STAT.
*/
#define	CANR_MOSTAT16	(CANR_MO16_CTR_STAT)

/** \\brief  1214, Message Object  Data Register High */
#define CANR_MO16_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029214u)

/** Alias (User Manual Name) for CANR_MO16_DATAH.
* To use register names with standard convension, please use CANR_MO16_DATAH.
*/
#define	CANR_MODATAH16	(CANR_MO16_DATAH)

/** \\brief  1210, Message Object  Data Register Low */
#define CANR_MO16_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029210u)

/** Alias (User Manual Name) for CANR_MO16_DATAL.
* To use register names with standard convension, please use CANR_MO16_DATAL.
*/
#define	CANR_MODATAL16	(CANR_MO16_DATAL)

/** \\brief  1200, Message Object  Function Control Register */
#define CANR_MO16_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029200u)

/** Alias (User Manual Name) for CANR_MO16_FCR.
* To use register names with standard convension, please use CANR_MO16_FCR.
*/
#define	CANR_MOFCR16	(CANR_MO16_FCR)

/** \\brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO16_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029204u)

/** Alias (User Manual Name) for CANR_MO16_FGPR.
* To use register names with standard convension, please use CANR_MO16_FGPR.
*/
#define	CANR_MOFGPR16	(CANR_MO16_FGPR)

/** \\brief  1208, Message Object  Interrupt Pointer Register */
#define CANR_MO16_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029208u)

/** Alias (User Manual Name) for CANR_MO16_IPR.
* To use register names with standard convension, please use CANR_MO16_IPR.
*/
#define	CANR_MOIPR16	(CANR_MO16_IPR)

/** \\brief  254C, Message Object  Acceptance Mask Register */
#define CANR_MO170_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A54Cu)

/** \\brief  2558, Message Object  Arbitration Register */
#define CANR_MO170_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A558u)

/** \\brief  255C, Message Object  Control Register */
#define CANR_MO170_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A55Cu)

/** \\brief  2554, Message Object  Data Register High */
#define CANR_MO170_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A554u)

/** \\brief  2550, Message Object  Data Register Low */
#define CANR_MO170_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A550u)

/** \\brief  2540, Message Object  Function Control Register */
#define CANR_MO170_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A540u)

/** \\brief  2544, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO170_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A544u)

/** \\brief  2548, Message Object  Interrupt Pointer Register */
#define CANR_MO170_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A548u)

/** \\brief  256C, Message Object  Acceptance Mask Register */
#define CANR_MO171_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A56Cu)

/** \\brief  2578, Message Object  Arbitration Register */
#define CANR_MO171_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A578u)

/** \\brief  257C, Message Object  Control Register */
#define CANR_MO171_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A57Cu)

/** \\brief  2574, Message Object  Data Register High */
#define CANR_MO171_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A574u)

/** \\brief  2570, Message Object  Data Register Low */
#define CANR_MO171_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A570u)

/** \\brief  2560, Message Object  Function Control Register */
#define CANR_MO171_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A560u)

/** \\brief  2564, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO171_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A564u)

/** \\brief  2568, Message Object  Interrupt Pointer Register */
#define CANR_MO171_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A568u)

/** \\brief  258C, Message Object  Acceptance Mask Register */
#define CANR_MO172_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A58Cu)

/** \\brief  2598, Message Object  Arbitration Register */
#define CANR_MO172_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A598u)

/** \\brief  259C, Message Object  Control Register */
#define CANR_MO172_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A59Cu)

/** \\brief  2594, Message Object  Data Register High */
#define CANR_MO172_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A594u)

/** \\brief  2590, Message Object  Data Register Low */
#define CANR_MO172_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A590u)

/** \\brief  2580, Message Object  Function Control Register */
#define CANR_MO172_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A580u)

/** \\brief  2584, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO172_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A584u)

