keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2588, Message Object  Interrupt Pointer Register */
#define CANR_MO172_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A588u)

/** \\brief  25AC, Message Object  Acceptance Mask Register */
#define CANR_MO173_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A5ACu)

/** \\brief  25B8, Message Object  Arbitration Register */
#define CANR_MO173_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A5B8u)

/** \\brief  25BC, Message Object  Control Register */
#define CANR_MO173_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A5BCu)

/** \\brief  25B4, Message Object  Data Register High */
#define CANR_MO173_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A5B4u)

/** \\brief  25B0, Message Object  Data Register Low */
#define CANR_MO173_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A5B0u)

/** \\brief  25A0, Message Object  Function Control Register */
#define CANR_MO173_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A5A0u)

/** \\brief  25A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO173_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A5A4u)

/** \\brief  25A8, Message Object  Interrupt Pointer Register */
#define CANR_MO173_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A5A8u)

/** \\brief  25CC, Message Object  Acceptance Mask Register */
#define CANR_MO174_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A5CCu)

/** \\brief  25D8, Message Object  Arbitration Register */
#define CANR_MO174_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A5D8u)

/** \\brief  25DC, Message Object  Control Register */
#define CANR_MO174_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A5DCu)

/** \\brief  25D4, Message Object  Data Register High */
#define CANR_MO174_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A5D4u)

/** \\brief  25D0, Message Object  Data Register Low */
#define CANR_MO174_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A5D0u)

/** \\brief  25C0, Message Object  Function Control Register */
#define CANR_MO174_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A5C0u)

/** \\brief  25C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO174_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A5C4u)

/** \\brief  25C8, Message Object  Interrupt Pointer Register */
#define CANR_MO174_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A5C8u)

/** \\brief  25EC, Message Object  Acceptance Mask Register */
#define CANR_MO175_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A5ECu)

/** \\brief  25F8, Message Object  Arbitration Register */
#define CANR_MO175_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A5F8u)

/** \\brief  25FC, Message Object  Control Register */
#define CANR_MO175_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A5FCu)

/** \\brief  25F4, Message Object  Data Register High */
#define CANR_MO175_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A5F4u)

/** \\brief  25F0, Message Object  Data Register Low */
#define CANR_MO175_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A5F0u)

/** \\brief  25E0, Message Object  Function Control Register */
#define CANR_MO175_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A5E0u)

/** \\brief  25E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO175_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A5E4u)

/** \\brief  25E8, Message Object  Interrupt Pointer Register */
#define CANR_MO175_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A5E8u)

/** \\brief  260C, Message Object  Acceptance Mask Register */
#define CANR_MO176_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A60Cu)

/** \\brief  2618, Message Object  Arbitration Register */
#define CANR_MO176_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A618u)

/** \\brief  261C, Message Object  Control Register */
#define CANR_MO176_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A61Cu)

/** \\brief  2614, Message Object  Data Register High */
#define CANR_MO176_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A614u)

/** \\brief  2610, Message Object  Data Register Low */
#define CANR_MO176_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A610u)

/** \\brief  2600, Message Object  Function Control Register */
#define CANR_MO176_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A600u)

/** \\brief  2604, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO176_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A604u)

/** \\brief  2608, Message Object  Interrupt Pointer Register */
#define CANR_MO176_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A608u)

/** \\brief  262C, Message Object  Acceptance Mask Register */
#define CANR_MO177_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A62Cu)

/** \\brief  2638, Message Object  Arbitration Register */
#define CANR_MO177_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A638u)

/** \\brief  263C, Message Object  Control Register */
#define CANR_MO177_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A63Cu)

/** \\brief  2634, Message Object  Data Register High */
#define CANR_MO177_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A634u)

/** \\brief  2630, Message Object  Data Register Low */
#define CANR_MO177_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A630u)

/** \\brief  2620, Message Object  Function Control Register */
#define CANR_MO177_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A620u)

/** \\brief  2624, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO177_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A624u)

/** \\brief  2628, Message Object  Interrupt Pointer Register */
#define CANR_MO177_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A628u)

/** \\brief  264C, Message Object  Acceptance Mask Register */
#define CANR_MO178_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A64Cu)

