keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2658, Message Object  Arbitration Register */
#define CANR_MO178_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A658u)

/** \\brief  265C, Message Object  Control Register */
#define CANR_MO178_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A65Cu)

/** \\brief  2654, Message Object  Data Register High */
#define CANR_MO178_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A654u)

/** \\brief  2650, Message Object  Data Register Low */
#define CANR_MO178_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A650u)

/** \\brief  2640, Message Object  Function Control Register */
#define CANR_MO178_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A640u)

/** \\brief  2644, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO178_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A644u)

/** \\brief  2648, Message Object  Interrupt Pointer Register */
#define CANR_MO178_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A648u)

/** \\brief  266C, Message Object  Acceptance Mask Register */
#define CANR_MO179_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A66Cu)

/** \\brief  2678, Message Object  Arbitration Register */
#define CANR_MO179_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A678u)

/** \\brief  267C, Message Object  Control Register */
#define CANR_MO179_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A67Cu)

/** \\brief  2674, Message Object  Data Register High */
#define CANR_MO179_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A674u)

/** \\brief  2670, Message Object  Data Register Low */
#define CANR_MO179_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A670u)

/** \\brief  2660, Message Object  Function Control Register */
#define CANR_MO179_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A660u)

/** \\brief  2664, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO179_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A664u)

/** \\brief  2668, Message Object  Interrupt Pointer Register */
#define CANR_MO179_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A668u)

/** \\brief  122C, Message Object  Acceptance Mask Register */
#define CANR_MO17_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002922Cu)

/** Alias (User Manual Name) for CANR_MO17_AMR.
* To use register names with standard convension, please use CANR_MO17_AMR.
*/
#define	CANR_MOAMR17	(CANR_MO17_AMR)

/** \\brief  1238, Message Object  Arbitration Register */
#define CANR_MO17_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029238u)

/** Alias (User Manual Name) for CANR_MO17_AR.
* To use register names with standard convension, please use CANR_MO17_AR.
*/
#define	CANR_MOAR17	(CANR_MO17_AR)

/** \\brief  123C, Message Object  Control Register */
#define CANR_MO17_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002923Cu)

/** Alias (User Manual Name) for CANR_MO17_CTR_STAT.
* To use register names with standard convension, please use CANR_MO17_CTR_STAT.
*/
#define	CANR_MOCTR17	(CANR_MO17_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO17_CTR_STAT.
* To use register names with standard convension, please use CANR_MO17_CTR_STAT.
*/
#define	CANR_MOSTAT17	(CANR_MO17_CTR_STAT)

/** \\brief  1234, Message Object  Data Register High */
#define CANR_MO17_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029234u)

/** Alias (User Manual Name) for CANR_MO17_DATAH.
* To use register names with standard convension, please use CANR_MO17_DATAH.
*/
#define	CANR_MODATAH17	(CANR_MO17_DATAH)

/** \\brief  1230, Message Object  Data Register Low */
#define CANR_MO17_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029230u)

/** Alias (User Manual Name) for CANR_MO17_DATAL.
* To use register names with standard convension, please use CANR_MO17_DATAL.
*/
#define	CANR_MODATAL17	(CANR_MO17_DATAL)

/** \\brief  1220, Message Object  Function Control Register */
#define CANR_MO17_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029220u)

/** Alias (User Manual Name) for CANR_MO17_FCR.
* To use register names with standard convension, please use CANR_MO17_FCR.
*/
#define	CANR_MOFCR17	(CANR_MO17_FCR)

/** \\brief  1224, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO17_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029224u)

/** Alias (User Manual Name) for CANR_MO17_FGPR.
* To use register names with standard convension, please use CANR_MO17_FGPR.
*/
#define	CANR_MOFGPR17	(CANR_MO17_FGPR)

/** \\brief  1228, Message Object  Interrupt Pointer Register */
#define CANR_MO17_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029228u)

/** Alias (User Manual Name) for CANR_MO17_IPR.
* To use register names with standard convension, please use CANR_MO17_IPR.
*/
#define	CANR_MOIPR17	(CANR_MO17_IPR)

/** \\brief  268C, Message Object  Acceptance Mask Register */
#define CANR_MO180_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A68Cu)

/** \\brief  2698, Message Object  Arbitration Register */
#define CANR_MO180_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A698u)

/** \\brief  269C, Message Object  Control Register */
#define CANR_MO180_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A69Cu)

/** \\brief  2694, Message Object  Data Register High */
#define CANR_MO180_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A694u)

/** \\brief  2690, Message Object  Data Register Low */
#define CANR_MO180_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A690u)

/** \\brief  2680, Message Object  Function Control Register */
#define CANR_MO180_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A680u)

/** \\brief  2684, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO180_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A684u)

/** \\brief  2688, Message Object  Interrupt Pointer Register */
#define CANR_MO180_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A688u)

