keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  26AC, Message Object  Acceptance Mask Register */
#define CANR_MO181_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A6ACu)

/** \\brief  26B8, Message Object  Arbitration Register */
#define CANR_MO181_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A6B8u)

/** \\brief  26BC, Message Object  Control Register */
#define CANR_MO181_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A6BCu)

/** \\brief  26B4, Message Object  Data Register High */
#define CANR_MO181_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A6B4u)

/** \\brief  26B0, Message Object  Data Register Low */
#define CANR_MO181_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A6B0u)

/** \\brief  26A0, Message Object  Function Control Register */
#define CANR_MO181_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A6A0u)

/** \\brief  26A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO181_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A6A4u)

/** \\brief  26A8, Message Object  Interrupt Pointer Register */
#define CANR_MO181_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A6A8u)

/** \\brief  26CC, Message Object  Acceptance Mask Register */
#define CANR_MO182_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A6CCu)

/** \\brief  26D8, Message Object  Arbitration Register */
#define CANR_MO182_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A6D8u)

/** \\brief  26DC, Message Object  Control Register */
#define CANR_MO182_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A6DCu)

/** \\brief  26D4, Message Object  Data Register High */
#define CANR_MO182_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A6D4u)

/** \\brief  26D0, Message Object  Data Register Low */
#define CANR_MO182_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A6D0u)

/** \\brief  26C0, Message Object  Function Control Register */
#define CANR_MO182_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A6C0u)

/** \\brief  26C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO182_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A6C4u)

/** \\brief  26C8, Message Object  Interrupt Pointer Register */
#define CANR_MO182_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A6C8u)

/** \\brief  26EC, Message Object  Acceptance Mask Register */
#define CANR_MO183_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A6ECu)

/** \\brief  26F8, Message Object  Arbitration Register */
#define CANR_MO183_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A6F8u)

/** \\brief  26FC, Message Object  Control Register */
#define CANR_MO183_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A6FCu)

/** \\brief  26F4, Message Object  Data Register High */
#define CANR_MO183_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A6F4u)

/** \\brief  26F0, Message Object  Data Register Low */
#define CANR_MO183_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A6F0u)

/** \\brief  26E0, Message Object  Function Control Register */
#define CANR_MO183_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A6E0u)

/** \\brief  26E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO183_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A6E4u)

/** \\brief  26E8, Message Object  Interrupt Pointer Register */
#define CANR_MO183_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A6E8u)

/** \\brief  270C, Message Object  Acceptance Mask Register */
#define CANR_MO184_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A70Cu)

/** \\brief  2718, Message Object  Arbitration Register */
#define CANR_MO184_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A718u)

/** \\brief  271C, Message Object  Control Register */
#define CANR_MO184_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A71Cu)

/** \\brief  2714, Message Object  Data Register High */
#define CANR_MO184_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A714u)

/** \\brief  2710, Message Object  Data Register Low */
#define CANR_MO184_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A710u)

/** \\brief  2700, Message Object  Function Control Register */
#define CANR_MO184_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A700u)

/** \\brief  2704, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO184_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A704u)

/** \\brief  2708, Message Object  Interrupt Pointer Register */
#define CANR_MO184_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A708u)

/** \\brief  272C, Message Object  Acceptance Mask Register */
#define CANR_MO185_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A72Cu)

/** \\brief  2738, Message Object  Arbitration Register */
#define CANR_MO185_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A738u)

/** \\brief  273C, Message Object  Control Register */
#define CANR_MO185_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A73Cu)

/** \\brief  2734, Message Object  Data Register High */
#define CANR_MO185_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A734u)

/** \\brief  2730, Message Object  Data Register Low */
#define CANR_MO185_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A730u)

/** \\brief  2720, Message Object  Function Control Register */
#define CANR_MO185_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A720u)

/** \\brief  2724, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO185_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A724u)

/** \\brief  2728, Message Object  Interrupt Pointer Register */
#define CANR_MO185_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A728u)

/** \\brief  274C, Message Object  Acceptance Mask Register */
#define CANR_MO186_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A74Cu)

/** \\brief  2758, Message Object  Arbitration Register */
#define CANR_MO186_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A758u)

/** \\brief  275C, Message Object  Control Register */
#define CANR_MO186_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A75Cu)

/** \\brief  2754, Message Object  Data Register High */
#define CANR_MO186_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A754u)

