keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2750, Message Object  Data Register Low */
#define CANR_MO186_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A750u)

/** \\brief  2740, Message Object  Function Control Register */
#define CANR_MO186_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A740u)

/** \\brief  2744, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO186_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A744u)

/** \\brief  2748, Message Object  Interrupt Pointer Register */
#define CANR_MO186_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A748u)

/** \\brief  276C, Message Object  Acceptance Mask Register */
#define CANR_MO187_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A76Cu)

/** \\brief  2778, Message Object  Arbitration Register */
#define CANR_MO187_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A778u)

/** \\brief  277C, Message Object  Control Register */
#define CANR_MO187_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A77Cu)

/** \\brief  2774, Message Object  Data Register High */
#define CANR_MO187_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A774u)

/** \\brief  2770, Message Object  Data Register Low */
#define CANR_MO187_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A770u)

/** \\brief  2760, Message Object  Function Control Register */
#define CANR_MO187_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A760u)

/** \\brief  2764, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO187_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A764u)

/** \\brief  2768, Message Object  Interrupt Pointer Register */
#define CANR_MO187_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A768u)

/** \\brief  278C, Message Object  Acceptance Mask Register */
#define CANR_MO188_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A78Cu)

/** \\brief  2798, Message Object  Arbitration Register */
#define CANR_MO188_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A798u)

/** \\brief  279C, Message Object  Control Register */
#define CANR_MO188_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A79Cu)

/** \\brief  2794, Message Object  Data Register High */
#define CANR_MO188_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A794u)

/** \\brief  2790, Message Object  Data Register Low */
#define CANR_MO188_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A790u)

/** \\brief  2780, Message Object  Function Control Register */
#define CANR_MO188_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A780u)

/** \\brief  2784, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO188_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A784u)

/** \\brief  2788, Message Object  Interrupt Pointer Register */
#define CANR_MO188_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A788u)

/** \\brief  27AC, Message Object  Acceptance Mask Register */
#define CANR_MO189_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A7ACu)

/** \\brief  27B8, Message Object  Arbitration Register */
#define CANR_MO189_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A7B8u)

/** \\brief  27BC, Message Object  Control Register */
#define CANR_MO189_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A7BCu)

/** \\brief  27B4, Message Object  Data Register High */
#define CANR_MO189_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A7B4u)

/** \\brief  27B0, Message Object  Data Register Low */
#define CANR_MO189_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A7B0u)

/** \\brief  27A0, Message Object  Function Control Register */
#define CANR_MO189_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A7A0u)

/** \\brief  27A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO189_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A7A4u)

/** \\brief  27A8, Message Object  Interrupt Pointer Register */
#define CANR_MO189_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A7A8u)

/** \\brief  124C, Message Object  Acceptance Mask Register */
#define CANR_MO18_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002924Cu)

/** Alias (User Manual Name) for CANR_MO18_AMR.
* To use register names with standard convension, please use CANR_MO18_AMR.
*/
#define	CANR_MOAMR18	(CANR_MO18_AMR)

/** \\brief  1258, Message Object  Arbitration Register */
#define CANR_MO18_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029258u)

/** Alias (User Manual Name) for CANR_MO18_AR.
* To use register names with standard convension, please use CANR_MO18_AR.
*/
#define	CANR_MOAR18	(CANR_MO18_AR)

/** \\brief  125C, Message Object  Control Register */
#define CANR_MO18_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002925Cu)

/** Alias (User Manual Name) for CANR_MO18_CTR_STAT.
* To use register names with standard convension, please use CANR_MO18_CTR_STAT.
*/
#define	CANR_MOCTR18	(CANR_MO18_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO18_CTR_STAT.
* To use register names with standard convension, please use CANR_MO18_CTR_STAT.
*/
#define	CANR_MOSTAT18	(CANR_MO18_CTR_STAT)

/** \\brief  1254, Message Object  Data Register High */
#define CANR_MO18_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029254u)

/** Alias (User Manual Name) for CANR_MO18_DATAH.
* To use register names with standard convension, please use CANR_MO18_DATAH.
*/
#define	CANR_MODATAH18	(CANR_MO18_DATAH)

/** \\brief  1250, Message Object  Data Register Low */
#define CANR_MO18_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029250u)

/** Alias (User Manual Name) for CANR_MO18_DATAL.
* To use register names with standard convension, please use CANR_MO18_DATAL.
*/
#define	CANR_MODATAL18	(CANR_MO18_DATAL)

/** \\brief  1240, Message Object  Function Control Register */
#define CANR_MO18_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029240u)

/** Alias (User Manual Name) for CANR_MO18_FCR.
* To use register names with standard convension, please use CANR_MO18_FCR.
*/
#define	CANR_MOFCR18	(CANR_MO18_FCR)

