keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1244, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO18_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029244u)

/** Alias (User Manual Name) for CANR_MO18_FGPR.
* To use register names with standard convension, please use CANR_MO18_FGPR.
*/
#define	CANR_MOFGPR18	(CANR_MO18_FGPR)

/** \\brief  1248, Message Object  Interrupt Pointer Register */
#define CANR_MO18_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029248u)

/** Alias (User Manual Name) for CANR_MO18_IPR.
* To use register names with standard convension, please use CANR_MO18_IPR.
*/
#define	CANR_MOIPR18	(CANR_MO18_IPR)

/** \\brief  27CC, Message Object  Acceptance Mask Register */
#define CANR_MO190_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A7CCu)

/** \\brief  27D8, Message Object  Arbitration Register */
#define CANR_MO190_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A7D8u)

/** \\brief  27DC, Message Object  Control Register */
#define CANR_MO190_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A7DCu)

/** \\brief  27D4, Message Object  Data Register High */
#define CANR_MO190_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A7D4u)

/** \\brief  27D0, Message Object  Data Register Low */
#define CANR_MO190_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A7D0u)

/** \\brief  27C0, Message Object  Function Control Register */
#define CANR_MO190_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A7C0u)

/** \\brief  27C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO190_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A7C4u)

/** \\brief  27C8, Message Object  Interrupt Pointer Register */
#define CANR_MO190_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A7C8u)

/** \\brief  27EC, Message Object  Acceptance Mask Register */
#define CANR_MO191_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A7ECu)

/** \\brief  27F8, Message Object  Arbitration Register */
#define CANR_MO191_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A7F8u)

/** \\brief  27FC, Message Object  Control Register */
#define CANR_MO191_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A7FCu)

/** \\brief  27F4, Message Object  Data Register High */
#define CANR_MO191_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A7F4u)

/** \\brief  27F0, Message Object  Data Register Low */
#define CANR_MO191_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A7F0u)

/** \\brief  27E0, Message Object  Function Control Register */
#define CANR_MO191_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A7E0u)

/** \\brief  27E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO191_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A7E4u)

/** \\brief  27E8, Message Object  Interrupt Pointer Register */
#define CANR_MO191_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A7E8u)

/** \\brief  280C, Message Object  Acceptance Mask Register */
#define CANR_MO192_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A80Cu)

/** \\brief  2818, Message Object  Arbitration Register */
#define CANR_MO192_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A818u)

/** \\brief  281C, Message Object  Control Register */
#define CANR_MO192_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A81Cu)

/** \\brief  2814, Message Object  Data Register High */
#define CANR_MO192_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A814u)

/** \\brief  2810, Message Object  Data Register Low */
#define CANR_MO192_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A810u)

/** \\brief  2800, Message Object  Function Control Register */
#define CANR_MO192_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A800u)

/** \\brief  2804, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO192_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A804u)

/** \\brief  2808, Message Object  Interrupt Pointer Register */
#define CANR_MO192_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A808u)

/** \\brief  282C, Message Object  Acceptance Mask Register */
#define CANR_MO193_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A82Cu)

/** \\brief  2838, Message Object  Arbitration Register */
#define CANR_MO193_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A838u)

/** \\brief  283C, Message Object  Control Register */
#define CANR_MO193_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A83Cu)

/** \\brief  2834, Message Object  Data Register High */
#define CANR_MO193_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A834u)

/** \\brief  2830, Message Object  Data Register Low */
#define CANR_MO193_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A830u)

/** \\brief  2820, Message Object  Function Control Register */
#define CANR_MO193_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A820u)

/** \\brief  2824, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO193_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A824u)

/** \\brief  2828, Message Object  Interrupt Pointer Register */
#define CANR_MO193_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A828u)

/** \\brief  284C, Message Object  Acceptance Mask Register */
#define CANR_MO194_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A84Cu)

/** \\brief  2858, Message Object  Arbitration Register */
#define CANR_MO194_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A858u)

/** \\brief  285C, Message Object  Control Register */
#define CANR_MO194_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A85Cu)

/** \\brief  2854, Message Object  Data Register High */
#define CANR_MO194_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A854u)

