keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2850, Message Object  Data Register Low */
#define CANR_MO194_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A850u)

/** \\brief  2840, Message Object  Function Control Register */
#define CANR_MO194_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A840u)

/** \\brief  2844, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO194_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A844u)

/** \\brief  2848, Message Object  Interrupt Pointer Register */
#define CANR_MO194_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A848u)

/** \\brief  286C, Message Object  Acceptance Mask Register */
#define CANR_MO195_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A86Cu)

/** \\brief  2878, Message Object  Arbitration Register */
#define CANR_MO195_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A878u)

/** \\brief  287C, Message Object  Control Register */
#define CANR_MO195_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A87Cu)

/** \\brief  2874, Message Object  Data Register High */
#define CANR_MO195_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A874u)

/** \\brief  2870, Message Object  Data Register Low */
#define CANR_MO195_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A870u)

/** \\brief  2860, Message Object  Function Control Register */
#define CANR_MO195_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A860u)

/** \\brief  2864, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO195_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A864u)

/** \\brief  2868, Message Object  Interrupt Pointer Register */
#define CANR_MO195_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A868u)

/** \\brief  288C, Message Object  Acceptance Mask Register */
#define CANR_MO196_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A88Cu)

/** \\brief  2898, Message Object  Arbitration Register */
#define CANR_MO196_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A898u)

/** \\brief  289C, Message Object  Control Register */
#define CANR_MO196_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A89Cu)

/** \\brief  2894, Message Object  Data Register High */
#define CANR_MO196_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A894u)

/** \\brief  2890, Message Object  Data Register Low */
#define CANR_MO196_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A890u)

/** \\brief  2880, Message Object  Function Control Register */
#define CANR_MO196_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A880u)

/** \\brief  2884, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO196_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A884u)

/** \\brief  2888, Message Object  Interrupt Pointer Register */
#define CANR_MO196_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A888u)

/** \\brief  28AC, Message Object  Acceptance Mask Register */
#define CANR_MO197_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A8ACu)

/** \\brief  28B8, Message Object  Arbitration Register */
#define CANR_MO197_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A8B8u)

/** \\brief  28BC, Message Object  Control Register */
#define CANR_MO197_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A8BCu)

/** \\brief  28B4, Message Object  Data Register High */
#define CANR_MO197_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A8B4u)

/** \\brief  28B0, Message Object  Data Register Low */
#define CANR_MO197_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A8B0u)

/** \\brief  28A0, Message Object  Function Control Register */
#define CANR_MO197_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A8A0u)

/** \\brief  28A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO197_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A8A4u)

/** \\brief  28A8, Message Object  Interrupt Pointer Register */
#define CANR_MO197_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A8A8u)

/** \\brief  28CC, Message Object  Acceptance Mask Register */
#define CANR_MO198_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A8CCu)

/** \\brief  28D8, Message Object  Arbitration Register */
#define CANR_MO198_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A8D8u)

/** \\brief  28DC, Message Object  Control Register */
#define CANR_MO198_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A8DCu)

/** \\brief  28D4, Message Object  Data Register High */
#define CANR_MO198_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A8D4u)

/** \\brief  28D0, Message Object  Data Register Low */
#define CANR_MO198_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A8D0u)

/** \\brief  28C0, Message Object  Function Control Register */
#define CANR_MO198_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A8C0u)

/** \\brief  28C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO198_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A8C4u)

/** \\brief  28C8, Message Object  Interrupt Pointer Register */
#define CANR_MO198_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A8C8u)

/** \\brief  28EC, Message Object  Acceptance Mask Register */
#define CANR_MO199_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A8ECu)

/** \\brief  28F8, Message Object  Arbitration Register */
#define CANR_MO199_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A8F8u)

/** \\brief  28FC, Message Object  Control Register */
#define CANR_MO199_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A8FCu)

/** \\brief  28F4, Message Object  Data Register High */
#define CANR_MO199_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A8F4u)

/** \\brief  28F0, Message Object  Data Register Low */
#define CANR_MO199_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A8F0u)

/** \\brief  28E0, Message Object  Function Control Register */
#define CANR_MO199_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A8E0u)

