keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  28E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO199_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A8E4u)

/** \\brief  28E8, Message Object  Interrupt Pointer Register */
#define CANR_MO199_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A8E8u)

/** \\brief  126C, Message Object  Acceptance Mask Register */
#define CANR_MO19_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002926Cu)

/** Alias (User Manual Name) for CANR_MO19_AMR.
* To use register names with standard convension, please use CANR_MO19_AMR.
*/
#define	CANR_MOAMR19	(CANR_MO19_AMR)

/** \\brief  1278, Message Object  Arbitration Register */
#define CANR_MO19_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029278u)

/** Alias (User Manual Name) for CANR_MO19_AR.
* To use register names with standard convension, please use CANR_MO19_AR.
*/
#define	CANR_MOAR19	(CANR_MO19_AR)

/** \\brief  127C, Message Object  Control Register */
#define CANR_MO19_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002927Cu)

/** Alias (User Manual Name) for CANR_MO19_CTR_STAT.
* To use register names with standard convension, please use CANR_MO19_CTR_STAT.
*/
#define	CANR_MOCTR19	(CANR_MO19_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO19_CTR_STAT.
* To use register names with standard convension, please use CANR_MO19_CTR_STAT.
*/
#define	CANR_MOSTAT19	(CANR_MO19_CTR_STAT)

/** \\brief  1274, Message Object  Data Register High */
#define CANR_MO19_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029274u)

/** Alias (User Manual Name) for CANR_MO19_DATAH.
* To use register names with standard convension, please use CANR_MO19_DATAH.
*/
#define	CANR_MODATAH19	(CANR_MO19_DATAH)

/** \\brief  1270, Message Object  Data Register Low */
#define CANR_MO19_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029270u)

/** Alias (User Manual Name) for CANR_MO19_DATAL.
* To use register names with standard convension, please use CANR_MO19_DATAL.
*/
#define	CANR_MODATAL19	(CANR_MO19_DATAL)

/** \\brief  1260, Message Object  Function Control Register */
#define CANR_MO19_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029260u)

/** Alias (User Manual Name) for CANR_MO19_FCR.
* To use register names with standard convension, please use CANR_MO19_FCR.
*/
#define	CANR_MOFCR19	(CANR_MO19_FCR)

/** \\brief  1264, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO19_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029264u)

/** Alias (User Manual Name) for CANR_MO19_FGPR.
* To use register names with standard convension, please use CANR_MO19_FGPR.
*/
#define	CANR_MOFGPR19	(CANR_MO19_FGPR)

/** \\brief  1268, Message Object  Interrupt Pointer Register */
#define CANR_MO19_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029268u)

/** Alias (User Manual Name) for CANR_MO19_IPR.
* To use register names with standard convension, please use CANR_MO19_IPR.
*/
#define	CANR_MOIPR19	(CANR_MO19_IPR)

/** \\brief  102C, Message Object  Acceptance Mask Register */
#define CANR_MO1_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002902Cu)

/** Alias (User Manual Name) for CANR_MO1_AMR.
* To use register names with standard convension, please use CANR_MO1_AMR.
*/
#define	CANR_MOAMR1	(CANR_MO1_AMR)

/** \\brief  1038, Message Object  Arbitration Register */
#define CANR_MO1_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029038u)

/** Alias (User Manual Name) for CANR_MO1_AR.
* To use register names with standard convension, please use CANR_MO1_AR.
*/
#define	CANR_MOAR1	(CANR_MO1_AR)

/** \\brief  103C, Message Object  Control Register */
#define CANR_MO1_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002903Cu)

/** Alias (User Manual Name) for CANR_MO1_CTR_STAT.
* To use register names with standard convension, please use CANR_MO1_CTR_STAT.
*/
#define	CANR_MOSTAT1	(CANR_MO1_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO1_CTR_STAT.
* To use register names with standard convension, please use CANR_MO1_CTR_STAT.
*/
#define	CANR_MOCTR1	(CANR_MO1_CTR_STAT)

/** \\brief  1034, Message Object  Data Register High */
#define CANR_MO1_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029034u)

/** Alias (User Manual Name) for CANR_MO1_DATAH.
* To use register names with standard convension, please use CANR_MO1_DATAH.
*/
#define	CANR_MODATAH1	(CANR_MO1_DATAH)

/** \\brief  1030, Message Object  Data Register Low */
#define CANR_MO1_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029030u)

/** Alias (User Manual Name) for CANR_MO1_DATAL.
* To use register names with standard convension, please use CANR_MO1_DATAL.
*/
#define	CANR_MODATAL1	(CANR_MO1_DATAL)

/** \\brief  1020, Message Object  Function Control Register */
#define CANR_MO1_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029020u)

/** Alias (User Manual Name) for CANR_MO1_FCR.
* To use register names with standard convension, please use CANR_MO1_FCR.
*/
#define	CANR_MOFCR1	(CANR_MO1_FCR)

/** \\brief  1024, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO1_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029024u)

/** Alias (User Manual Name) for CANR_MO1_FGPR.
* To use register names with standard convension, please use CANR_MO1_FGPR.
*/
#define	CANR_MOFGPR1	(CANR_MO1_FGPR)

/** \\brief  1028, Message Object  Interrupt Pointer Register */
#define CANR_MO1_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029028u)

/** Alias (User Manual Name) for CANR_MO1_IPR.
* To use register names with standard convension, please use CANR_MO1_IPR.
*/
#define	CANR_MOIPR1	(CANR_MO1_IPR)

/** \\brief  290C, Message Object  Acceptance Mask Register */
#define CANR_MO200_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A90Cu)

/** \\brief  2918, Message Object  Arbitration Register */
#define CANR_MO200_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A918u)

/** \\brief  291C, Message Object  Control Register */
#define CANR_MO200_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A91Cu)

/** \\brief  2914, Message Object  Data Register High */
#define CANR_MO200_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A914u)

/** \\brief  2910, Message Object  Data Register Low */
#define CANR_MO200_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A910u)

/** \\brief  2900, Message Object  Function Control Register */
#define CANR_MO200_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A900u)

/** \\brief  2904, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO200_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A904u)

/** \\brief  2908, Message Object  Interrupt Pointer Register */
#define CANR_MO200_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A908u)

/** \\brief  292C, Message Object  Acceptance Mask Register */
#define CANR_MO201_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A92Cu)

