keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2938, Message Object  Arbitration Register */
#define CANR_MO201_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A938u)

/** \\brief  293C, Message Object  Control Register */
#define CANR_MO201_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A93Cu)

/** \\brief  2934, Message Object  Data Register High */
#define CANR_MO201_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A934u)

/** \\brief  2930, Message Object  Data Register Low */
#define CANR_MO201_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A930u)

/** \\brief  2920, Message Object  Function Control Register */
#define CANR_MO201_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A920u)

/** \\brief  2924, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO201_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A924u)

/** \\brief  2928, Message Object  Interrupt Pointer Register */
#define CANR_MO201_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A928u)

/** \\brief  294C, Message Object  Acceptance Mask Register */
#define CANR_MO202_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A94Cu)

/** \\brief  2958, Message Object  Arbitration Register */
#define CANR_MO202_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A958u)

/** \\brief  295C, Message Object  Control Register */
#define CANR_MO202_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A95Cu)

/** \\brief  2954, Message Object  Data Register High */
#define CANR_MO202_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A954u)

/** \\brief  2950, Message Object  Data Register Low */
#define CANR_MO202_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A950u)

/** \\brief  2940, Message Object  Function Control Register */
#define CANR_MO202_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A940u)

/** \\brief  2944, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO202_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A944u)

/** \\brief  2948, Message Object  Interrupt Pointer Register */
#define CANR_MO202_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A948u)

/** \\brief  296C, Message Object  Acceptance Mask Register */
#define CANR_MO203_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A96Cu)

/** \\brief  2978, Message Object  Arbitration Register */
#define CANR_MO203_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A978u)

/** \\brief  297C, Message Object  Control Register */
#define CANR_MO203_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A97Cu)

/** \\brief  2974, Message Object  Data Register High */
#define CANR_MO203_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A974u)

/** \\brief  2970, Message Object  Data Register Low */
#define CANR_MO203_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A970u)

/** \\brief  2960, Message Object  Function Control Register */
#define CANR_MO203_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A960u)

/** \\brief  2964, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO203_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A964u)

/** \\brief  2968, Message Object  Interrupt Pointer Register */
#define CANR_MO203_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A968u)

/** \\brief  298C, Message Object  Acceptance Mask Register */
#define CANR_MO204_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A98Cu)

/** \\brief  2998, Message Object  Arbitration Register */
#define CANR_MO204_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A998u)

/** \\brief  299C, Message Object  Control Register */
#define CANR_MO204_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A99Cu)

/** \\brief  2994, Message Object  Data Register High */
#define CANR_MO204_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A994u)

/** \\brief  2990, Message Object  Data Register Low */
#define CANR_MO204_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A990u)

/** \\brief  2980, Message Object  Function Control Register */
#define CANR_MO204_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A980u)

/** \\brief  2984, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO204_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A984u)

/** \\brief  2988, Message Object  Interrupt Pointer Register */
#define CANR_MO204_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A988u)

/** \\brief  29AC, Message Object  Acceptance Mask Register */
#define CANR_MO205_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A9ACu)

/** \\brief  29B8, Message Object  Arbitration Register */
#define CANR_MO205_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A9B8u)

/** \\brief  29BC, Message Object  Control Register */
#define CANR_MO205_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A9BCu)

/** \\brief  29B4, Message Object  Data Register High */
#define CANR_MO205_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A9B4u)

/** \\brief  29B0, Message Object  Data Register Low */
#define CANR_MO205_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A9B0u)

/** \\brief  29A0, Message Object  Function Control Register */
#define CANR_MO205_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A9A0u)

/** \\brief  29A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO205_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A9A4u)

/** \\brief  29A8, Message Object  Interrupt Pointer Register */
#define CANR_MO205_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A9A8u)

/** \\brief  29CC, Message Object  Acceptance Mask Register */
#define CANR_MO206_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A9CCu)

/** \\brief  29D8, Message Object  Arbitration Register */
#define CANR_MO206_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A9D8u)

/** \\brief  29DC, Message Object  Control Register */
#define CANR_MO206_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A9DCu)

