keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  29D4, Message Object  Data Register High */
#define CANR_MO206_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A9D4u)

/** \\brief  29D0, Message Object  Data Register Low */
#define CANR_MO206_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A9D0u)

/** \\brief  29C0, Message Object  Function Control Register */
#define CANR_MO206_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A9C0u)

/** \\brief  29C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO206_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A9C4u)

/** \\brief  29C8, Message Object  Interrupt Pointer Register */
#define CANR_MO206_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A9C8u)

/** \\brief  29EC, Message Object  Acceptance Mask Register */
#define CANR_MO207_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002A9ECu)

/** \\brief  29F8, Message Object  Arbitration Register */
#define CANR_MO207_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002A9F8u)

/** \\brief  29FC, Message Object  Control Register */
#define CANR_MO207_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002A9FCu)

/** \\brief  29F4, Message Object  Data Register High */
#define CANR_MO207_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002A9F4u)

/** \\brief  29F0, Message Object  Data Register Low */
#define CANR_MO207_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002A9F0u)

/** \\brief  29E0, Message Object  Function Control Register */
#define CANR_MO207_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002A9E0u)

/** \\brief  29E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO207_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002A9E4u)

/** \\brief  29E8, Message Object  Interrupt Pointer Register */
#define CANR_MO207_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002A9E8u)

/** \\brief  2A0C, Message Object  Acceptance Mask Register */
#define CANR_MO208_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AA0Cu)

/** \\brief  2A18, Message Object  Arbitration Register */
#define CANR_MO208_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AA18u)

/** \\brief  2A1C, Message Object  Control Register */
#define CANR_MO208_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AA1Cu)

/** \\brief  2A14, Message Object  Data Register High */
#define CANR_MO208_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AA14u)

/** \\brief  2A10, Message Object  Data Register Low */
#define CANR_MO208_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AA10u)

/** \\brief  2A00, Message Object  Function Control Register */
#define CANR_MO208_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AA00u)

/** \\brief  2A04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO208_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AA04u)

/** \\brief  2A08, Message Object  Interrupt Pointer Register */
#define CANR_MO208_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AA08u)

/** \\brief  2A2C, Message Object  Acceptance Mask Register */
#define CANR_MO209_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AA2Cu)

/** \\brief  2A38, Message Object  Arbitration Register */
#define CANR_MO209_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AA38u)

/** \\brief  2A3C, Message Object  Control Register */
#define CANR_MO209_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AA3Cu)

/** \\brief  2A34, Message Object  Data Register High */
#define CANR_MO209_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AA34u)

/** \\brief  2A30, Message Object  Data Register Low */
#define CANR_MO209_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AA30u)

/** \\brief  2A20, Message Object  Function Control Register */
#define CANR_MO209_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AA20u)

/** \\brief  2A24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO209_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AA24u)

/** \\brief  2A28, Message Object  Interrupt Pointer Register */
#define CANR_MO209_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AA28u)

/** \\brief  128C, Message Object  Acceptance Mask Register */
#define CANR_MO20_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002928Cu)

/** Alias (User Manual Name) for CANR_MO20_AMR.
* To use register names with standard convension, please use CANR_MO20_AMR.
*/
#define	CANR_MOAMR20	(CANR_MO20_AMR)

/** \\brief  1298, Message Object  Arbitration Register */
#define CANR_MO20_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029298u)

/** Alias (User Manual Name) for CANR_MO20_AR.
* To use register names with standard convension, please use CANR_MO20_AR.
*/
#define	CANR_MOAR20	(CANR_MO20_AR)

/** \\brief  129C, Message Object  Control Register */
#define CANR_MO20_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002929Cu)

/** Alias (User Manual Name) for CANR_MO20_CTR_STAT.
* To use register names with standard convension, please use CANR_MO20_CTR_STAT.
*/
#define	CANR_MOCTR20	(CANR_MO20_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO20_CTR_STAT.
* To use register names with standard convension, please use CANR_MO20_CTR_STAT.
*/
#define	CANR_MOSTAT20	(CANR_MO20_CTR_STAT)

/** \\brief  1294, Message Object  Data Register High */
#define CANR_MO20_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029294u)

/** Alias (User Manual Name) for CANR_MO20_DATAH.
* To use register names with standard convension, please use CANR_MO20_DATAH.
*/
#define	CANR_MODATAH20	(CANR_MO20_DATAH)

/** \\brief  1290, Message Object  Data Register Low */
#define CANR_MO20_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029290u)

/** Alias (User Manual Name) for CANR_MO20_DATAL.
* To use register names with standard convension, please use CANR_MO20_DATAL.
*/
#define	CANR_MODATAL20	(CANR_MO20_DATAL)

/** \\brief  1280, Message Object  Function Control Register */
#define CANR_MO20_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029280u)

/** Alias (User Manual Name) for CANR_MO20_FCR.
* To use register names with standard convension, please use CANR_MO20_FCR.
*/
#define	CANR_MOFCR20	(CANR_MO20_FCR)

/** \\brief  1284, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO20_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029284u)

/** Alias (User Manual Name) for CANR_MO20_FGPR.
* To use register names with standard convension, please use CANR_MO20_FGPR.
*/
#define	CANR_MOFGPR20	(CANR_MO20_FGPR)

/** \\brief  1288, Message Object  Interrupt Pointer Register */
#define CANR_MO20_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029288u)

