keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO20_IPR.
* To use register names with standard convension, please use CANR_MO20_IPR.
*/
#define	CANR_MOIPR20	(CANR_MO20_IPR)

/** \\brief  2A4C, Message Object  Acceptance Mask Register */
#define CANR_MO210_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AA4Cu)

/** \\brief  2A58, Message Object  Arbitration Register */
#define CANR_MO210_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AA58u)

/** \\brief  2A5C, Message Object  Control Register */
#define CANR_MO210_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AA5Cu)

/** \\brief  2A54, Message Object  Data Register High */
#define CANR_MO210_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AA54u)

/** \\brief  2A50, Message Object  Data Register Low */
#define CANR_MO210_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AA50u)

/** \\brief  2A40, Message Object  Function Control Register */
#define CANR_MO210_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AA40u)

/** \\brief  2A44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO210_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AA44u)

/** \\brief  2A48, Message Object  Interrupt Pointer Register */
#define CANR_MO210_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AA48u)

/** \\brief  2A6C, Message Object  Acceptance Mask Register */
#define CANR_MO211_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AA6Cu)

/** \\brief  2A78, Message Object  Arbitration Register */
#define CANR_MO211_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AA78u)

/** \\brief  2A7C, Message Object  Control Register */
#define CANR_MO211_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AA7Cu)

/** \\brief  2A74, Message Object  Data Register High */
#define CANR_MO211_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AA74u)

/** \\brief  2A70, Message Object  Data Register Low */
#define CANR_MO211_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AA70u)

/** \\brief  2A60, Message Object  Function Control Register */
#define CANR_MO211_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AA60u)

/** \\brief  2A64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO211_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AA64u)

/** \\brief  2A68, Message Object  Interrupt Pointer Register */
#define CANR_MO211_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AA68u)

/** \\brief  2A8C, Message Object  Acceptance Mask Register */
#define CANR_MO212_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AA8Cu)

/** \\brief  2A98, Message Object  Arbitration Register */
#define CANR_MO212_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AA98u)

/** \\brief  2A9C, Message Object  Control Register */
#define CANR_MO212_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AA9Cu)

/** \\brief  2A94, Message Object  Data Register High */
#define CANR_MO212_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AA94u)

/** \\brief  2A90, Message Object  Data Register Low */
#define CANR_MO212_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AA90u)

/** \\brief  2A80, Message Object  Function Control Register */
#define CANR_MO212_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AA80u)

/** \\brief  2A84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO212_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AA84u)

/** \\brief  2A88, Message Object  Interrupt Pointer Register */
#define CANR_MO212_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AA88u)

/** \\brief  2AAC, Message Object  Acceptance Mask Register */
#define CANR_MO213_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AAACu)

/** \\brief  2AB8, Message Object  Arbitration Register */
#define CANR_MO213_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AAB8u)

/** \\brief  2ABC, Message Object  Control Register */
#define CANR_MO213_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AABCu)

/** \\brief  2AB4, Message Object  Data Register High */
#define CANR_MO213_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AAB4u)

/** \\brief  2AB0, Message Object  Data Register Low */
#define CANR_MO213_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AAB0u)

/** \\brief  2AA0, Message Object  Function Control Register */
#define CANR_MO213_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AAA0u)

/** \\brief  2AA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO213_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AAA4u)

/** \\brief  2AA8, Message Object  Interrupt Pointer Register */
#define CANR_MO213_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AAA8u)

/** \\brief  2ACC, Message Object  Acceptance Mask Register */
#define CANR_MO214_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AACCu)

/** \\brief  2AD8, Message Object  Arbitration Register */
#define CANR_MO214_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AAD8u)

/** \\brief  2ADC, Message Object  Control Register */
#define CANR_MO214_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AADCu)

/** \\brief  2AD4, Message Object  Data Register High */
#define CANR_MO214_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AAD4u)

/** \\brief  2AD0, Message Object  Data Register Low */
#define CANR_MO214_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AAD0u)

/** \\brief  2AC0, Message Object  Function Control Register */
#define CANR_MO214_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AAC0u)

/** \\brief  2AC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO214_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AAC4u)

/** \\brief  2AC8, Message Object  Interrupt Pointer Register */
#define CANR_MO214_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AAC8u)

/** \\brief  2AEC, Message Object  Acceptance Mask Register */
#define CANR_MO215_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AAECu)

/** \\brief  2AF8, Message Object  Arbitration Register */
#define CANR_MO215_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AAF8u)

/** \\brief  2AFC, Message Object  Control Register */
#define CANR_MO215_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AAFCu)

/** \\brief  2AF4, Message Object  Data Register High */
#define CANR_MO215_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AAF4u)

/** \\brief  2AF0, Message Object  Data Register Low */
#define CANR_MO215_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AAF0u)

/** \\brief  2AE0, Message Object  Function Control Register */
#define CANR_MO215_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AAE0u)

/** \\brief  2AE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO215_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AAE4u)

/** \\brief  2AE8, Message Object  Interrupt Pointer Register */
#define CANR_MO215_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AAE8u)

/** \\brief  2B0C, Message Object  Acceptance Mask Register */
#define CANR_MO216_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AB0Cu)

/** \\brief  2B18, Message Object  Arbitration Register */
#define CANR_MO216_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AB18u)

/** \\brief  2B1C, Message Object  Control Register */
#define CANR_MO216_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AB1Cu)

