keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2B14, Message Object  Data Register High */
#define CANR_MO216_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AB14u)

/** \\brief  2B10, Message Object  Data Register Low */
#define CANR_MO216_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AB10u)

/** \\brief  2B00, Message Object  Function Control Register */
#define CANR_MO216_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AB00u)

/** \\brief  2B04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO216_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AB04u)

/** \\brief  2B08, Message Object  Interrupt Pointer Register */
#define CANR_MO216_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AB08u)

/** \\brief  2B2C, Message Object  Acceptance Mask Register */
#define CANR_MO217_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AB2Cu)

/** \\brief  2B38, Message Object  Arbitration Register */
#define CANR_MO217_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AB38u)

/** \\brief  2B3C, Message Object  Control Register */
#define CANR_MO217_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AB3Cu)

/** \\brief  2B34, Message Object  Data Register High */
#define CANR_MO217_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AB34u)

/** \\brief  2B30, Message Object  Data Register Low */
#define CANR_MO217_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AB30u)

/** \\brief  2B20, Message Object  Function Control Register */
#define CANR_MO217_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AB20u)

/** \\brief  2B24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO217_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AB24u)

/** \\brief  2B28, Message Object  Interrupt Pointer Register */
#define CANR_MO217_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AB28u)

/** \\brief  2B4C, Message Object  Acceptance Mask Register */
#define CANR_MO218_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AB4Cu)

/** \\brief  2B58, Message Object  Arbitration Register */
#define CANR_MO218_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AB58u)

/** \\brief  2B5C, Message Object  Control Register */
#define CANR_MO218_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AB5Cu)

/** \\brief  2B54, Message Object  Data Register High */
#define CANR_MO218_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AB54u)

/** \\brief  2B50, Message Object  Data Register Low */
#define CANR_MO218_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AB50u)

/** \\brief  2B40, Message Object  Function Control Register */
#define CANR_MO218_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AB40u)

/** \\brief  2B44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO218_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AB44u)

/** \\brief  2B48, Message Object  Interrupt Pointer Register */
#define CANR_MO218_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AB48u)

/** \\brief  2B6C, Message Object  Acceptance Mask Register */
#define CANR_MO219_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AB6Cu)

/** \\brief  2B78, Message Object  Arbitration Register */
#define CANR_MO219_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AB78u)

/** \\brief  2B7C, Message Object  Control Register */
#define CANR_MO219_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AB7Cu)

/** \\brief  2B74, Message Object  Data Register High */
#define CANR_MO219_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AB74u)

/** \\brief  2B70, Message Object  Data Register Low */
#define CANR_MO219_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AB70u)

/** \\brief  2B60, Message Object  Function Control Register */
#define CANR_MO219_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AB60u)

/** \\brief  2B64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO219_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AB64u)

/** \\brief  2B68, Message Object  Interrupt Pointer Register */
#define CANR_MO219_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AB68u)

/** \\brief  12AC, Message Object  Acceptance Mask Register */
#define CANR_MO21_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292ACu)

/** Alias (User Manual Name) for CANR_MO21_AMR.
* To use register names with standard convension, please use CANR_MO21_AMR.
*/
#define	CANR_MOAMR21	(CANR_MO21_AMR)

/** \\brief  12B8, Message Object  Arbitration Register */
#define CANR_MO21_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292B8u)

/** Alias (User Manual Name) for CANR_MO21_AR.
* To use register names with standard convension, please use CANR_MO21_AR.
*/
#define	CANR_MOAR21	(CANR_MO21_AR)

/** \\brief  12BC, Message Object  Control Register */
#define CANR_MO21_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00292BCu)

/** Alias (User Manual Name) for CANR_MO21_CTR_STAT.
* To use register names with standard convension, please use CANR_MO21_CTR_STAT.
*/
#define	CANR_MOCTR21	(CANR_MO21_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO21_CTR_STAT.
* To use register names with standard convension, please use CANR_MO21_CTR_STAT.
*/
#define	CANR_MOSTAT21	(CANR_MO21_CTR_STAT)

/** \\brief  12B4, Message Object  Data Register High */
#define CANR_MO21_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292B4u)

/** Alias (User Manual Name) for CANR_MO21_DATAH.
* To use register names with standard convension, please use CANR_MO21_DATAH.
*/
#define	CANR_MODATAH21	(CANR_MO21_DATAH)

/** \\brief  12B0, Message Object  Data Register Low */
#define CANR_MO21_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292B0u)

/** Alias (User Manual Name) for CANR_MO21_DATAL.
* To use register names with standard convension, please use CANR_MO21_DATAL.
*/
#define	CANR_MODATAL21	(CANR_MO21_DATAL)

