keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  12A0, Message Object  Function Control Register */
#define CANR_MO21_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292A0u)

/** Alias (User Manual Name) for CANR_MO21_FCR.
* To use register names with standard convension, please use CANR_MO21_FCR.
*/
#define	CANR_MOFCR21	(CANR_MO21_FCR)

/** \\brief  12A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO21_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292A4u)

/** Alias (User Manual Name) for CANR_MO21_FGPR.
* To use register names with standard convension, please use CANR_MO21_FGPR.
*/
#define	CANR_MOFGPR21	(CANR_MO21_FGPR)

/** \\brief  12A8, Message Object  Interrupt Pointer Register */
#define CANR_MO21_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292A8u)

/** Alias (User Manual Name) for CANR_MO21_IPR.
* To use register names with standard convension, please use CANR_MO21_IPR.
*/
#define	CANR_MOIPR21	(CANR_MO21_IPR)

/** \\brief  2B8C, Message Object  Acceptance Mask Register */
#define CANR_MO220_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AB8Cu)

/** \\brief  2B98, Message Object  Arbitration Register */
#define CANR_MO220_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AB98u)

/** \\brief  2B9C, Message Object  Control Register */
#define CANR_MO220_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AB9Cu)

/** \\brief  2B94, Message Object  Data Register High */
#define CANR_MO220_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AB94u)

/** \\brief  2B90, Message Object  Data Register Low */
#define CANR_MO220_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AB90u)

/** \\brief  2B80, Message Object  Function Control Register */
#define CANR_MO220_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AB80u)

/** \\brief  2B84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO220_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AB84u)

/** \\brief  2B88, Message Object  Interrupt Pointer Register */
#define CANR_MO220_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AB88u)

/** \\brief  2BAC, Message Object  Acceptance Mask Register */
#define CANR_MO221_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ABACu)

/** \\brief  2BB8, Message Object  Arbitration Register */
#define CANR_MO221_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ABB8u)

/** \\brief  2BBC, Message Object  Control Register */
#define CANR_MO221_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ABBCu)

/** \\brief  2BB4, Message Object  Data Register High */
#define CANR_MO221_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ABB4u)

/** \\brief  2BB0, Message Object  Data Register Low */
#define CANR_MO221_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ABB0u)

/** \\brief  2BA0, Message Object  Function Control Register */
#define CANR_MO221_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ABA0u)

/** \\brief  2BA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO221_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ABA4u)

/** \\brief  2BA8, Message Object  Interrupt Pointer Register */
#define CANR_MO221_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ABA8u)

/** \\brief  2BCC, Message Object  Acceptance Mask Register */
#define CANR_MO222_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ABCCu)

/** \\brief  2BD8, Message Object  Arbitration Register */
#define CANR_MO222_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ABD8u)

/** \\brief  2BDC, Message Object  Control Register */
#define CANR_MO222_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ABDCu)

/** \\brief  2BD4, Message Object  Data Register High */
#define CANR_MO222_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ABD4u)

/** \\brief  2BD0, Message Object  Data Register Low */
#define CANR_MO222_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ABD0u)

/** \\brief  2BC0, Message Object  Function Control Register */
#define CANR_MO222_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ABC0u)

/** \\brief  2BC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO222_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ABC4u)

/** \\brief  2BC8, Message Object  Interrupt Pointer Register */
#define CANR_MO222_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ABC8u)

/** \\brief  2BEC, Message Object  Acceptance Mask Register */
#define CANR_MO223_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ABECu)

/** \\brief  2BF8, Message Object  Arbitration Register */
#define CANR_MO223_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ABF8u)

/** \\brief  2BFC, Message Object  Control Register */
#define CANR_MO223_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ABFCu)

/** \\brief  2BF4, Message Object  Data Register High */
#define CANR_MO223_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ABF4u)

/** \\brief  2BF0, Message Object  Data Register Low */
#define CANR_MO223_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ABF0u)

/** \\brief  2BE0, Message Object  Function Control Register */
#define CANR_MO223_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ABE0u)

/** \\brief  2BE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO223_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ABE4u)

/** \\brief  2BE8, Message Object  Interrupt Pointer Register */
#define CANR_MO223_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ABE8u)

/** \\brief  2C0C, Message Object  Acceptance Mask Register */
#define CANR_MO224_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AC0Cu)

/** \\brief  2C18, Message Object  Arbitration Register */
#define CANR_MO224_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AC18u)

