keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2C1C, Message Object  Control Register */
#define CANR_MO224_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AC1Cu)

/** \\brief  2C14, Message Object  Data Register High */
#define CANR_MO224_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AC14u)

/** \\brief  2C10, Message Object  Data Register Low */
#define CANR_MO224_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AC10u)

/** \\brief  2C00, Message Object  Function Control Register */
#define CANR_MO224_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AC00u)

/** \\brief  2C04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO224_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AC04u)

/** \\brief  2C08, Message Object  Interrupt Pointer Register */
#define CANR_MO224_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AC08u)

/** \\brief  2C2C, Message Object  Acceptance Mask Register */
#define CANR_MO225_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AC2Cu)

/** \\brief  2C38, Message Object  Arbitration Register */
#define CANR_MO225_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AC38u)

/** \\brief  2C3C, Message Object  Control Register */
#define CANR_MO225_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AC3Cu)

/** \\brief  2C34, Message Object  Data Register High */
#define CANR_MO225_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AC34u)

/** \\brief  2C30, Message Object  Data Register Low */
#define CANR_MO225_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AC30u)

/** \\brief  2C20, Message Object  Function Control Register */
#define CANR_MO225_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AC20u)

/** \\brief  2C24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO225_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AC24u)

/** \\brief  2C28, Message Object  Interrupt Pointer Register */
#define CANR_MO225_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AC28u)

/** \\brief  2C4C, Message Object  Acceptance Mask Register */
#define CANR_MO226_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AC4Cu)

/** \\brief  2C58, Message Object  Arbitration Register */
#define CANR_MO226_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AC58u)

/** \\brief  2C5C, Message Object  Control Register */
#define CANR_MO226_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AC5Cu)

/** \\brief  2C54, Message Object  Data Register High */
#define CANR_MO226_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AC54u)

/** \\brief  2C50, Message Object  Data Register Low */
#define CANR_MO226_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AC50u)

/** \\brief  2C40, Message Object  Function Control Register */
#define CANR_MO226_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AC40u)

/** \\brief  2C44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO226_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AC44u)

/** \\brief  2C48, Message Object  Interrupt Pointer Register */
#define CANR_MO226_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AC48u)

/** \\brief  2C6C, Message Object  Acceptance Mask Register */
#define CANR_MO227_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AC6Cu)

/** \\brief  2C78, Message Object  Arbitration Register */
#define CANR_MO227_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AC78u)

/** \\brief  2C7C, Message Object  Control Register */
#define CANR_MO227_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AC7Cu)

/** \\brief  2C74, Message Object  Data Register High */
#define CANR_MO227_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AC74u)

/** \\brief  2C70, Message Object  Data Register Low */
#define CANR_MO227_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AC70u)

/** \\brief  2C60, Message Object  Function Control Register */
#define CANR_MO227_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AC60u)

/** \\brief  2C64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO227_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AC64u)

/** \\brief  2C68, Message Object  Interrupt Pointer Register */
#define CANR_MO227_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AC68u)

/** \\brief  2C8C, Message Object  Acceptance Mask Register */
#define CANR_MO228_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AC8Cu)

/** \\brief  2C98, Message Object  Arbitration Register */
#define CANR_MO228_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AC98u)

/** \\brief  2C9C, Message Object  Control Register */
#define CANR_MO228_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AC9Cu)

/** \\brief  2C94, Message Object  Data Register High */
#define CANR_MO228_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AC94u)

/** \\brief  2C90, Message Object  Data Register Low */
#define CANR_MO228_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AC90u)

/** \\brief  2C80, Message Object  Function Control Register */
#define CANR_MO228_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AC80u)

/** \\brief  2C84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO228_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AC84u)

/** \\brief  2C88, Message Object  Interrupt Pointer Register */
#define CANR_MO228_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AC88u)

/** \\brief  2CAC, Message Object  Acceptance Mask Register */
#define CANR_MO229_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ACACu)

/** \\brief  2CB8, Message Object  Arbitration Register */
#define CANR_MO229_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ACB8u)

/** \\brief  2CBC, Message Object  Control Register */
#define CANR_MO229_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ACBCu)

/** \\brief  2CB4, Message Object  Data Register High */
#define CANR_MO229_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ACB4u)

/** \\brief  2CB0, Message Object  Data Register Low */
#define CANR_MO229_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ACB0u)

