keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2CA0, Message Object  Function Control Register */
#define CANR_MO229_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ACA0u)

/** \\brief  2CA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO229_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ACA4u)

/** \\brief  2CA8, Message Object  Interrupt Pointer Register */
#define CANR_MO229_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ACA8u)

/** \\brief  12CC, Message Object  Acceptance Mask Register */
#define CANR_MO22_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292CCu)

/** Alias (User Manual Name) for CANR_MO22_AMR.
* To use register names with standard convension, please use CANR_MO22_AMR.
*/
#define	CANR_MOAMR22	(CANR_MO22_AMR)

/** \\brief  12D8, Message Object  Arbitration Register */
#define CANR_MO22_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292D8u)

/** Alias (User Manual Name) for CANR_MO22_AR.
* To use register names with standard convension, please use CANR_MO22_AR.
*/
#define	CANR_MOAR22	(CANR_MO22_AR)

/** \\brief  12DC, Message Object  Control Register */
#define CANR_MO22_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00292DCu)

/** Alias (User Manual Name) for CANR_MO22_CTR_STAT.
* To use register names with standard convension, please use CANR_MO22_CTR_STAT.
*/
#define	CANR_MOCTR22	(CANR_MO22_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO22_CTR_STAT.
* To use register names with standard convension, please use CANR_MO22_CTR_STAT.
*/
#define	CANR_MOSTAT22	(CANR_MO22_CTR_STAT)

/** \\brief  12D4, Message Object  Data Register High */
#define CANR_MO22_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292D4u)

/** Alias (User Manual Name) for CANR_MO22_DATAH.
* To use register names with standard convension, please use CANR_MO22_DATAH.
*/
#define	CANR_MODATAH22	(CANR_MO22_DATAH)

/** \\brief  12D0, Message Object  Data Register Low */
#define CANR_MO22_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292D0u)

/** Alias (User Manual Name) for CANR_MO22_DATAL.
* To use register names with standard convension, please use CANR_MO22_DATAL.
*/
#define	CANR_MODATAL22	(CANR_MO22_DATAL)

/** \\brief  12C0, Message Object  Function Control Register */
#define CANR_MO22_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292C0u)

/** Alias (User Manual Name) for CANR_MO22_FCR.
* To use register names with standard convension, please use CANR_MO22_FCR.
*/
#define	CANR_MOFCR22	(CANR_MO22_FCR)

/** \\brief  12C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO22_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292C4u)

/** Alias (User Manual Name) for CANR_MO22_FGPR.
* To use register names with standard convension, please use CANR_MO22_FGPR.
*/
#define	CANR_MOFGPR22	(CANR_MO22_FGPR)

/** \\brief  12C8, Message Object  Interrupt Pointer Register */
#define CANR_MO22_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292C8u)

/** Alias (User Manual Name) for CANR_MO22_IPR.
* To use register names with standard convension, please use CANR_MO22_IPR.
*/
#define	CANR_MOIPR22	(CANR_MO22_IPR)

/** \\brief  2CCC, Message Object  Acceptance Mask Register */
#define CANR_MO230_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ACCCu)

/** \\brief  2CD8, Message Object  Arbitration Register */
#define CANR_MO230_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ACD8u)

/** \\brief  2CDC, Message Object  Control Register */
#define CANR_MO230_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ACDCu)

/** \\brief  2CD4, Message Object  Data Register High */
#define CANR_MO230_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ACD4u)

/** \\brief  2CD0, Message Object  Data Register Low */
#define CANR_MO230_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ACD0u)

/** \\brief  2CC0, Message Object  Function Control Register */
#define CANR_MO230_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ACC0u)

/** \\brief  2CC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO230_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ACC4u)

/** \\brief  2CC8, Message Object  Interrupt Pointer Register */
#define CANR_MO230_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ACC8u)

/** \\brief  2CEC, Message Object  Acceptance Mask Register */
#define CANR_MO231_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ACECu)

/** \\brief  2CF8, Message Object  Arbitration Register */
#define CANR_MO231_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ACF8u)

/** \\brief  2CFC, Message Object  Control Register */
#define CANR_MO231_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ACFCu)

/** \\brief  2CF4, Message Object  Data Register High */
#define CANR_MO231_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ACF4u)

/** \\brief  2CF0, Message Object  Data Register Low */
#define CANR_MO231_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ACF0u)

/** \\brief  2CE0, Message Object  Function Control Register */
#define CANR_MO231_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ACE0u)

/** \\brief  2CE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO231_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ACE4u)

/** \\brief  2CE8, Message Object  Interrupt Pointer Register */
#define CANR_MO231_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ACE8u)

/** \\brief  2D0C, Message Object  Acceptance Mask Register */
#define CANR_MO232_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AD0Cu)

/** \\brief  2D18, Message Object  Arbitration Register */
#define CANR_MO232_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AD18u)

/** \\brief  2D1C, Message Object  Control Register */
#define CANR_MO232_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AD1Cu)

/** \\brief  2D14, Message Object  Data Register High */
#define CANR_MO232_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AD14u)

