keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2D10, Message Object  Data Register Low */
#define CANR_MO232_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AD10u)

/** \\brief  2D00, Message Object  Function Control Register */
#define CANR_MO232_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AD00u)

/** \\brief  2D04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO232_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AD04u)

/** \\brief  2D08, Message Object  Interrupt Pointer Register */
#define CANR_MO232_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AD08u)

/** \\brief  2D2C, Message Object  Acceptance Mask Register */
#define CANR_MO233_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AD2Cu)

/** \\brief  2D38, Message Object  Arbitration Register */
#define CANR_MO233_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AD38u)

/** \\brief  2D3C, Message Object  Control Register */
#define CANR_MO233_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AD3Cu)

/** \\brief  2D34, Message Object  Data Register High */
#define CANR_MO233_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AD34u)

/** \\brief  2D30, Message Object  Data Register Low */
#define CANR_MO233_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AD30u)

/** \\brief  2D20, Message Object  Function Control Register */
#define CANR_MO233_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AD20u)

/** \\brief  2D24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO233_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AD24u)

/** \\brief  2D28, Message Object  Interrupt Pointer Register */
#define CANR_MO233_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AD28u)

/** \\brief  2D4C, Message Object  Acceptance Mask Register */
#define CANR_MO234_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AD4Cu)

/** \\brief  2D58, Message Object  Arbitration Register */
#define CANR_MO234_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AD58u)

/** \\brief  2D5C, Message Object  Control Register */
#define CANR_MO234_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AD5Cu)

/** \\brief  2D54, Message Object  Data Register High */
#define CANR_MO234_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AD54u)

/** \\brief  2D50, Message Object  Data Register Low */
#define CANR_MO234_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AD50u)

/** \\brief  2D40, Message Object  Function Control Register */
#define CANR_MO234_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AD40u)

/** \\brief  2D44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO234_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AD44u)

/** \\brief  2D48, Message Object  Interrupt Pointer Register */
#define CANR_MO234_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AD48u)

/** \\brief  2D6C, Message Object  Acceptance Mask Register */
#define CANR_MO235_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AD6Cu)

/** \\brief  2D78, Message Object  Arbitration Register */
#define CANR_MO235_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AD78u)

/** \\brief  2D7C, Message Object  Control Register */
#define CANR_MO235_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AD7Cu)

/** \\brief  2D74, Message Object  Data Register High */
#define CANR_MO235_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AD74u)

/** \\brief  2D70, Message Object  Data Register Low */
#define CANR_MO235_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AD70u)

/** \\brief  2D60, Message Object  Function Control Register */
#define CANR_MO235_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AD60u)

/** \\brief  2D64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO235_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AD64u)

/** \\brief  2D68, Message Object  Interrupt Pointer Register */
#define CANR_MO235_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AD68u)

/** \\brief  2D8C, Message Object  Acceptance Mask Register */
#define CANR_MO236_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AD8Cu)

/** \\brief  2D98, Message Object  Arbitration Register */
#define CANR_MO236_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AD98u)

/** \\brief  2D9C, Message Object  Control Register */
#define CANR_MO236_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AD9Cu)

/** \\brief  2D94, Message Object  Data Register High */
#define CANR_MO236_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AD94u)

/** \\brief  2D90, Message Object  Data Register Low */
#define CANR_MO236_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AD90u)

/** \\brief  2D80, Message Object  Function Control Register */
#define CANR_MO236_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AD80u)

/** \\brief  2D84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO236_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AD84u)

/** \\brief  2D88, Message Object  Interrupt Pointer Register */
#define CANR_MO236_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AD88u)

/** \\brief  2DAC, Message Object  Acceptance Mask Register */
#define CANR_MO237_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ADACu)

/** \\brief  2DB8, Message Object  Arbitration Register */
#define CANR_MO237_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ADB8u)

/** \\brief  2DBC, Message Object  Control Register */
#define CANR_MO237_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ADBCu)

/** \\brief  2DB4, Message Object  Data Register High */
#define CANR_MO237_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ADB4u)

/** \\brief  2DB0, Message Object  Data Register Low */
#define CANR_MO237_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ADB0u)

/** \\brief  2DA0, Message Object  Function Control Register */
#define CANR_MO237_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ADA0u)

