keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2DA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO237_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ADA4u)

/** \\brief  2DA8, Message Object  Interrupt Pointer Register */
#define CANR_MO237_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ADA8u)

/** \\brief  2DCC, Message Object  Acceptance Mask Register */
#define CANR_MO238_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ADCCu)

/** \\brief  2DD8, Message Object  Arbitration Register */
#define CANR_MO238_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ADD8u)

/** \\brief  2DDC, Message Object  Control Register */
#define CANR_MO238_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ADDCu)

/** \\brief  2DD4, Message Object  Data Register High */
#define CANR_MO238_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ADD4u)

/** \\brief  2DD0, Message Object  Data Register Low */
#define CANR_MO238_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ADD0u)

/** \\brief  2DC0, Message Object  Function Control Register */
#define CANR_MO238_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ADC0u)

/** \\brief  2DC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO238_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ADC4u)

/** \\brief  2DC8, Message Object  Interrupt Pointer Register */
#define CANR_MO238_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ADC8u)

/** \\brief  2DEC, Message Object  Acceptance Mask Register */
#define CANR_MO239_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002ADECu)

/** \\brief  2DF8, Message Object  Arbitration Register */
#define CANR_MO239_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002ADF8u)

/** \\brief  2DFC, Message Object  Control Register */
#define CANR_MO239_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002ADFCu)

/** \\brief  2DF4, Message Object  Data Register High */
#define CANR_MO239_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002ADF4u)

/** \\brief  2DF0, Message Object  Data Register Low */
#define CANR_MO239_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002ADF0u)

/** \\brief  2DE0, Message Object  Function Control Register */
#define CANR_MO239_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002ADE0u)

/** \\brief  2DE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO239_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002ADE4u)

/** \\brief  2DE8, Message Object  Interrupt Pointer Register */
#define CANR_MO239_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002ADE8u)

/** \\brief  12EC, Message Object  Acceptance Mask Register */
#define CANR_MO23_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00292ECu)

/** Alias (User Manual Name) for CANR_MO23_AMR.
* To use register names with standard convension, please use CANR_MO23_AMR.
*/
#define	CANR_MOAMR23	(CANR_MO23_AMR)

/** \\brief  12F8, Message Object  Arbitration Register */
#define CANR_MO23_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00292F8u)

/** Alias (User Manual Name) for CANR_MO23_AR.
* To use register names with standard convension, please use CANR_MO23_AR.
*/
#define	CANR_MOAR23	(CANR_MO23_AR)

/** \\brief  12FC, Message Object  Control Register */
#define CANR_MO23_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00292FCu)

/** Alias (User Manual Name) for CANR_MO23_CTR_STAT.
* To use register names with standard convension, please use CANR_MO23_CTR_STAT.
*/
#define	CANR_MOCTR23	(CANR_MO23_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO23_CTR_STAT.
* To use register names with standard convension, please use CANR_MO23_CTR_STAT.
*/
#define	CANR_MOSTAT23	(CANR_MO23_CTR_STAT)

/** \\brief  12F4, Message Object  Data Register High */
#define CANR_MO23_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00292F4u)

/** Alias (User Manual Name) for CANR_MO23_DATAH.
* To use register names with standard convension, please use CANR_MO23_DATAH.
*/
#define	CANR_MODATAH23	(CANR_MO23_DATAH)

/** \\brief  12F0, Message Object  Data Register Low */
#define CANR_MO23_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00292F0u)

/** Alias (User Manual Name) for CANR_MO23_DATAL.
* To use register names with standard convension, please use CANR_MO23_DATAL.
*/
#define	CANR_MODATAL23	(CANR_MO23_DATAL)

/** \\brief  12E0, Message Object  Function Control Register */
#define CANR_MO23_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00292E0u)

/** Alias (User Manual Name) for CANR_MO23_FCR.
* To use register names with standard convension, please use CANR_MO23_FCR.
*/
#define	CANR_MOFCR23	(CANR_MO23_FCR)

/** \\brief  12E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO23_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00292E4u)

/** Alias (User Manual Name) for CANR_MO23_FGPR.
* To use register names with standard convension, please use CANR_MO23_FGPR.
*/
#define	CANR_MOFGPR23	(CANR_MO23_FGPR)

/** \\brief  12E8, Message Object  Interrupt Pointer Register */
#define CANR_MO23_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00292E8u)

/** Alias (User Manual Name) for CANR_MO23_IPR.
* To use register names with standard convension, please use CANR_MO23_IPR.
*/
#define	CANR_MOIPR23	(CANR_MO23_IPR)

/** \\brief  2E0C, Message Object  Acceptance Mask Register */
#define CANR_MO240_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AE0Cu)

/** \\brief  2E18, Message Object  Arbitration Register */
#define CANR_MO240_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AE18u)

/** \\brief  2E1C, Message Object  Control Register */
#define CANR_MO240_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AE1Cu)

/** \\brief  2E14, Message Object  Data Register High */
#define CANR_MO240_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AE14u)

/** \\brief  2E10, Message Object  Data Register Low */
#define CANR_MO240_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AE10u)

/** \\brief  2E00, Message Object  Function Control Register */
#define CANR_MO240_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AE00u)

/** \\brief  2E04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO240_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AE04u)

/** \\brief  2E08, Message Object  Interrupt Pointer Register */
#define CANR_MO240_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AE08u)

/** \\brief  2E2C, Message Object  Acceptance Mask Register */
#define CANR_MO241_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AE2Cu)

/** \\brief  2E38, Message Object  Arbitration Register */
#define CANR_MO241_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AE38u)

/** \\brief  2E3C, Message Object  Control Register */
#define CANR_MO241_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AE3Cu)

/** \\brief  2E34, Message Object  Data Register High */
#define CANR_MO241_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AE34u)

/** \\brief  2E30, Message Object  Data Register Low */
#define CANR_MO241_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AE30u)

/** \\brief  2E20, Message Object  Function Control Register */
#define CANR_MO241_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AE20u)

/** \\brief  2E24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO241_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AE24u)

/** \\brief  2E28, Message Object  Interrupt Pointer Register */
#define CANR_MO241_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AE28u)

