keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2E4C, Message Object  Acceptance Mask Register */
#define CANR_MO242_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AE4Cu)

/** \\brief  2E58, Message Object  Arbitration Register */
#define CANR_MO242_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AE58u)

/** \\brief  2E5C, Message Object  Control Register */
#define CANR_MO242_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AE5Cu)

/** \\brief  2E54, Message Object  Data Register High */
#define CANR_MO242_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AE54u)

/** \\brief  2E50, Message Object  Data Register Low */
#define CANR_MO242_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AE50u)

/** \\brief  2E40, Message Object  Function Control Register */
#define CANR_MO242_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AE40u)

/** \\brief  2E44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO242_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AE44u)

/** \\brief  2E48, Message Object  Interrupt Pointer Register */
#define CANR_MO242_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AE48u)

/** \\brief  2E6C, Message Object  Acceptance Mask Register */
#define CANR_MO243_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AE6Cu)

/** \\brief  2E78, Message Object  Arbitration Register */
#define CANR_MO243_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AE78u)

/** \\brief  2E7C, Message Object  Control Register */
#define CANR_MO243_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AE7Cu)

/** \\brief  2E74, Message Object  Data Register High */
#define CANR_MO243_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AE74u)

/** \\brief  2E70, Message Object  Data Register Low */
#define CANR_MO243_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AE70u)

/** \\brief  2E60, Message Object  Function Control Register */
#define CANR_MO243_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AE60u)

/** \\brief  2E64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO243_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AE64u)

/** \\brief  2E68, Message Object  Interrupt Pointer Register */
#define CANR_MO243_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AE68u)

/** \\brief  2E8C, Message Object  Acceptance Mask Register */
#define CANR_MO244_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AE8Cu)

/** \\brief  2E98, Message Object  Arbitration Register */
#define CANR_MO244_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AE98u)

/** \\brief  2E9C, Message Object  Control Register */
#define CANR_MO244_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AE9Cu)

/** \\brief  2E94, Message Object  Data Register High */
#define CANR_MO244_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AE94u)

/** \\brief  2E90, Message Object  Data Register Low */
#define CANR_MO244_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AE90u)

/** \\brief  2E80, Message Object  Function Control Register */
#define CANR_MO244_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AE80u)

/** \\brief  2E84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO244_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AE84u)

/** \\brief  2E88, Message Object  Interrupt Pointer Register */
#define CANR_MO244_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AE88u)

/** \\brief  2EAC, Message Object  Acceptance Mask Register */
#define CANR_MO245_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AEACu)

/** \\brief  2EB8, Message Object  Arbitration Register */
#define CANR_MO245_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AEB8u)

/** \\brief  2EBC, Message Object  Control Register */
#define CANR_MO245_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AEBCu)

/** \\brief  2EB4, Message Object  Data Register High */
#define CANR_MO245_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AEB4u)

/** \\brief  2EB0, Message Object  Data Register Low */
#define CANR_MO245_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AEB0u)

/** \\brief  2EA0, Message Object  Function Control Register */
#define CANR_MO245_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AEA0u)

/** \\brief  2EA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO245_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AEA4u)

/** \\brief  2EA8, Message Object  Interrupt Pointer Register */
#define CANR_MO245_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AEA8u)

/** \\brief  2ECC, Message Object  Acceptance Mask Register */
#define CANR_MO246_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AECCu)

/** \\brief  2ED8, Message Object  Arbitration Register */
#define CANR_MO246_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AED8u)

/** \\brief  2EDC, Message Object  Control Register */
#define CANR_MO246_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AEDCu)

/** \\brief  2ED4, Message Object  Data Register High */
#define CANR_MO246_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AED4u)

/** \\brief  2ED0, Message Object  Data Register Low */
#define CANR_MO246_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AED0u)

/** \\brief  2EC0, Message Object  Function Control Register */
#define CANR_MO246_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AEC0u)

/** \\brief  2EC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO246_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AEC4u)

/** \\brief  2EC8, Message Object  Interrupt Pointer Register */
#define CANR_MO246_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AEC8u)

/** \\brief  2EEC, Message Object  Acceptance Mask Register */
#define CANR_MO247_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AEECu)

/** \\brief  2EF8, Message Object  Arbitration Register */
#define CANR_MO247_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AEF8u)

