keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2EFC, Message Object  Control Register */
#define CANR_MO247_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AEFCu)

/** \\brief  2EF4, Message Object  Data Register High */
#define CANR_MO247_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AEF4u)

/** \\brief  2EF0, Message Object  Data Register Low */
#define CANR_MO247_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AEF0u)

/** \\brief  2EE0, Message Object  Function Control Register */
#define CANR_MO247_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AEE0u)

/** \\brief  2EE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO247_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AEE4u)

/** \\brief  2EE8, Message Object  Interrupt Pointer Register */
#define CANR_MO247_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AEE8u)

/** \\brief  2F0C, Message Object  Acceptance Mask Register */
#define CANR_MO248_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AF0Cu)

/** \\brief  2F18, Message Object  Arbitration Register */
#define CANR_MO248_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AF18u)

/** \\brief  2F1C, Message Object  Control Register */
#define CANR_MO248_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AF1Cu)

/** \\brief  2F14, Message Object  Data Register High */
#define CANR_MO248_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AF14u)

/** \\brief  2F10, Message Object  Data Register Low */
#define CANR_MO248_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AF10u)

/** \\brief  2F00, Message Object  Function Control Register */
#define CANR_MO248_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AF00u)

/** \\brief  2F04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO248_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AF04u)

/** \\brief  2F08, Message Object  Interrupt Pointer Register */
#define CANR_MO248_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AF08u)

/** \\brief  2F2C, Message Object  Acceptance Mask Register */
#define CANR_MO249_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AF2Cu)

/** \\brief  2F38, Message Object  Arbitration Register */
#define CANR_MO249_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AF38u)

/** \\brief  2F3C, Message Object  Control Register */
#define CANR_MO249_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AF3Cu)

/** \\brief  2F34, Message Object  Data Register High */
#define CANR_MO249_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AF34u)

/** \\brief  2F30, Message Object  Data Register Low */
#define CANR_MO249_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AF30u)

/** \\brief  2F20, Message Object  Function Control Register */
#define CANR_MO249_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AF20u)

/** \\brief  2F24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO249_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AF24u)

/** \\brief  2F28, Message Object  Interrupt Pointer Register */
#define CANR_MO249_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AF28u)

/** \\brief  130C, Message Object  Acceptance Mask Register */
#define CANR_MO24_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002930Cu)

/** Alias (User Manual Name) for CANR_MO24_AMR.
* To use register names with standard convension, please use CANR_MO24_AMR.
*/
#define	CANR_MOAMR24	(CANR_MO24_AMR)

/** \\brief  1318, Message Object  Arbitration Register */
#define CANR_MO24_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029318u)

/** Alias (User Manual Name) for CANR_MO24_AR.
* To use register names with standard convension, please use CANR_MO24_AR.
*/
#define	CANR_MOAR24	(CANR_MO24_AR)

/** \\brief  131C, Message Object  Control Register */
#define CANR_MO24_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002931Cu)

/** Alias (User Manual Name) for CANR_MO24_CTR_STAT.
* To use register names with standard convension, please use CANR_MO24_CTR_STAT.
*/
#define	CANR_MOCTR24	(CANR_MO24_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO24_CTR_STAT.
* To use register names with standard convension, please use CANR_MO24_CTR_STAT.
*/
#define	CANR_MOSTAT24	(CANR_MO24_CTR_STAT)

/** \\brief  1314, Message Object  Data Register High */
#define CANR_MO24_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029314u)

/** Alias (User Manual Name) for CANR_MO24_DATAH.
* To use register names with standard convension, please use CANR_MO24_DATAH.
*/
#define	CANR_MODATAH24	(CANR_MO24_DATAH)

/** \\brief  1310, Message Object  Data Register Low */
#define CANR_MO24_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029310u)

/** Alias (User Manual Name) for CANR_MO24_DATAL.
* To use register names with standard convension, please use CANR_MO24_DATAL.
*/
#define	CANR_MODATAL24	(CANR_MO24_DATAL)

/** \\brief  1300, Message Object  Function Control Register */
#define CANR_MO24_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029300u)

/** Alias (User Manual Name) for CANR_MO24_FCR.
* To use register names with standard convension, please use CANR_MO24_FCR.
*/
#define	CANR_MOFCR24	(CANR_MO24_FCR)

/** \\brief  1304, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO24_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029304u)

/** Alias (User Manual Name) for CANR_MO24_FGPR.
* To use register names with standard convension, please use CANR_MO24_FGPR.
*/
#define	CANR_MOFGPR24	(CANR_MO24_FGPR)

/** \\brief  1308, Message Object  Interrupt Pointer Register */
#define CANR_MO24_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029308u)

/** Alias (User Manual Name) for CANR_MO24_IPR.
* To use register names with standard convension, please use CANR_MO24_IPR.
*/
#define	CANR_MOIPR24	(CANR_MO24_IPR)

