keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2F4C, Message Object  Acceptance Mask Register */
#define CANR_MO250_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AF4Cu)

/** \\brief  2F58, Message Object  Arbitration Register */
#define CANR_MO250_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AF58u)

/** \\brief  2F5C, Message Object  Control Register */
#define CANR_MO250_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AF5Cu)

/** \\brief  2F54, Message Object  Data Register High */
#define CANR_MO250_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AF54u)

/** \\brief  2F50, Message Object  Data Register Low */
#define CANR_MO250_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AF50u)

/** \\brief  2F40, Message Object  Function Control Register */
#define CANR_MO250_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AF40u)

/** \\brief  2F44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO250_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AF44u)

/** \\brief  2F48, Message Object  Interrupt Pointer Register */
#define CANR_MO250_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AF48u)

/** \\brief  2F6C, Message Object  Acceptance Mask Register */
#define CANR_MO251_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AF6Cu)

/** \\brief  2F78, Message Object  Arbitration Register */
#define CANR_MO251_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AF78u)

/** \\brief  2F7C, Message Object  Control Register */
#define CANR_MO251_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AF7Cu)

/** \\brief  2F74, Message Object  Data Register High */
#define CANR_MO251_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AF74u)

/** \\brief  2F70, Message Object  Data Register Low */
#define CANR_MO251_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AF70u)

/** \\brief  2F60, Message Object  Function Control Register */
#define CANR_MO251_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AF60u)

/** \\brief  2F64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO251_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AF64u)

/** \\brief  2F68, Message Object  Interrupt Pointer Register */
#define CANR_MO251_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AF68u)

/** \\brief  2F8C, Message Object  Acceptance Mask Register */
#define CANR_MO252_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AF8Cu)

/** \\brief  2F98, Message Object  Arbitration Register */
#define CANR_MO252_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AF98u)

/** \\brief  2F9C, Message Object  Control Register */
#define CANR_MO252_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AF9Cu)

/** \\brief  2F94, Message Object  Data Register High */
#define CANR_MO252_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AF94u)

/** \\brief  2F90, Message Object  Data Register Low */
#define CANR_MO252_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AF90u)

/** \\brief  2F80, Message Object  Function Control Register */
#define CANR_MO252_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AF80u)

/** \\brief  2F84, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO252_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AF84u)

/** \\brief  2F88, Message Object  Interrupt Pointer Register */
#define CANR_MO252_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AF88u)

/** \\brief  2FAC, Message Object  Acceptance Mask Register */
#define CANR_MO253_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AFACu)

/** \\brief  2FB8, Message Object  Arbitration Register */
#define CANR_MO253_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AFB8u)

/** \\brief  2FBC, Message Object  Control Register */
#define CANR_MO253_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AFBCu)

/** \\brief  2FB4, Message Object  Data Register High */
#define CANR_MO253_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AFB4u)

/** \\brief  2FB0, Message Object  Data Register Low */
#define CANR_MO253_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AFB0u)

/** \\brief  2FA0, Message Object  Function Control Register */
#define CANR_MO253_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AFA0u)

/** \\brief  2FA4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO253_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AFA4u)

/** \\brief  2FA8, Message Object  Interrupt Pointer Register */
#define CANR_MO253_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AFA8u)

/** \\brief  2FCC, Message Object  Acceptance Mask Register */
#define CANR_MO254_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AFCCu)

/** \\brief  2FD8, Message Object  Arbitration Register */
#define CANR_MO254_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AFD8u)

/** \\brief  2FDC, Message Object  Control Register */
#define CANR_MO254_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AFDCu)

/** \\brief  2FD4, Message Object  Data Register High */
#define CANR_MO254_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AFD4u)

/** \\brief  2FD0, Message Object  Data Register Low */
#define CANR_MO254_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AFD0u)

/** \\brief  2FC0, Message Object  Function Control Register */
#define CANR_MO254_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AFC0u)

/** \\brief  2FC4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO254_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AFC4u)

/** \\brief  2FC8, Message Object  Interrupt Pointer Register */
#define CANR_MO254_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AFC8u)

/** \\brief  2FEC, Message Object  Acceptance Mask Register */
#define CANR_MO255_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002AFECu)

/** \\brief  2FF8, Message Object  Arbitration Register */
#define CANR_MO255_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF002AFF8u)

