keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  2FFC, Message Object  Control Register */
#define CANR_MO255_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002AFFCu)

/** \\brief  2FF4, Message Object  Data Register High */
#define CANR_MO255_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF002AFF4u)

/** \\brief  2FF0, Message Object  Data Register Low */
#define CANR_MO255_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF002AFF0u)

/** \\brief  2FE0, Message Object  Function Control Register */
#define CANR_MO255_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF002AFE0u)

/** \\brief  2FE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO255_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF002AFE4u)

/** \\brief  2FE8, Message Object  Interrupt Pointer Register */
#define CANR_MO255_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF002AFE8u)

/** \\brief  132C, Message Object  Acceptance Mask Register */
#define CANR_MO25_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002932Cu)

/** Alias (User Manual Name) for CANR_MO25_AMR.
* To use register names with standard convension, please use CANR_MO25_AMR.
*/
#define	CANR_MOAMR25	(CANR_MO25_AMR)

/** \\brief  1338, Message Object  Arbitration Register */
#define CANR_MO25_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029338u)

/** Alias (User Manual Name) for CANR_MO25_AR.
* To use register names with standard convension, please use CANR_MO25_AR.
*/
#define	CANR_MOAR25	(CANR_MO25_AR)

/** \\brief  133C, Message Object  Control Register */
#define CANR_MO25_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002933Cu)

/** Alias (User Manual Name) for CANR_MO25_CTR_STAT.
* To use register names with standard convension, please use CANR_MO25_CTR_STAT.
*/
#define	CANR_MOCTR25	(CANR_MO25_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO25_CTR_STAT.
* To use register names with standard convension, please use CANR_MO25_CTR_STAT.
*/
#define	CANR_MOSTAT25	(CANR_MO25_CTR_STAT)

/** \\brief  1334, Message Object  Data Register High */
#define CANR_MO25_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029334u)

/** Alias (User Manual Name) for CANR_MO25_DATAH.
* To use register names with standard convension, please use CANR_MO25_DATAH.
*/
#define	CANR_MODATAH25	(CANR_MO25_DATAH)

/** \\brief  1330, Message Object  Data Register Low */
#define CANR_MO25_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029330u)

/** Alias (User Manual Name) for CANR_MO25_DATAL.
* To use register names with standard convension, please use CANR_MO25_DATAL.
*/
#define	CANR_MODATAL25	(CANR_MO25_DATAL)

/** \\brief  1320, Message Object  Function Control Register */
#define CANR_MO25_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029320u)

/** Alias (User Manual Name) for CANR_MO25_FCR.
* To use register names with standard convension, please use CANR_MO25_FCR.
*/
#define	CANR_MOFCR25	(CANR_MO25_FCR)

/** \\brief  1324, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO25_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029324u)

/** Alias (User Manual Name) for CANR_MO25_FGPR.
* To use register names with standard convension, please use CANR_MO25_FGPR.
*/
#define	CANR_MOFGPR25	(CANR_MO25_FGPR)

/** \\brief  1328, Message Object  Interrupt Pointer Register */
#define CANR_MO25_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029328u)

/** Alias (User Manual Name) for CANR_MO25_IPR.
* To use register names with standard convension, please use CANR_MO25_IPR.
*/
#define	CANR_MOIPR25	(CANR_MO25_IPR)

/** \\brief  134C, Message Object  Acceptance Mask Register */
#define CANR_MO26_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002934Cu)

/** Alias (User Manual Name) for CANR_MO26_AMR.
* To use register names with standard convension, please use CANR_MO26_AMR.
*/
#define	CANR_MOAMR26	(CANR_MO26_AMR)

/** \\brief  1358, Message Object  Arbitration Register */
#define CANR_MO26_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029358u)

/** Alias (User Manual Name) for CANR_MO26_AR.
* To use register names with standard convension, please use CANR_MO26_AR.
*/
#define	CANR_MOAR26	(CANR_MO26_AR)

/** \\brief  135C, Message Object  Control Register */
#define CANR_MO26_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002935Cu)

/** Alias (User Manual Name) for CANR_MO26_CTR_STAT.
* To use register names with standard convension, please use CANR_MO26_CTR_STAT.
*/
#define	CANR_MOCTR26	(CANR_MO26_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO26_CTR_STAT.
* To use register names with standard convension, please use CANR_MO26_CTR_STAT.
*/
#define	CANR_MOSTAT26	(CANR_MO26_CTR_STAT)

/** \\brief  1354, Message Object  Data Register High */
#define CANR_MO26_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029354u)

/** Alias (User Manual Name) for CANR_MO26_DATAH.
* To use register names with standard convension, please use CANR_MO26_DATAH.
*/
#define	CANR_MODATAH26	(CANR_MO26_DATAH)

/** \\brief  1350, Message Object  Data Register Low */
#define CANR_MO26_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029350u)

/** Alias (User Manual Name) for CANR_MO26_DATAL.
* To use register names with standard convension, please use CANR_MO26_DATAL.
*/
#define	CANR_MODATAL26	(CANR_MO26_DATAL)

/** \\brief  1340, Message Object  Function Control Register */
#define CANR_MO26_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029340u)

/** Alias (User Manual Name) for CANR_MO26_FCR.
* To use register names with standard convension, please use CANR_MO26_FCR.
*/
#define	CANR_MOFCR26	(CANR_MO26_FCR)

/** \\brief  1344, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO26_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029344u)

/** Alias (User Manual Name) for CANR_MO26_FGPR.
* To use register names with standard convension, please use CANR_MO26_FGPR.
*/
#define	CANR_MOFGPR26	(CANR_MO26_FGPR)

/** \\brief  1348, Message Object  Interrupt Pointer Register */
#define CANR_MO26_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029348u)

/** Alias (User Manual Name) for CANR_MO26_IPR.
* To use register names with standard convension, please use CANR_MO26_IPR.
*/
#define	CANR_MOIPR26	(CANR_MO26_IPR)

/** \\brief  136C, Message Object  Acceptance Mask Register */
#define CANR_MO27_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002936Cu)

