keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO27_AMR.
* To use register names with standard convension, please use CANR_MO27_AMR.
*/
#define	CANR_MOAMR27	(CANR_MO27_AMR)

/** \\brief  1378, Message Object  Arbitration Register */
#define CANR_MO27_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029378u)

/** Alias (User Manual Name) for CANR_MO27_AR.
* To use register names with standard convension, please use CANR_MO27_AR.
*/
#define	CANR_MOAR27	(CANR_MO27_AR)

/** \\brief  137C, Message Object  Control Register */
#define CANR_MO27_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002937Cu)

/** Alias (User Manual Name) for CANR_MO27_CTR_STAT.
* To use register names with standard convension, please use CANR_MO27_CTR_STAT.
*/
#define	CANR_MOCTR27	(CANR_MO27_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO27_CTR_STAT.
* To use register names with standard convension, please use CANR_MO27_CTR_STAT.
*/
#define	CANR_MOSTAT27	(CANR_MO27_CTR_STAT)

/** \\brief  1374, Message Object  Data Register High */
#define CANR_MO27_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029374u)

/** Alias (User Manual Name) for CANR_MO27_DATAH.
* To use register names with standard convension, please use CANR_MO27_DATAH.
*/
#define	CANR_MODATAH27	(CANR_MO27_DATAH)

/** \\brief  1370, Message Object  Data Register Low */
#define CANR_MO27_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029370u)

/** Alias (User Manual Name) for CANR_MO27_DATAL.
* To use register names with standard convension, please use CANR_MO27_DATAL.
*/
#define	CANR_MODATAL27	(CANR_MO27_DATAL)

/** \\brief  1360, Message Object  Function Control Register */
#define CANR_MO27_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029360u)

/** Alias (User Manual Name) for CANR_MO27_FCR.
* To use register names with standard convension, please use CANR_MO27_FCR.
*/
#define	CANR_MOFCR27	(CANR_MO27_FCR)

/** \\brief  1364, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO27_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029364u)

/** Alias (User Manual Name) for CANR_MO27_FGPR.
* To use register names with standard convension, please use CANR_MO27_FGPR.
*/
#define	CANR_MOFGPR27	(CANR_MO27_FGPR)

/** \\brief  1368, Message Object  Interrupt Pointer Register */
#define CANR_MO27_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029368u)

/** Alias (User Manual Name) for CANR_MO27_IPR.
* To use register names with standard convension, please use CANR_MO27_IPR.
*/
#define	CANR_MOIPR27	(CANR_MO27_IPR)

/** \\brief  138C, Message Object  Acceptance Mask Register */
#define CANR_MO28_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002938Cu)

/** Alias (User Manual Name) for CANR_MO28_AMR.
* To use register names with standard convension, please use CANR_MO28_AMR.
*/
#define	CANR_MOAMR28	(CANR_MO28_AMR)

/** \\brief  1398, Message Object  Arbitration Register */
#define CANR_MO28_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029398u)

/** Alias (User Manual Name) for CANR_MO28_AR.
* To use register names with standard convension, please use CANR_MO28_AR.
*/
#define	CANR_MOAR28	(CANR_MO28_AR)

/** \\brief  139C, Message Object  Control Register */
#define CANR_MO28_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002939Cu)

/** Alias (User Manual Name) for CANR_MO28_CTR_STAT.
* To use register names with standard convension, please use CANR_MO28_CTR_STAT.
*/
#define	CANR_MOCTR28	(CANR_MO28_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO28_CTR_STAT.
* To use register names with standard convension, please use CANR_MO28_CTR_STAT.
*/
#define	CANR_MOSTAT28	(CANR_MO28_CTR_STAT)

/** \\brief  1394, Message Object  Data Register High */
#define CANR_MO28_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029394u)

/** Alias (User Manual Name) for CANR_MO28_DATAH.
* To use register names with standard convension, please use CANR_MO28_DATAH.
*/
#define	CANR_MODATAH28	(CANR_MO28_DATAH)

/** \\brief  1390, Message Object  Data Register Low */
#define CANR_MO28_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029390u)

/** Alias (User Manual Name) for CANR_MO28_DATAL.
* To use register names with standard convension, please use CANR_MO28_DATAL.
*/
#define	CANR_MODATAL28	(CANR_MO28_DATAL)

/** \\brief  1380, Message Object  Function Control Register */
#define CANR_MO28_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029380u)

/** Alias (User Manual Name) for CANR_MO28_FCR.
* To use register names with standard convension, please use CANR_MO28_FCR.
*/
#define	CANR_MOFCR28	(CANR_MO28_FCR)

/** \\brief  1384, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO28_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029384u)

/** Alias (User Manual Name) for CANR_MO28_FGPR.
* To use register names with standard convension, please use CANR_MO28_FGPR.
*/
#define	CANR_MOFGPR28	(CANR_MO28_FGPR)

/** \\brief  1388, Message Object  Interrupt Pointer Register */
#define CANR_MO28_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029388u)

/** Alias (User Manual Name) for CANR_MO28_IPR.
* To use register names with standard convension, please use CANR_MO28_IPR.
*/
#define	CANR_MOIPR28	(CANR_MO28_IPR)

/** \\brief  13AC, Message Object  Acceptance Mask Register */
#define CANR_MO29_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00293ACu)

/** Alias (User Manual Name) for CANR_MO29_AMR.
* To use register names with standard convension, please use CANR_MO29_AMR.
*/
#define	CANR_MOAMR29	(CANR_MO29_AMR)

/** \\brief  13B8, Message Object  Arbitration Register */
#define CANR_MO29_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00293B8u)

/** Alias (User Manual Name) for CANR_MO29_AR.
* To use register names with standard convension, please use CANR_MO29_AR.
*/
#define	CANR_MOAR29	(CANR_MO29_AR)

/** \\brief  13BC, Message Object  Control Register */
#define CANR_MO29_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00293BCu)

/** Alias (User Manual Name) for CANR_MO29_CTR_STAT.
* To use register names with standard convension, please use CANR_MO29_CTR_STAT.
*/
#define	CANR_MOCTR29	(CANR_MO29_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO29_CTR_STAT.
* To use register names with standard convension, please use CANR_MO29_CTR_STAT.
*/
#define	CANR_MOSTAT29	(CANR_MO29_CTR_STAT)

/** \\brief  13B4, Message Object  Data Register High */
#define CANR_MO29_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00293B4u)

/** Alias (User Manual Name) for CANR_MO29_DATAH.
* To use register names with standard convension, please use CANR_MO29_DATAH.
*/
#define	CANR_MODATAH29	(CANR_MO29_DATAH)

/** \\brief  13B0, Message Object  Data Register Low */
#define CANR_MO29_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00293B0u)

/** Alias (User Manual Name) for CANR_MO29_DATAL.
* To use register names with standard convension, please use CANR_MO29_DATAL.
*/
#define	CANR_MODATAL29	(CANR_MO29_DATAL)

/** \\brief  13A0, Message Object  Function Control Register */
#define CANR_MO29_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00293A0u)

/** Alias (User Manual Name) for CANR_MO29_FCR.
* To use register names with standard convension, please use CANR_MO29_FCR.
*/
#define	CANR_MOFCR29	(CANR_MO29_FCR)

/** \\brief  13A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO29_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00293A4u)

