keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  13F4, Message Object  Data Register High */
#define CANR_MO31_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00293F4u)

/** Alias (User Manual Name) for CANR_MO31_DATAH.
* To use register names with standard convension, please use CANR_MO31_DATAH.
*/
#define	CANR_MODATAH31	(CANR_MO31_DATAH)

/** \\brief  13F0, Message Object  Data Register Low */
#define CANR_MO31_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00293F0u)

/** Alias (User Manual Name) for CANR_MO31_DATAL.
* To use register names with standard convension, please use CANR_MO31_DATAL.
*/
#define	CANR_MODATAL31	(CANR_MO31_DATAL)

/** \\brief  13E0, Message Object  Function Control Register */
#define CANR_MO31_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00293E0u)

/** Alias (User Manual Name) for CANR_MO31_FCR.
* To use register names with standard convension, please use CANR_MO31_FCR.
*/
#define	CANR_MOFCR31	(CANR_MO31_FCR)

/** \\brief  13E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO31_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00293E4u)

/** Alias (User Manual Name) for CANR_MO31_FGPR.
* To use register names with standard convension, please use CANR_MO31_FGPR.
*/
#define	CANR_MOFGPR31	(CANR_MO31_FGPR)

/** \\brief  13E8, Message Object  Interrupt Pointer Register */
#define CANR_MO31_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00293E8u)

/** Alias (User Manual Name) for CANR_MO31_IPR.
* To use register names with standard convension, please use CANR_MO31_IPR.
*/
#define	CANR_MOIPR31	(CANR_MO31_IPR)

/** \\brief  140C, Message Object  Acceptance Mask Register */
#define CANR_MO32_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002940Cu)

/** Alias (User Manual Name) for CANR_MO32_AMR.
* To use register names with standard convension, please use CANR_MO32_AMR.
*/
#define	CANR_MOAMR32	(CANR_MO32_AMR)

/** \\brief  1418, Message Object  Arbitration Register */
#define CANR_MO32_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029418u)

/** Alias (User Manual Name) for CANR_MO32_AR.
* To use register names with standard convension, please use CANR_MO32_AR.
*/
#define	CANR_MOAR32	(CANR_MO32_AR)

/** \\brief  141C, Message Object  Control Register */
#define CANR_MO32_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002941Cu)

/** Alias (User Manual Name) for CANR_MO32_CTR_STAT.
* To use register names with standard convension, please use CANR_MO32_CTR_STAT.
*/
#define	CANR_MOSTAT32	(CANR_MO32_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO32_CTR_STAT.
* To use register names with standard convension, please use CANR_MO32_CTR_STAT.
*/
#define	CANR_MOCTR32	(CANR_MO32_CTR_STAT)

/** \\brief  1414, Message Object  Data Register High */
#define CANR_MO32_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029414u)

/** Alias (User Manual Name) for CANR_MO32_DATAH.
* To use register names with standard convension, please use CANR_MO32_DATAH.
*/
#define	CANR_MODATAH32	(CANR_MO32_DATAH)

/** \\brief  1410, Message Object  Data Register Low */
#define CANR_MO32_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029410u)

/** Alias (User Manual Name) for CANR_MO32_DATAL.
* To use register names with standard convension, please use CANR_MO32_DATAL.
*/
#define	CANR_MODATAL32	(CANR_MO32_DATAL)

/** \\brief  1400, Message Object  Function Control Register */
#define CANR_MO32_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029400u)

/** Alias (User Manual Name) for CANR_MO32_FCR.
* To use register names with standard convension, please use CANR_MO32_FCR.
*/
#define	CANR_MOFCR32	(CANR_MO32_FCR)

/** \\brief  1404, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO32_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029404u)

/** Alias (User Manual Name) for CANR_MO32_FGPR.
* To use register names with standard convension, please use CANR_MO32_FGPR.
*/
#define	CANR_MOFGPR32	(CANR_MO32_FGPR)

/** \\brief  1408, Message Object  Interrupt Pointer Register */
#define CANR_MO32_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029408u)

/** Alias (User Manual Name) for CANR_MO32_IPR.
* To use register names with standard convension, please use CANR_MO32_IPR.
*/
#define	CANR_MOIPR32	(CANR_MO32_IPR)

/** \\brief  142C, Message Object  Acceptance Mask Register */
#define CANR_MO33_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002942Cu)

/** Alias (User Manual Name) for CANR_MO33_AMR.
* To use register names with standard convension, please use CANR_MO33_AMR.
*/
#define	CANR_MOAMR33	(CANR_MO33_AMR)

/** \\brief  1438, Message Object  Arbitration Register */
#define CANR_MO33_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029438u)

/** Alias (User Manual Name) for CANR_MO33_AR.
* To use register names with standard convension, please use CANR_MO33_AR.
*/
#define	CANR_MOAR33	(CANR_MO33_AR)

/** \\brief  143C, Message Object  Control Register */
#define CANR_MO33_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002943Cu)

/** Alias (User Manual Name) for CANR_MO33_CTR_STAT.
* To use register names with standard convension, please use CANR_MO33_CTR_STAT.
*/
#define	CANR_MOCTR33	(CANR_MO33_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO33_CTR_STAT.
* To use register names with standard convension, please use CANR_MO33_CTR_STAT.
*/
#define	CANR_MOSTAT33	(CANR_MO33_CTR_STAT)

/** \\brief  1434, Message Object  Data Register High */
#define CANR_MO33_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029434u)

/** Alias (User Manual Name) for CANR_MO33_DATAH.
* To use register names with standard convension, please use CANR_MO33_DATAH.
*/
#define	CANR_MODATAH33	(CANR_MO33_DATAH)

/** \\brief  1430, Message Object  Data Register Low */
#define CANR_MO33_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029430u)

/** Alias (User Manual Name) for CANR_MO33_DATAL.
* To use register names with standard convension, please use CANR_MO33_DATAL.
*/
#define	CANR_MODATAL33	(CANR_MO33_DATAL)

/** \\brief  1420, Message Object  Function Control Register */
#define CANR_MO33_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029420u)

/** Alias (User Manual Name) for CANR_MO33_FCR.
* To use register names with standard convension, please use CANR_MO33_FCR.
*/
#define	CANR_MOFCR33	(CANR_MO33_FCR)

