keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1424, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO33_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029424u)

/** Alias (User Manual Name) for CANR_MO33_FGPR.
* To use register names with standard convension, please use CANR_MO33_FGPR.
*/
#define	CANR_MOFGPR33	(CANR_MO33_FGPR)

/** \\brief  1428, Message Object  Interrupt Pointer Register */
#define CANR_MO33_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029428u)

/** Alias (User Manual Name) for CANR_MO33_IPR.
* To use register names with standard convension, please use CANR_MO33_IPR.
*/
#define	CANR_MOIPR33	(CANR_MO33_IPR)

/** \\brief  144C, Message Object  Acceptance Mask Register */
#define CANR_MO34_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002944Cu)

/** Alias (User Manual Name) for CANR_MO34_AMR.
* To use register names with standard convension, please use CANR_MO34_AMR.
*/
#define	CANR_MOAMR34	(CANR_MO34_AMR)

/** \\brief  1458, Message Object  Arbitration Register */
#define CANR_MO34_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029458u)

/** Alias (User Manual Name) for CANR_MO34_AR.
* To use register names with standard convension, please use CANR_MO34_AR.
*/
#define	CANR_MOAR34	(CANR_MO34_AR)

/** \\brief  145C, Message Object  Control Register */
#define CANR_MO34_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002945Cu)

/** Alias (User Manual Name) for CANR_MO34_CTR_STAT.
* To use register names with standard convension, please use CANR_MO34_CTR_STAT.
*/
#define	CANR_MOCTR34	(CANR_MO34_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO34_CTR_STAT.
* To use register names with standard convension, please use CANR_MO34_CTR_STAT.
*/
#define	CANR_MOSTAT34	(CANR_MO34_CTR_STAT)

/** \\brief  1454, Message Object  Data Register High */
#define CANR_MO34_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029454u)

/** Alias (User Manual Name) for CANR_MO34_DATAH.
* To use register names with standard convension, please use CANR_MO34_DATAH.
*/
#define	CANR_MODATAH34	(CANR_MO34_DATAH)

/** \\brief  1450, Message Object  Data Register Low */
#define CANR_MO34_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029450u)

/** Alias (User Manual Name) for CANR_MO34_DATAL.
* To use register names with standard convension, please use CANR_MO34_DATAL.
*/
#define	CANR_MODATAL34	(CANR_MO34_DATAL)

/** \\brief  1440, Message Object  Function Control Register */
#define CANR_MO34_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029440u)

/** Alias (User Manual Name) for CANR_MO34_FCR.
* To use register names with standard convension, please use CANR_MO34_FCR.
*/
#define	CANR_MOFCR34	(CANR_MO34_FCR)

/** \\brief  1444, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO34_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029444u)

/** Alias (User Manual Name) for CANR_MO34_FGPR.
* To use register names with standard convension, please use CANR_MO34_FGPR.
*/
#define	CANR_MOFGPR34	(CANR_MO34_FGPR)

/** \\brief  1448, Message Object  Interrupt Pointer Register */
#define CANR_MO34_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029448u)

/** Alias (User Manual Name) for CANR_MO34_IPR.
* To use register names with standard convension, please use CANR_MO34_IPR.
*/
#define	CANR_MOIPR34	(CANR_MO34_IPR)

/** \\brief  146C, Message Object  Acceptance Mask Register */
#define CANR_MO35_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002946Cu)

/** Alias (User Manual Name) for CANR_MO35_AMR.
* To use register names with standard convension, please use CANR_MO35_AMR.
*/
#define	CANR_MOAMR35	(CANR_MO35_AMR)

/** \\brief  1478, Message Object  Arbitration Register */
#define CANR_MO35_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029478u)

/** Alias (User Manual Name) for CANR_MO35_AR.
* To use register names with standard convension, please use CANR_MO35_AR.
*/
#define	CANR_MOAR35	(CANR_MO35_AR)

/** \\brief  147C, Message Object  Control Register */
#define CANR_MO35_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002947Cu)

/** Alias (User Manual Name) for CANR_MO35_CTR_STAT.
* To use register names with standard convension, please use CANR_MO35_CTR_STAT.
*/
#define	CANR_MOCTR35	(CANR_MO35_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO35_CTR_STAT.
* To use register names with standard convension, please use CANR_MO35_CTR_STAT.
*/
#define	CANR_MOSTAT35	(CANR_MO35_CTR_STAT)

/** \\brief  1474, Message Object  Data Register High */
#define CANR_MO35_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029474u)

/** Alias (User Manual Name) for CANR_MO35_DATAH.
* To use register names with standard convension, please use CANR_MO35_DATAH.
*/
#define	CANR_MODATAH35	(CANR_MO35_DATAH)

/** \\brief  1470, Message Object  Data Register Low */
#define CANR_MO35_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029470u)

/** Alias (User Manual Name) for CANR_MO35_DATAL.
* To use register names with standard convension, please use CANR_MO35_DATAL.
*/
#define	CANR_MODATAL35	(CANR_MO35_DATAL)

/** \\brief  1460, Message Object  Function Control Register */
#define CANR_MO35_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029460u)

/** Alias (User Manual Name) for CANR_MO35_FCR.
* To use register names with standard convension, please use CANR_MO35_FCR.
*/
#define	CANR_MOFCR35	(CANR_MO35_FCR)

/** \\brief  1464, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO35_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029464u)

/** Alias (User Manual Name) for CANR_MO35_FGPR.
* To use register names with standard convension, please use CANR_MO35_FGPR.
*/
#define	CANR_MOFGPR35	(CANR_MO35_FGPR)

/** \\brief  1468, Message Object  Interrupt Pointer Register */
#define CANR_MO35_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029468u)

/** Alias (User Manual Name) for CANR_MO35_IPR.
* To use register names with standard convension, please use CANR_MO35_IPR.
*/
#define	CANR_MOIPR35	(CANR_MO35_IPR)

