keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  148C, Message Object  Acceptance Mask Register */
#define CANR_MO36_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002948Cu)

/** Alias (User Manual Name) for CANR_MO36_AMR.
* To use register names with standard convension, please use CANR_MO36_AMR.
*/
#define	CANR_MOAMR36	(CANR_MO36_AMR)

/** \\brief  1498, Message Object  Arbitration Register */
#define CANR_MO36_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029498u)

/** Alias (User Manual Name) for CANR_MO36_AR.
* To use register names with standard convension, please use CANR_MO36_AR.
*/
#define	CANR_MOAR36	(CANR_MO36_AR)

/** \\brief  149C, Message Object  Control Register */
#define CANR_MO36_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002949Cu)

/** Alias (User Manual Name) for CANR_MO36_CTR_STAT.
* To use register names with standard convension, please use CANR_MO36_CTR_STAT.
*/
#define	CANR_MOCTR36	(CANR_MO36_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO36_CTR_STAT.
* To use register names with standard convension, please use CANR_MO36_CTR_STAT.
*/
#define	CANR_MOSTAT36	(CANR_MO36_CTR_STAT)

/** \\brief  1494, Message Object  Data Register High */
#define CANR_MO36_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029494u)

/** Alias (User Manual Name) for CANR_MO36_DATAH.
* To use register names with standard convension, please use CANR_MO36_DATAH.
*/
#define	CANR_MODATAH36	(CANR_MO36_DATAH)

/** \\brief  1490, Message Object  Data Register Low */
#define CANR_MO36_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029490u)

/** Alias (User Manual Name) for CANR_MO36_DATAL.
* To use register names with standard convension, please use CANR_MO36_DATAL.
*/
#define	CANR_MODATAL36	(CANR_MO36_DATAL)

/** \\brief  1480, Message Object  Function Control Register */
#define CANR_MO36_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029480u)

/** Alias (User Manual Name) for CANR_MO36_FCR.
* To use register names with standard convension, please use CANR_MO36_FCR.
*/
#define	CANR_MOFCR36	(CANR_MO36_FCR)

/** \\brief  1484, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO36_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029484u)

/** Alias (User Manual Name) for CANR_MO36_FGPR.
* To use register names with standard convension, please use CANR_MO36_FGPR.
*/
#define	CANR_MOFGPR36	(CANR_MO36_FGPR)

/** \\brief  1488, Message Object  Interrupt Pointer Register */
#define CANR_MO36_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029488u)

/** Alias (User Manual Name) for CANR_MO36_IPR.
* To use register names with standard convension, please use CANR_MO36_IPR.
*/
#define	CANR_MOIPR36	(CANR_MO36_IPR)

/** \\brief  14AC, Message Object  Acceptance Mask Register */
#define CANR_MO37_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294ACu)

/** Alias (User Manual Name) for CANR_MO37_AMR.
* To use register names with standard convension, please use CANR_MO37_AMR.
*/
#define	CANR_MOAMR37	(CANR_MO37_AMR)

/** \\brief  14B8, Message Object  Arbitration Register */
#define CANR_MO37_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294B8u)

/** Alias (User Manual Name) for CANR_MO37_AR.
* To use register names with standard convension, please use CANR_MO37_AR.
*/
#define	CANR_MOAR37	(CANR_MO37_AR)

/** \\brief  14BC, Message Object  Control Register */
#define CANR_MO37_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00294BCu)

/** Alias (User Manual Name) for CANR_MO37_CTR_STAT.
* To use register names with standard convension, please use CANR_MO37_CTR_STAT.
*/
#define	CANR_MOCTR37	(CANR_MO37_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO37_CTR_STAT.
* To use register names with standard convension, please use CANR_MO37_CTR_STAT.
*/
#define	CANR_MOSTAT37	(CANR_MO37_CTR_STAT)

/** \\brief  14B4, Message Object  Data Register High */
#define CANR_MO37_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294B4u)

/** Alias (User Manual Name) for CANR_MO37_DATAH.
* To use register names with standard convension, please use CANR_MO37_DATAH.
*/
#define	CANR_MODATAH37	(CANR_MO37_DATAH)

/** \\brief  14B0, Message Object  Data Register Low */
#define CANR_MO37_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294B0u)

/** Alias (User Manual Name) for CANR_MO37_DATAL.
* To use register names with standard convension, please use CANR_MO37_DATAL.
*/
#define	CANR_MODATAL37	(CANR_MO37_DATAL)

/** \\brief  14A0, Message Object  Function Control Register */
#define CANR_MO37_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294A0u)

/** Alias (User Manual Name) for CANR_MO37_FCR.
* To use register names with standard convension, please use CANR_MO37_FCR.
*/
#define	CANR_MOFCR37	(CANR_MO37_FCR)

/** \\brief  14A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO37_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294A4u)

/** Alias (User Manual Name) for CANR_MO37_FGPR.
* To use register names with standard convension, please use CANR_MO37_FGPR.
*/
#define	CANR_MOFGPR37	(CANR_MO37_FGPR)

/** \\brief  14A8, Message Object  Interrupt Pointer Register */
#define CANR_MO37_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294A8u)

/** Alias (User Manual Name) for CANR_MO37_IPR.
* To use register names with standard convension, please use CANR_MO37_IPR.
*/
#define	CANR_MOIPR37	(CANR_MO37_IPR)

/** \\brief  14CC, Message Object  Acceptance Mask Register */
#define CANR_MO38_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294CCu)

/** Alias (User Manual Name) for CANR_MO38_AMR.
* To use register names with standard convension, please use CANR_MO38_AMR.
*/
#define	CANR_MOAMR38	(CANR_MO38_AMR)

/** \\brief  14D8, Message Object  Arbitration Register */
#define CANR_MO38_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294D8u)

/** Alias (User Manual Name) for CANR_MO38_AR.
* To use register names with standard convension, please use CANR_MO38_AR.
*/
#define	CANR_MOAR38	(CANR_MO38_AR)

/** \\brief  14DC, Message Object  Control Register */
#define CANR_MO38_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00294DCu)

/** Alias (User Manual Name) for CANR_MO38_CTR_STAT.
* To use register names with standard convension, please use CANR_MO38_CTR_STAT.
*/
#define	CANR_MOCTR38	(CANR_MO38_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO38_CTR_STAT.
* To use register names with standard convension, please use CANR_MO38_CTR_STAT.
*/
#define	CANR_MOSTAT38	(CANR_MO38_CTR_STAT)

/** \\brief  14D4, Message Object  Data Register High */
#define CANR_MO38_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294D4u)

