keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO38_DATAH.
* To use register names with standard convension, please use CANR_MO38_DATAH.
*/
#define	CANR_MODATAH38	(CANR_MO38_DATAH)

/** \\brief  14D0, Message Object  Data Register Low */
#define CANR_MO38_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294D0u)

/** Alias (User Manual Name) for CANR_MO38_DATAL.
* To use register names with standard convension, please use CANR_MO38_DATAL.
*/
#define	CANR_MODATAL38	(CANR_MO38_DATAL)

/** \\brief  14C0, Message Object  Function Control Register */
#define CANR_MO38_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294C0u)

/** Alias (User Manual Name) for CANR_MO38_FCR.
* To use register names with standard convension, please use CANR_MO38_FCR.
*/
#define	CANR_MOFCR38	(CANR_MO38_FCR)

/** \\brief  14C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO38_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294C4u)

/** Alias (User Manual Name) for CANR_MO38_FGPR.
* To use register names with standard convension, please use CANR_MO38_FGPR.
*/
#define	CANR_MOFGPR38	(CANR_MO38_FGPR)

/** \\brief  14C8, Message Object  Interrupt Pointer Register */
#define CANR_MO38_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294C8u)

/** Alias (User Manual Name) for CANR_MO38_IPR.
* To use register names with standard convension, please use CANR_MO38_IPR.
*/
#define	CANR_MOIPR38	(CANR_MO38_IPR)

/** \\brief  14EC, Message Object  Acceptance Mask Register */
#define CANR_MO39_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00294ECu)

/** Alias (User Manual Name) for CANR_MO39_AMR.
* To use register names with standard convension, please use CANR_MO39_AMR.
*/
#define	CANR_MOAMR39	(CANR_MO39_AMR)

/** \\brief  14F8, Message Object  Arbitration Register */
#define CANR_MO39_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00294F8u)

/** Alias (User Manual Name) for CANR_MO39_AR.
* To use register names with standard convension, please use CANR_MO39_AR.
*/
#define	CANR_MOAR39	(CANR_MO39_AR)

/** \\brief  14FC, Message Object  Control Register */
#define CANR_MO39_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00294FCu)

/** Alias (User Manual Name) for CANR_MO39_CTR_STAT.
* To use register names with standard convension, please use CANR_MO39_CTR_STAT.
*/
#define	CANR_MOCTR39	(CANR_MO39_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO39_CTR_STAT.
* To use register names with standard convension, please use CANR_MO39_CTR_STAT.
*/
#define	CANR_MOSTAT39	(CANR_MO39_CTR_STAT)

/** \\brief  14F4, Message Object  Data Register High */
#define CANR_MO39_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00294F4u)

/** Alias (User Manual Name) for CANR_MO39_DATAH.
* To use register names with standard convension, please use CANR_MO39_DATAH.
*/
#define	CANR_MODATAH39	(CANR_MO39_DATAH)

/** \\brief  14F0, Message Object  Data Register Low */
#define CANR_MO39_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00294F0u)

/** Alias (User Manual Name) for CANR_MO39_DATAL.
* To use register names with standard convension, please use CANR_MO39_DATAL.
*/
#define	CANR_MODATAL39	(CANR_MO39_DATAL)

/** \\brief  14E0, Message Object  Function Control Register */
#define CANR_MO39_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00294E0u)

/** Alias (User Manual Name) for CANR_MO39_FCR.
* To use register names with standard convension, please use CANR_MO39_FCR.
*/
#define	CANR_MOFCR39	(CANR_MO39_FCR)

/** \\brief  14E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO39_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00294E4u)

/** Alias (User Manual Name) for CANR_MO39_FGPR.
* To use register names with standard convension, please use CANR_MO39_FGPR.
*/
#define	CANR_MOFGPR39	(CANR_MO39_FGPR)

/** \\brief  14E8, Message Object  Interrupt Pointer Register */
#define CANR_MO39_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00294E8u)

/** Alias (User Manual Name) for CANR_MO39_IPR.
* To use register names with standard convension, please use CANR_MO39_IPR.
*/
#define	CANR_MOIPR39	(CANR_MO39_IPR)

/** \\brief  106C, Message Object  Acceptance Mask Register */
#define CANR_MO3_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002906Cu)

/** Alias (User Manual Name) for CANR_MO3_AMR.
* To use register names with standard convension, please use CANR_MO3_AMR.
*/
#define	CANR_MOAMR3	(CANR_MO3_AMR)

/** \\brief  1078, Message Object  Arbitration Register */
#define CANR_MO3_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029078u)

/** Alias (User Manual Name) for CANR_MO3_AR.
* To use register names with standard convension, please use CANR_MO3_AR.
*/
#define	CANR_MOAR3	(CANR_MO3_AR)

/** \\brief  107C, Message Object  Control Register */
#define CANR_MO3_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002907Cu)

/** Alias (User Manual Name) for CANR_MO3_CTR_STAT.
* To use register names with standard convension, please use CANR_MO3_CTR_STAT.
*/
#define	CANR_MOSTAT3	(CANR_MO3_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO3_CTR_STAT.
* To use register names with standard convension, please use CANR_MO3_CTR_STAT.
*/
#define	CANR_MOCTR3	(CANR_MO3_CTR_STAT)

/** \\brief  1074, Message Object  Data Register High */
#define CANR_MO3_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029074u)

/** Alias (User Manual Name) for CANR_MO3_DATAH.
* To use register names with standard convension, please use CANR_MO3_DATAH.
*/
#define	CANR_MODATAH3	(CANR_MO3_DATAH)

/** \\brief  1070, Message Object  Data Register Low */
#define CANR_MO3_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029070u)

/** Alias (User Manual Name) for CANR_MO3_DATAL.
* To use register names with standard convension, please use CANR_MO3_DATAL.
*/
#define	CANR_MODATAL3	(CANR_MO3_DATAL)

/** \\brief  1060, Message Object  Function Control Register */
#define CANR_MO3_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029060u)

/** Alias (User Manual Name) for CANR_MO3_FCR.
* To use register names with standard convension, please use CANR_MO3_FCR.
*/
#define	CANR_MOFCR3	(CANR_MO3_FCR)

