keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1064, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO3_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029064u)

/** Alias (User Manual Name) for CANR_MO3_FGPR.
* To use register names with standard convension, please use CANR_MO3_FGPR.
*/
#define	CANR_MOFGPR3	(CANR_MO3_FGPR)

/** \\brief  1068, Message Object  Interrupt Pointer Register */
#define CANR_MO3_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029068u)

/** Alias (User Manual Name) for CANR_MO3_IPR.
* To use register names with standard convension, please use CANR_MO3_IPR.
*/
#define	CANR_MOIPR3	(CANR_MO3_IPR)

/** \\brief  150C, Message Object  Acceptance Mask Register */
#define CANR_MO40_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002950Cu)

/** Alias (User Manual Name) for CANR_MO40_AMR.
* To use register names with standard convension, please use CANR_MO40_AMR.
*/
#define	CANR_MOAMR40	(CANR_MO40_AMR)

/** \\brief  1518, Message Object  Arbitration Register */
#define CANR_MO40_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029518u)

/** Alias (User Manual Name) for CANR_MO40_AR.
* To use register names with standard convension, please use CANR_MO40_AR.
*/
#define	CANR_MOAR40	(CANR_MO40_AR)

/** \\brief  151C, Message Object  Control Register */
#define CANR_MO40_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002951Cu)

/** Alias (User Manual Name) for CANR_MO40_CTR_STAT.
* To use register names with standard convension, please use CANR_MO40_CTR_STAT.
*/
#define	CANR_MOSTAT40	(CANR_MO40_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO40_CTR_STAT.
* To use register names with standard convension, please use CANR_MO40_CTR_STAT.
*/
#define	CANR_MOCTR40	(CANR_MO40_CTR_STAT)

/** \\brief  1514, Message Object  Data Register High */
#define CANR_MO40_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029514u)

/** Alias (User Manual Name) for CANR_MO40_DATAH.
* To use register names with standard convension, please use CANR_MO40_DATAH.
*/
#define	CANR_MODATAH40	(CANR_MO40_DATAH)

/** \\brief  1510, Message Object  Data Register Low */
#define CANR_MO40_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029510u)

/** Alias (User Manual Name) for CANR_MO40_DATAL.
* To use register names with standard convension, please use CANR_MO40_DATAL.
*/
#define	CANR_MODATAL40	(CANR_MO40_DATAL)

/** \\brief  1500, Message Object  Function Control Register */
#define CANR_MO40_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029500u)

/** Alias (User Manual Name) for CANR_MO40_FCR.
* To use register names with standard convension, please use CANR_MO40_FCR.
*/
#define	CANR_MOFCR40	(CANR_MO40_FCR)

/** \\brief  1504, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO40_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029504u)

/** Alias (User Manual Name) for CANR_MO40_FGPR.
* To use register names with standard convension, please use CANR_MO40_FGPR.
*/
#define	CANR_MOFGPR40	(CANR_MO40_FGPR)

/** \\brief  1508, Message Object  Interrupt Pointer Register */
#define CANR_MO40_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029508u)

/** Alias (User Manual Name) for CANR_MO40_IPR.
* To use register names with standard convension, please use CANR_MO40_IPR.
*/
#define	CANR_MOIPR40	(CANR_MO40_IPR)

/** \\brief  152C, Message Object  Acceptance Mask Register */
#define CANR_MO41_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002952Cu)

/** Alias (User Manual Name) for CANR_MO41_AMR.
* To use register names with standard convension, please use CANR_MO41_AMR.
*/
#define	CANR_MOAMR41	(CANR_MO41_AMR)

/** \\brief  1538, Message Object  Arbitration Register */
#define CANR_MO41_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029538u)

/** Alias (User Manual Name) for CANR_MO41_AR.
* To use register names with standard convension, please use CANR_MO41_AR.
*/
#define	CANR_MOAR41	(CANR_MO41_AR)

/** \\brief  153C, Message Object  Control Register */
#define CANR_MO41_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002953Cu)

/** Alias (User Manual Name) for CANR_MO41_CTR_STAT.
* To use register names with standard convension, please use CANR_MO41_CTR_STAT.
*/
#define	CANR_MOSTAT41	(CANR_MO41_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO41_CTR_STAT.
* To use register names with standard convension, please use CANR_MO41_CTR_STAT.
*/
#define	CANR_MOCTR41	(CANR_MO41_CTR_STAT)

/** \\brief  1534, Message Object  Data Register High */
#define CANR_MO41_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029534u)

/** Alias (User Manual Name) for CANR_MO41_DATAH.
* To use register names with standard convension, please use CANR_MO41_DATAH.
*/
#define	CANR_MODATAH41	(CANR_MO41_DATAH)

/** \\brief  1530, Message Object  Data Register Low */
#define CANR_MO41_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029530u)

/** Alias (User Manual Name) for CANR_MO41_DATAL.
* To use register names with standard convension, please use CANR_MO41_DATAL.
*/
#define	CANR_MODATAL41	(CANR_MO41_DATAL)

/** \\brief  1520, Message Object  Function Control Register */
#define CANR_MO41_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029520u)

/** Alias (User Manual Name) for CANR_MO41_FCR.
* To use register names with standard convension, please use CANR_MO41_FCR.
*/
#define	CANR_MOFCR41	(CANR_MO41_FCR)

/** \\brief  1524, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO41_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029524u)

/** Alias (User Manual Name) for CANR_MO41_FGPR.
* To use register names with standard convension, please use CANR_MO41_FGPR.
*/
#define	CANR_MOFGPR41	(CANR_MO41_FGPR)

/** \\brief  1528, Message Object  Interrupt Pointer Register */
#define CANR_MO41_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029528u)

/** Alias (User Manual Name) for CANR_MO41_IPR.
* To use register names with standard convension, please use CANR_MO41_IPR.
*/
#define	CANR_MOIPR41	(CANR_MO41_IPR)

/** \\brief  154C, Message Object  Acceptance Mask Register */
#define CANR_MO42_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002954Cu)

/** Alias (User Manual Name) for CANR_MO42_AMR.
* To use register names with standard convension, please use CANR_MO42_AMR.
*/
#define	CANR_MOAMR42	(CANR_MO42_AMR)

/** \\brief  1558, Message Object  Arbitration Register */
#define CANR_MO42_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029558u)

/** Alias (User Manual Name) for CANR_MO42_AR.
* To use register names with standard convension, please use CANR_MO42_AR.
*/
#define	CANR_MOAR42	(CANR_MO42_AR)

/** \\brief  155C, Message Object  Control Register */
#define CANR_MO42_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002955Cu)

/** Alias (User Manual Name) for CANR_MO42_CTR_STAT.
* To use register names with standard convension, please use CANR_MO42_CTR_STAT.
*/
#define	CANR_MOSTAT42	(CANR_MO42_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO42_CTR_STAT.
* To use register names with standard convension, please use CANR_MO42_CTR_STAT.
*/
#define	CANR_MOCTR42	(CANR_MO42_CTR_STAT)

/** \\brief  1554, Message Object  Data Register High */
#define CANR_MO42_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029554u)

/** Alias (User Manual Name) for CANR_MO42_DATAH.
* To use register names with standard convension, please use CANR_MO42_DATAH.
*/
#define	CANR_MODATAH42	(CANR_MO42_DATAH)

