keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  15E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO47_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00295E4u)

/** Alias (User Manual Name) for CANR_MO47_FGPR.
* To use register names with standard convension, please use CANR_MO47_FGPR.
*/
#define	CANR_MOFGPR47	(CANR_MO47_FGPR)

/** \\brief  15E8, Message Object  Interrupt Pointer Register */
#define CANR_MO47_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00295E8u)

/** Alias (User Manual Name) for CANR_MO47_IPR.
* To use register names with standard convension, please use CANR_MO47_IPR.
*/
#define	CANR_MOIPR47	(CANR_MO47_IPR)

/** \\brief  160C, Message Object  Acceptance Mask Register */
#define CANR_MO48_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002960Cu)

/** Alias (User Manual Name) for CANR_MO48_AMR.
* To use register names with standard convension, please use CANR_MO48_AMR.
*/
#define	CANR_MOAMR48	(CANR_MO48_AMR)

/** \\brief  1618, Message Object  Arbitration Register */
#define CANR_MO48_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029618u)

/** Alias (User Manual Name) for CANR_MO48_AR.
* To use register names with standard convension, please use CANR_MO48_AR.
*/
#define	CANR_MOAR48	(CANR_MO48_AR)

/** \\brief  161C, Message Object  Control Register */
#define CANR_MO48_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002961Cu)

/** Alias (User Manual Name) for CANR_MO48_CTR_STAT.
* To use register names with standard convension, please use CANR_MO48_CTR_STAT.
*/
#define	CANR_MOSTAT48	(CANR_MO48_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO48_CTR_STAT.
* To use register names with standard convension, please use CANR_MO48_CTR_STAT.
*/
#define	CANR_MOCTR48	(CANR_MO48_CTR_STAT)

/** \\brief  1614, Message Object  Data Register High */
#define CANR_MO48_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029614u)

/** Alias (User Manual Name) for CANR_MO48_DATAH.
* To use register names with standard convension, please use CANR_MO48_DATAH.
*/
#define	CANR_MODATAH48	(CANR_MO48_DATAH)

/** \\brief  1610, Message Object  Data Register Low */
#define CANR_MO48_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029610u)

/** Alias (User Manual Name) for CANR_MO48_DATAL.
* To use register names with standard convension, please use CANR_MO48_DATAL.
*/
#define	CANR_MODATAL48	(CANR_MO48_DATAL)

/** \\brief  1600, Message Object  Function Control Register */
#define CANR_MO48_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029600u)

/** Alias (User Manual Name) for CANR_MO48_FCR.
* To use register names with standard convension, please use CANR_MO48_FCR.
*/
#define	CANR_MOFCR48	(CANR_MO48_FCR)

/** \\brief  1604, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO48_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029604u)

/** Alias (User Manual Name) for CANR_MO48_FGPR.
* To use register names with standard convension, please use CANR_MO48_FGPR.
*/
#define	CANR_MOFGPR48	(CANR_MO48_FGPR)

/** \\brief  1608, Message Object  Interrupt Pointer Register */
#define CANR_MO48_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029608u)

/** Alias (User Manual Name) for CANR_MO48_IPR.
* To use register names with standard convension, please use CANR_MO48_IPR.
*/
#define	CANR_MOIPR48	(CANR_MO48_IPR)

/** \\brief  162C, Message Object  Acceptance Mask Register */
#define CANR_MO49_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002962Cu)

/** Alias (User Manual Name) for CANR_MO49_AMR.
* To use register names with standard convension, please use CANR_MO49_AMR.
*/
#define	CANR_MOAMR49	(CANR_MO49_AMR)

/** \\brief  1638, Message Object  Arbitration Register */
#define CANR_MO49_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029638u)

/** Alias (User Manual Name) for CANR_MO49_AR.
* To use register names with standard convension, please use CANR_MO49_AR.
*/
#define	CANR_MOAR49	(CANR_MO49_AR)

/** \\brief  163C, Message Object  Control Register */
#define CANR_MO49_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002963Cu)

/** Alias (User Manual Name) for CANR_MO49_CTR_STAT.
* To use register names with standard convension, please use CANR_MO49_CTR_STAT.
*/
#define	CANR_MOSTAT49	(CANR_MO49_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO49_CTR_STAT.
* To use register names with standard convension, please use CANR_MO49_CTR_STAT.
*/
#define	CANR_MOCTR49	(CANR_MO49_CTR_STAT)

/** \\brief  1634, Message Object  Data Register High */
#define CANR_MO49_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029634u)

/** Alias (User Manual Name) for CANR_MO49_DATAH.
* To use register names with standard convension, please use CANR_MO49_DATAH.
*/
#define	CANR_MODATAH49	(CANR_MO49_DATAH)

/** \\brief  1630, Message Object  Data Register Low */
#define CANR_MO49_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029630u)

/** Alias (User Manual Name) for CANR_MO49_DATAL.
* To use register names with standard convension, please use CANR_MO49_DATAL.
*/
#define	CANR_MODATAL49	(CANR_MO49_DATAL)

/** \\brief  1620, Message Object  Function Control Register */
#define CANR_MO49_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029620u)

/** Alias (User Manual Name) for CANR_MO49_FCR.
* To use register names with standard convension, please use CANR_MO49_FCR.
*/
#define	CANR_MOFCR49	(CANR_MO49_FCR)

/** \\brief  1624, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO49_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029624u)

/** Alias (User Manual Name) for CANR_MO49_FGPR.
* To use register names with standard convension, please use CANR_MO49_FGPR.
*/
#define	CANR_MOFGPR49	(CANR_MO49_FGPR)

/** \\brief  1628, Message Object  Interrupt Pointer Register */
#define CANR_MO49_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029628u)

/** Alias (User Manual Name) for CANR_MO49_IPR.
* To use register names with standard convension, please use CANR_MO49_IPR.
*/
#define	CANR_MOIPR49	(CANR_MO49_IPR)

