keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  171C, Message Object  Control Register */
#define CANR_MO56_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002971Cu)

/** Alias (User Manual Name) for CANR_MO56_CTR_STAT.
* To use register names with standard convension, please use CANR_MO56_CTR_STAT.
*/
#define	CANR_MOSTAT56	(CANR_MO56_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO56_CTR_STAT.
* To use register names with standard convension, please use CANR_MO56_CTR_STAT.
*/
#define	CANR_MOCTR56	(CANR_MO56_CTR_STAT)

/** \\brief  1714, Message Object  Data Register High */
#define CANR_MO56_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029714u)

/** Alias (User Manual Name) for CANR_MO56_DATAH.
* To use register names with standard convension, please use CANR_MO56_DATAH.
*/
#define	CANR_MODATAH56	(CANR_MO56_DATAH)

/** \\brief  1710, Message Object  Data Register Low */
#define CANR_MO56_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029710u)

/** Alias (User Manual Name) for CANR_MO56_DATAL.
* To use register names with standard convension, please use CANR_MO56_DATAL.
*/
#define	CANR_MODATAL56	(CANR_MO56_DATAL)

/** \\brief  1700, Message Object  Function Control Register */
#define CANR_MO56_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029700u)

/** Alias (User Manual Name) for CANR_MO56_FCR.
* To use register names with standard convension, please use CANR_MO56_FCR.
*/
#define	CANR_MOFCR56	(CANR_MO56_FCR)

/** \\brief  1704, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO56_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029704u)

/** Alias (User Manual Name) for CANR_MO56_FGPR.
* To use register names with standard convension, please use CANR_MO56_FGPR.
*/
#define	CANR_MOFGPR56	(CANR_MO56_FGPR)

/** \\brief  1708, Message Object  Interrupt Pointer Register */
#define CANR_MO56_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029708u)

/** Alias (User Manual Name) for CANR_MO56_IPR.
* To use register names with standard convension, please use CANR_MO56_IPR.
*/
#define	CANR_MOIPR56	(CANR_MO56_IPR)

/** \\brief  172C, Message Object  Acceptance Mask Register */
#define CANR_MO57_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002972Cu)

/** Alias (User Manual Name) for CANR_MO57_AMR.
* To use register names with standard convension, please use CANR_MO57_AMR.
*/
#define	CANR_MOAMR57	(CANR_MO57_AMR)

/** \\brief  1738, Message Object  Arbitration Register */
#define CANR_MO57_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029738u)

/** Alias (User Manual Name) for CANR_MO57_AR.
* To use register names with standard convension, please use CANR_MO57_AR.
*/
#define	CANR_MOAR57	(CANR_MO57_AR)

/** \\brief  173C, Message Object  Control Register */
#define CANR_MO57_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002973Cu)

/** Alias (User Manual Name) for CANR_MO57_CTR_STAT.
* To use register names with standard convension, please use CANR_MO57_CTR_STAT.
*/
#define	CANR_MOSTAT57	(CANR_MO57_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO57_CTR_STAT.
* To use register names with standard convension, please use CANR_MO57_CTR_STAT.
*/
#define	CANR_MOCTR57	(CANR_MO57_CTR_STAT)

/** \\brief  1734, Message Object  Data Register High */
#define CANR_MO57_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029734u)

/** Alias (User Manual Name) for CANR_MO57_DATAH.
* To use register names with standard convension, please use CANR_MO57_DATAH.
*/
#define	CANR_MODATAH57	(CANR_MO57_DATAH)

/** \\brief  1730, Message Object  Data Register Low */
#define CANR_MO57_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029730u)

/** Alias (User Manual Name) for CANR_MO57_DATAL.
* To use register names with standard convension, please use CANR_MO57_DATAL.
*/
#define	CANR_MODATAL57	(CANR_MO57_DATAL)

/** \\brief  1720, Message Object  Function Control Register */
#define CANR_MO57_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029720u)

/** Alias (User Manual Name) for CANR_MO57_FCR.
* To use register names with standard convension, please use CANR_MO57_FCR.
*/
#define	CANR_MOFCR57	(CANR_MO57_FCR)

/** \\brief  1724, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO57_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029724u)

/** Alias (User Manual Name) for CANR_MO57_FGPR.
* To use register names with standard convension, please use CANR_MO57_FGPR.
*/
#define	CANR_MOFGPR57	(CANR_MO57_FGPR)

/** \\brief  1728, Message Object  Interrupt Pointer Register */
#define CANR_MO57_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029728u)

/** Alias (User Manual Name) for CANR_MO57_IPR.
* To use register names with standard convension, please use CANR_MO57_IPR.
*/
#define	CANR_MOIPR57	(CANR_MO57_IPR)

/** \\brief  174C, Message Object  Acceptance Mask Register */
#define CANR_MO58_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002974Cu)

/** Alias (User Manual Name) for CANR_MO58_AMR.
* To use register names with standard convension, please use CANR_MO58_AMR.
*/
#define	CANR_MOAMR58	(CANR_MO58_AMR)

/** \\brief  1758, Message Object  Arbitration Register */
#define CANR_MO58_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029758u)

/** Alias (User Manual Name) for CANR_MO58_AR.
* To use register names with standard convension, please use CANR_MO58_AR.
*/
#define	CANR_MOAR58	(CANR_MO58_AR)

/** \\brief  175C, Message Object  Control Register */
#define CANR_MO58_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002975Cu)

/** Alias (User Manual Name) for CANR_MO58_CTR_STAT.
* To use register names with standard convension, please use CANR_MO58_CTR_STAT.
*/
#define	CANR_MOSTAT58	(CANR_MO58_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO58_CTR_STAT.
* To use register names with standard convension, please use CANR_MO58_CTR_STAT.
*/
#define	CANR_MOCTR58	(CANR_MO58_CTR_STAT)

