keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1754, Message Object  Data Register High */
#define CANR_MO58_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029754u)

/** Alias (User Manual Name) for CANR_MO58_DATAH.
* To use register names with standard convension, please use CANR_MO58_DATAH.
*/
#define	CANR_MODATAH58	(CANR_MO58_DATAH)

/** \\brief  1750, Message Object  Data Register Low */
#define CANR_MO58_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029750u)

/** Alias (User Manual Name) for CANR_MO58_DATAL.
* To use register names with standard convension, please use CANR_MO58_DATAL.
*/
#define	CANR_MODATAL58	(CANR_MO58_DATAL)

/** \\brief  1740, Message Object  Function Control Register */
#define CANR_MO58_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029740u)

/** Alias (User Manual Name) for CANR_MO58_FCR.
* To use register names with standard convension, please use CANR_MO58_FCR.
*/
#define	CANR_MOFCR58	(CANR_MO58_FCR)

/** \\brief  1744, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO58_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029744u)

/** Alias (User Manual Name) for CANR_MO58_FGPR.
* To use register names with standard convension, please use CANR_MO58_FGPR.
*/
#define	CANR_MOFGPR58	(CANR_MO58_FGPR)

/** \\brief  1748, Message Object  Interrupt Pointer Register */
#define CANR_MO58_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029748u)

/** Alias (User Manual Name) for CANR_MO58_IPR.
* To use register names with standard convension, please use CANR_MO58_IPR.
*/
#define	CANR_MOIPR58	(CANR_MO58_IPR)

/** \\brief  176C, Message Object  Acceptance Mask Register */
#define CANR_MO59_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002976Cu)

/** Alias (User Manual Name) for CANR_MO59_AMR.
* To use register names with standard convension, please use CANR_MO59_AMR.
*/
#define	CANR_MOAMR59	(CANR_MO59_AMR)

/** \\brief  1778, Message Object  Arbitration Register */
#define CANR_MO59_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029778u)

/** Alias (User Manual Name) for CANR_MO59_AR.
* To use register names with standard convension, please use CANR_MO59_AR.
*/
#define	CANR_MOAR59	(CANR_MO59_AR)

/** \\brief  177C, Message Object  Control Register */
#define CANR_MO59_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002977Cu)

/** Alias (User Manual Name) for CANR_MO59_CTR_STAT.
* To use register names with standard convension, please use CANR_MO59_CTR_STAT.
*/
#define	CANR_MOSTAT59	(CANR_MO59_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO59_CTR_STAT.
* To use register names with standard convension, please use CANR_MO59_CTR_STAT.
*/
#define	CANR_MOCTR59	(CANR_MO59_CTR_STAT)

/** \\brief  1774, Message Object  Data Register High */
#define CANR_MO59_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029774u)

/** Alias (User Manual Name) for CANR_MO59_DATAH.
* To use register names with standard convension, please use CANR_MO59_DATAH.
*/
#define	CANR_MODATAH59	(CANR_MO59_DATAH)

/** \\brief  1770, Message Object  Data Register Low */
#define CANR_MO59_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029770u)

/** Alias (User Manual Name) for CANR_MO59_DATAL.
* To use register names with standard convension, please use CANR_MO59_DATAL.
*/
#define	CANR_MODATAL59	(CANR_MO59_DATAL)

/** \\brief  1760, Message Object  Function Control Register */
#define CANR_MO59_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029760u)

/** Alias (User Manual Name) for CANR_MO59_FCR.
* To use register names with standard convension, please use CANR_MO59_FCR.
*/
#define	CANR_MOFCR59	(CANR_MO59_FCR)

/** \\brief  1764, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO59_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029764u)

/** Alias (User Manual Name) for CANR_MO59_FGPR.
* To use register names with standard convension, please use CANR_MO59_FGPR.
*/
#define	CANR_MOFGPR59	(CANR_MO59_FGPR)

/** \\brief  1768, Message Object  Interrupt Pointer Register */
#define CANR_MO59_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029768u)

/** Alias (User Manual Name) for CANR_MO59_IPR.
* To use register names with standard convension, please use CANR_MO59_IPR.
*/
#define	CANR_MOIPR59	(CANR_MO59_IPR)

/** \\brief  10AC, Message Object  Acceptance Mask Register */
#define CANR_MO5_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00290ACu)

/** Alias (User Manual Name) for CANR_MO5_AMR.
* To use register names with standard convension, please use CANR_MO5_AMR.
*/
#define	CANR_MOAMR5	(CANR_MO5_AMR)

/** \\brief  10B8, Message Object  Arbitration Register */
#define CANR_MO5_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00290B8u)

/** Alias (User Manual Name) for CANR_MO5_AR.
* To use register names with standard convension, please use CANR_MO5_AR.
*/
#define	CANR_MOAR5	(CANR_MO5_AR)

/** \\brief  10BC, Message Object  Control Register */
#define CANR_MO5_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00290BCu)

/** Alias (User Manual Name) for CANR_MO5_CTR_STAT.
* To use register names with standard convension, please use CANR_MO5_CTR_STAT.
*/
#define	CANR_MOSTAT5	(CANR_MO5_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO5_CTR_STAT.
* To use register names with standard convension, please use CANR_MO5_CTR_STAT.
*/
#define	CANR_MOCTR5	(CANR_MO5_CTR_STAT)

/** \\brief  10B4, Message Object  Data Register High */
#define CANR_MO5_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00290B4u)

/** Alias (User Manual Name) for CANR_MO5_DATAH.
* To use register names with standard convension, please use CANR_MO5_DATAH.
*/
#define	CANR_MODATAH5	(CANR_MO5_DATAH)

/** \\brief  10B0, Message Object  Data Register Low */
#define CANR_MO5_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00290B0u)

/** Alias (User Manual Name) for CANR_MO5_DATAL.
* To use register names with standard convension, please use CANR_MO5_DATAL.
*/
#define	CANR_MODATAL5	(CANR_MO5_DATAL)

/** \\brief  10A0, Message Object  Function Control Register */
#define CANR_MO5_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00290A0u)

