keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO5_FCR.
* To use register names with standard convension, please use CANR_MO5_FCR.
*/
#define	CANR_MOFCR5	(CANR_MO5_FCR)

/** \\brief  10A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO5_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00290A4u)

/** Alias (User Manual Name) for CANR_MO5_FGPR.
* To use register names with standard convension, please use CANR_MO5_FGPR.
*/
#define	CANR_MOFGPR5	(CANR_MO5_FGPR)

/** \\brief  10A8, Message Object  Interrupt Pointer Register */
#define CANR_MO5_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00290A8u)

/** Alias (User Manual Name) for CANR_MO5_IPR.
* To use register names with standard convension, please use CANR_MO5_IPR.
*/
#define	CANR_MOIPR5	(CANR_MO5_IPR)

/** \\brief  178C, Message Object  Acceptance Mask Register */
#define CANR_MO60_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002978Cu)

/** Alias (User Manual Name) for CANR_MO60_AMR.
* To use register names with standard convension, please use CANR_MO60_AMR.
*/
#define	CANR_MOAMR60	(CANR_MO60_AMR)

/** \\brief  1798, Message Object  Arbitration Register */
#define CANR_MO60_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029798u)

/** Alias (User Manual Name) for CANR_MO60_AR.
* To use register names with standard convension, please use CANR_MO60_AR.
*/
#define	CANR_MOAR60	(CANR_MO60_AR)

/** \\brief  179C, Message Object  Control Register */
#define CANR_MO60_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002979Cu)

/** Alias (User Manual Name) for CANR_MO60_CTR_STAT.
* To use register names with standard convension, please use CANR_MO60_CTR_STAT.
*/
#define	CANR_MOSTAT60	(CANR_MO60_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO60_CTR_STAT.
* To use register names with standard convension, please use CANR_MO60_CTR_STAT.
*/
#define	CANR_MOCTR60	(CANR_MO60_CTR_STAT)

/** \\brief  1794, Message Object  Data Register High */
#define CANR_MO60_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029794u)

/** Alias (User Manual Name) for CANR_MO60_DATAH.
* To use register names with standard convension, please use CANR_MO60_DATAH.
*/
#define	CANR_MODATAH60	(CANR_MO60_DATAH)

/** \\brief  1790, Message Object  Data Register Low */
#define CANR_MO60_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029790u)

/** Alias (User Manual Name) for CANR_MO60_DATAL.
* To use register names with standard convension, please use CANR_MO60_DATAL.
*/
#define	CANR_MODATAL60	(CANR_MO60_DATAL)

/** \\brief  1780, Message Object  Function Control Register */
#define CANR_MO60_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029780u)

/** Alias (User Manual Name) for CANR_MO60_FCR.
* To use register names with standard convension, please use CANR_MO60_FCR.
*/
#define	CANR_MOFCR60	(CANR_MO60_FCR)

/** \\brief  1784, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO60_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029784u)

/** Alias (User Manual Name) for CANR_MO60_FGPR.
* To use register names with standard convension, please use CANR_MO60_FGPR.
*/
#define	CANR_MOFGPR60	(CANR_MO60_FGPR)

/** \\brief  1788, Message Object  Interrupt Pointer Register */
#define CANR_MO60_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029788u)

/** Alias (User Manual Name) for CANR_MO60_IPR.
* To use register names with standard convension, please use CANR_MO60_IPR.
*/
#define	CANR_MOIPR60	(CANR_MO60_IPR)

/** \\brief  17AC, Message Object  Acceptance Mask Register */
#define CANR_MO61_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00297ACu)

/** Alias (User Manual Name) for CANR_MO61_AMR.
* To use register names with standard convension, please use CANR_MO61_AMR.
*/
#define	CANR_MOAMR61	(CANR_MO61_AMR)

/** \\brief  17B8, Message Object  Arbitration Register */
#define CANR_MO61_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00297B8u)

/** Alias (User Manual Name) for CANR_MO61_AR.
* To use register names with standard convension, please use CANR_MO61_AR.
*/
#define	CANR_MOAR61	(CANR_MO61_AR)

/** \\brief  17BC, Message Object  Control Register */
#define CANR_MO61_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00297BCu)

/** Alias (User Manual Name) for CANR_MO61_CTR_STAT.
* To use register names with standard convension, please use CANR_MO61_CTR_STAT.
*/
#define	CANR_MOSTAT61	(CANR_MO61_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO61_CTR_STAT.
* To use register names with standard convension, please use CANR_MO61_CTR_STAT.
*/
#define	CANR_MOCTR61	(CANR_MO61_CTR_STAT)

/** \\brief  17B4, Message Object  Data Register High */
#define CANR_MO61_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00297B4u)

/** Alias (User Manual Name) for CANR_MO61_DATAH.
* To use register names with standard convension, please use CANR_MO61_DATAH.
*/
#define	CANR_MODATAH61	(CANR_MO61_DATAH)

/** \\brief  17B0, Message Object  Data Register Low */
#define CANR_MO61_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00297B0u)

/** Alias (User Manual Name) for CANR_MO61_DATAL.
* To use register names with standard convension, please use CANR_MO61_DATAL.
*/
#define	CANR_MODATAL61	(CANR_MO61_DATAL)

/** \\brief  17A0, Message Object  Function Control Register */
#define CANR_MO61_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00297A0u)

/** Alias (User Manual Name) for CANR_MO61_FCR.
* To use register names with standard convension, please use CANR_MO61_FCR.
*/
#define	CANR_MOFCR61	(CANR_MO61_FCR)

/** \\brief  17A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO61_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00297A4u)

/** Alias (User Manual Name) for CANR_MO61_FGPR.
* To use register names with standard convension, please use CANR_MO61_FGPR.
*/
#define	CANR_MOFGPR61	(CANR_MO61_FGPR)

/** \\brief  17A8, Message Object  Interrupt Pointer Register */
#define CANR_MO61_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00297A8u)

/** Alias (User Manual Name) for CANR_MO61_IPR.
* To use register names with standard convension, please use CANR_MO61_IPR.
*/
#define	CANR_MOIPR61	(CANR_MO61_IPR)

/** \\brief  17CC, Message Object  Acceptance Mask Register */
#define CANR_MO62_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00297CCu)

