keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO62_AMR.
* To use register names with standard convension, please use CANR_MO62_AMR.
*/
#define	CANR_MOAMR62	(CANR_MO62_AMR)

/** \\brief  17D8, Message Object  Arbitration Register */
#define CANR_MO62_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00297D8u)

/** Alias (User Manual Name) for CANR_MO62_AR.
* To use register names with standard convension, please use CANR_MO62_AR.
*/
#define	CANR_MOAR62	(CANR_MO62_AR)

/** \\brief  17DC, Message Object  Control Register */
#define CANR_MO62_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00297DCu)

/** Alias (User Manual Name) for CANR_MO62_CTR_STAT.
* To use register names with standard convension, please use CANR_MO62_CTR_STAT.
*/
#define	CANR_MOSTAT62	(CANR_MO62_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO62_CTR_STAT.
* To use register names with standard convension, please use CANR_MO62_CTR_STAT.
*/
#define	CANR_MOCTR62	(CANR_MO62_CTR_STAT)

/** \\brief  17D4, Message Object  Data Register High */
#define CANR_MO62_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00297D4u)

/** Alias (User Manual Name) for CANR_MO62_DATAH.
* To use register names with standard convension, please use CANR_MO62_DATAH.
*/
#define	CANR_MODATAH62	(CANR_MO62_DATAH)

/** \\brief  17D0, Message Object  Data Register Low */
#define CANR_MO62_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00297D0u)

/** Alias (User Manual Name) for CANR_MO62_DATAL.
* To use register names with standard convension, please use CANR_MO62_DATAL.
*/
#define	CANR_MODATAL62	(CANR_MO62_DATAL)

/** \\brief  17C0, Message Object  Function Control Register */
#define CANR_MO62_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00297C0u)

/** Alias (User Manual Name) for CANR_MO62_FCR.
* To use register names with standard convension, please use CANR_MO62_FCR.
*/
#define	CANR_MOFCR62	(CANR_MO62_FCR)

/** \\brief  17C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO62_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00297C4u)

/** Alias (User Manual Name) for CANR_MO62_FGPR.
* To use register names with standard convension, please use CANR_MO62_FGPR.
*/
#define	CANR_MOFGPR62	(CANR_MO62_FGPR)

/** \\brief  17C8, Message Object  Interrupt Pointer Register */
#define CANR_MO62_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00297C8u)

/** Alias (User Manual Name) for CANR_MO62_IPR.
* To use register names with standard convension, please use CANR_MO62_IPR.
*/
#define	CANR_MOIPR62	(CANR_MO62_IPR)

/** \\brief  17EC, Message Object  Acceptance Mask Register */
#define CANR_MO63_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00297ECu)

/** Alias (User Manual Name) for CANR_MO63_AMR.
* To use register names with standard convension, please use CANR_MO63_AMR.
*/
#define	CANR_MOAMR63	(CANR_MO63_AMR)

/** \\brief  17F8, Message Object  Arbitration Register */
#define CANR_MO63_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00297F8u)

/** Alias (User Manual Name) for CANR_MO63_AR.
* To use register names with standard convension, please use CANR_MO63_AR.
*/
#define	CANR_MOAR63	(CANR_MO63_AR)

/** \\brief  17FC, Message Object  Control Register */
#define CANR_MO63_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00297FCu)

/** Alias (User Manual Name) for CANR_MO63_CTR_STAT.
* To use register names with standard convension, please use CANR_MO63_CTR_STAT.
*/
#define	CANR_MOSTAT63	(CANR_MO63_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO63_CTR_STAT.
* To use register names with standard convension, please use CANR_MO63_CTR_STAT.
*/
#define	CANR_MOCTR63	(CANR_MO63_CTR_STAT)

/** \\brief  17F4, Message Object  Data Register High */
#define CANR_MO63_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00297F4u)

/** Alias (User Manual Name) for CANR_MO63_DATAH.
* To use register names with standard convension, please use CANR_MO63_DATAH.
*/
#define	CANR_MODATAH63	(CANR_MO63_DATAH)

/** \\brief  17F0, Message Object  Data Register Low */
#define CANR_MO63_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00297F0u)

/** Alias (User Manual Name) for CANR_MO63_DATAL.
* To use register names with standard convension, please use CANR_MO63_DATAL.
*/
#define	CANR_MODATAL63	(CANR_MO63_DATAL)

/** \\brief  17E0, Message Object  Function Control Register */
#define CANR_MO63_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00297E0u)

/** Alias (User Manual Name) for CANR_MO63_FCR.
* To use register names with standard convension, please use CANR_MO63_FCR.
*/
#define	CANR_MOFCR63	(CANR_MO63_FCR)

/** \\brief  17E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO63_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00297E4u)

/** Alias (User Manual Name) for CANR_MO63_FGPR.
* To use register names with standard convension, please use CANR_MO63_FGPR.
*/
#define	CANR_MOFGPR63	(CANR_MO63_FGPR)

/** \\brief  17E8, Message Object  Interrupt Pointer Register */
#define CANR_MO63_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00297E8u)

/** Alias (User Manual Name) for CANR_MO63_IPR.
* To use register names with standard convension, please use CANR_MO63_IPR.
*/
#define	CANR_MOIPR63	(CANR_MO63_IPR)

/** \\brief  180C, Message Object  Acceptance Mask Register */
#define CANR_MO64_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002980Cu)

/** Alias (User Manual Name) for CANR_MO64_AMR.
* To use register names with standard convension, please use CANR_MO64_AMR.
*/
#define	CANR_MOAMR64	(CANR_MO64_AMR)

/** \\brief  1818, Message Object  Arbitration Register */
#define CANR_MO64_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029818u)

/** Alias (User Manual Name) for CANR_MO64_AR.
* To use register names with standard convension, please use CANR_MO64_AR.
*/
#define	CANR_MOAR64	(CANR_MO64_AR)

