keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1844, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO66_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029844u)

/** Alias (User Manual Name) for CANR_MO66_FGPR.
* To use register names with standard convension, please use CANR_MO66_FGPR.
*/
#define	CANR_MOFGPR66	(CANR_MO66_FGPR)

/** \\brief  1848, Message Object  Interrupt Pointer Register */
#define CANR_MO66_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029848u)

/** Alias (User Manual Name) for CANR_MO66_IPR.
* To use register names with standard convension, please use CANR_MO66_IPR.
*/
#define	CANR_MOIPR66	(CANR_MO66_IPR)

/** \\brief  186C, Message Object  Acceptance Mask Register */
#define CANR_MO67_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002986Cu)

/** Alias (User Manual Name) for CANR_MO67_AMR.
* To use register names with standard convension, please use CANR_MO67_AMR.
*/
#define	CANR_MOAMR67	(CANR_MO67_AMR)

/** \\brief  1878, Message Object  Arbitration Register */
#define CANR_MO67_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029878u)

/** Alias (User Manual Name) for CANR_MO67_AR.
* To use register names with standard convension, please use CANR_MO67_AR.
*/
#define	CANR_MOAR67	(CANR_MO67_AR)

/** \\brief  187C, Message Object  Control Register */
#define CANR_MO67_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002987Cu)

/** Alias (User Manual Name) for CANR_MO67_CTR_STAT.
* To use register names with standard convension, please use CANR_MO67_CTR_STAT.
*/
#define	CANR_MOSTAT67	(CANR_MO67_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO67_CTR_STAT.
* To use register names with standard convension, please use CANR_MO67_CTR_STAT.
*/
#define	CANR_MOCTR67	(CANR_MO67_CTR_STAT)

/** \\brief  1874, Message Object  Data Register High */
#define CANR_MO67_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029874u)

/** Alias (User Manual Name) for CANR_MO67_DATAH.
* To use register names with standard convension, please use CANR_MO67_DATAH.
*/
#define	CANR_MODATAH67	(CANR_MO67_DATAH)

/** \\brief  1870, Message Object  Data Register Low */
#define CANR_MO67_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029870u)

/** Alias (User Manual Name) for CANR_MO67_DATAL.
* To use register names with standard convension, please use CANR_MO67_DATAL.
*/
#define	CANR_MODATAL67	(CANR_MO67_DATAL)

/** \\brief  1860, Message Object  Function Control Register */
#define CANR_MO67_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029860u)

/** Alias (User Manual Name) for CANR_MO67_FCR.
* To use register names with standard convension, please use CANR_MO67_FCR.
*/
#define	CANR_MOFCR67	(CANR_MO67_FCR)

/** \\brief  1864, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO67_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029864u)

/** Alias (User Manual Name) for CANR_MO67_FGPR.
* To use register names with standard convension, please use CANR_MO67_FGPR.
*/
#define	CANR_MOFGPR67	(CANR_MO67_FGPR)

/** \\brief  1868, Message Object  Interrupt Pointer Register */
#define CANR_MO67_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029868u)

/** Alias (User Manual Name) for CANR_MO67_IPR.
* To use register names with standard convension, please use CANR_MO67_IPR.
*/
#define	CANR_MOIPR67	(CANR_MO67_IPR)

/** \\brief  188C, Message Object  Acceptance Mask Register */
#define CANR_MO68_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002988Cu)

/** Alias (User Manual Name) for CANR_MO68_AMR.
* To use register names with standard convension, please use CANR_MO68_AMR.
*/
#define	CANR_MOAMR68	(CANR_MO68_AMR)

/** \\brief  1898, Message Object  Arbitration Register */
#define CANR_MO68_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029898u)

/** Alias (User Manual Name) for CANR_MO68_AR.
* To use register names with standard convension, please use CANR_MO68_AR.
*/
#define	CANR_MOAR68	(CANR_MO68_AR)

/** \\brief  189C, Message Object  Control Register */
#define CANR_MO68_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002989Cu)

/** Alias (User Manual Name) for CANR_MO68_CTR_STAT.
* To use register names with standard convension, please use CANR_MO68_CTR_STAT.
*/
#define	CANR_MOSTAT68	(CANR_MO68_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO68_CTR_STAT.
* To use register names with standard convension, please use CANR_MO68_CTR_STAT.
*/
#define	CANR_MOCTR68	(CANR_MO68_CTR_STAT)

/** \\brief  1894, Message Object  Data Register High */
#define CANR_MO68_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029894u)

/** Alias (User Manual Name) for CANR_MO68_DATAH.
* To use register names with standard convension, please use CANR_MO68_DATAH.
*/
#define	CANR_MODATAH68	(CANR_MO68_DATAH)

/** \\brief  1890, Message Object  Data Register Low */
#define CANR_MO68_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029890u)

/** Alias (User Manual Name) for CANR_MO68_DATAL.
* To use register names with standard convension, please use CANR_MO68_DATAL.
*/
#define	CANR_MODATAL68	(CANR_MO68_DATAL)

/** \\brief  1880, Message Object  Function Control Register */
#define CANR_MO68_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029880u)

/** Alias (User Manual Name) for CANR_MO68_FCR.
* To use register names with standard convension, please use CANR_MO68_FCR.
*/
#define	CANR_MOFCR68	(CANR_MO68_FCR)

/** \\brief  1884, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO68_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029884u)

/** Alias (User Manual Name) for CANR_MO68_FGPR.
* To use register names with standard convension, please use CANR_MO68_FGPR.
*/
#define	CANR_MOFGPR68	(CANR_MO68_FGPR)

/** \\brief  1888, Message Object  Interrupt Pointer Register */
#define CANR_MO68_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029888u)

/** Alias (User Manual Name) for CANR_MO68_IPR.
* To use register names with standard convension, please use CANR_MO68_IPR.
*/
#define	CANR_MOIPR68	(CANR_MO68_IPR)

/** \\brief  18AC, Message Object  Acceptance Mask Register */
#define CANR_MO69_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00298ACu)

/** Alias (User Manual Name) for CANR_MO69_AMR.
* To use register names with standard convension, please use CANR_MO69_AMR.
*/
#define	CANR_MOAMR69	(CANR_MO69_AMR)

