keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO70_CTR_STAT.
* To use register names with standard convension, please use CANR_MO70_CTR_STAT.
*/
#define	CANR_MOCTR70	(CANR_MO70_CTR_STAT)

/** \\brief  18D4, Message Object  Data Register High */
#define CANR_MO70_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00298D4u)

/** Alias (User Manual Name) for CANR_MO70_DATAH.
* To use register names with standard convension, please use CANR_MO70_DATAH.
*/
#define	CANR_MODATAH70	(CANR_MO70_DATAH)

/** \\brief  18D0, Message Object  Data Register Low */
#define CANR_MO70_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00298D0u)

/** Alias (User Manual Name) for CANR_MO70_DATAL.
* To use register names with standard convension, please use CANR_MO70_DATAL.
*/
#define	CANR_MODATAL70	(CANR_MO70_DATAL)

/** \\brief  18C0, Message Object  Function Control Register */
#define CANR_MO70_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00298C0u)

/** Alias (User Manual Name) for CANR_MO70_FCR.
* To use register names with standard convension, please use CANR_MO70_FCR.
*/
#define	CANR_MOFCR70	(CANR_MO70_FCR)

/** \\brief  18C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO70_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00298C4u)

/** Alias (User Manual Name) for CANR_MO70_FGPR.
* To use register names with standard convension, please use CANR_MO70_FGPR.
*/
#define	CANR_MOFGPR70	(CANR_MO70_FGPR)

/** \\brief  18C8, Message Object  Interrupt Pointer Register */
#define CANR_MO70_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00298C8u)

/** Alias (User Manual Name) for CANR_MO70_IPR.
* To use register names with standard convension, please use CANR_MO70_IPR.
*/
#define	CANR_MOIPR70	(CANR_MO70_IPR)

/** \\brief  18EC, Message Object  Acceptance Mask Register */
#define CANR_MO71_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00298ECu)

/** Alias (User Manual Name) for CANR_MO71_AMR.
* To use register names with standard convension, please use CANR_MO71_AMR.
*/
#define	CANR_MOAMR71	(CANR_MO71_AMR)

/** \\brief  18F8, Message Object  Arbitration Register */
#define CANR_MO71_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00298F8u)

/** Alias (User Manual Name) for CANR_MO71_AR.
* To use register names with standard convension, please use CANR_MO71_AR.
*/
#define	CANR_MOAR71	(CANR_MO71_AR)

/** \\brief  18FC, Message Object  Control Register */
#define CANR_MO71_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00298FCu)

/** Alias (User Manual Name) for CANR_MO71_CTR_STAT.
* To use register names with standard convension, please use CANR_MO71_CTR_STAT.
*/
#define	CANR_MOSTAT71	(CANR_MO71_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO71_CTR_STAT.
* To use register names with standard convension, please use CANR_MO71_CTR_STAT.
*/
#define	CANR_MOCTR71	(CANR_MO71_CTR_STAT)

/** \\brief  18F4, Message Object  Data Register High */
#define CANR_MO71_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00298F4u)

/** Alias (User Manual Name) for CANR_MO71_DATAH.
* To use register names with standard convension, please use CANR_MO71_DATAH.
*/
#define	CANR_MODATAH71	(CANR_MO71_DATAH)

/** \\brief  18F0, Message Object  Data Register Low */
#define CANR_MO71_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00298F0u)

/** Alias (User Manual Name) for CANR_MO71_DATAL.
* To use register names with standard convension, please use CANR_MO71_DATAL.
*/
#define	CANR_MODATAL71	(CANR_MO71_DATAL)

/** \\brief  18E0, Message Object  Function Control Register */
#define CANR_MO71_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00298E0u)

/** Alias (User Manual Name) for CANR_MO71_FCR.
* To use register names with standard convension, please use CANR_MO71_FCR.
*/
#define	CANR_MOFCR71	(CANR_MO71_FCR)

/** \\brief  18E4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO71_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00298E4u)

/** Alias (User Manual Name) for CANR_MO71_FGPR.
* To use register names with standard convension, please use CANR_MO71_FGPR.
*/
#define	CANR_MOFGPR71	(CANR_MO71_FGPR)

/** \\brief  18E8, Message Object  Interrupt Pointer Register */
#define CANR_MO71_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00298E8u)

/** Alias (User Manual Name) for CANR_MO71_IPR.
* To use register names with standard convension, please use CANR_MO71_IPR.
*/
#define	CANR_MOIPR71	(CANR_MO71_IPR)

/** \\brief  190C, Message Object  Acceptance Mask Register */
#define CANR_MO72_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002990Cu)

/** Alias (User Manual Name) for CANR_MO72_AMR.
* To use register names with standard convension, please use CANR_MO72_AMR.
*/
#define	CANR_MOAMR72	(CANR_MO72_AMR)

/** \\brief  1918, Message Object  Arbitration Register */
#define CANR_MO72_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029918u)

/** Alias (User Manual Name) for CANR_MO72_AR.
* To use register names with standard convension, please use CANR_MO72_AR.
*/
#define	CANR_MOAR72	(CANR_MO72_AR)

/** \\brief  191C, Message Object  Control Register */
#define CANR_MO72_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002991Cu)

/** Alias (User Manual Name) for CANR_MO72_CTR_STAT.
* To use register names with standard convension, please use CANR_MO72_CTR_STAT.
*/
#define	CANR_MOSTAT72	(CANR_MO72_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO72_CTR_STAT.
* To use register names with standard convension, please use CANR_MO72_CTR_STAT.
*/
#define	CANR_MOCTR72	(CANR_MO72_CTR_STAT)

/** \\brief  1914, Message Object  Data Register High */
#define CANR_MO72_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029914u)

/** Alias (User Manual Name) for CANR_MO72_DATAH.
* To use register names with standard convension, please use CANR_MO72_DATAH.
*/
#define	CANR_MODATAH72	(CANR_MO72_DATAH)

/** \\brief  1910, Message Object  Data Register Low */
#define CANR_MO72_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029910u)

