keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO72_DATAL.
* To use register names with standard convension, please use CANR_MO72_DATAL.
*/
#define	CANR_MODATAL72	(CANR_MO72_DATAL)

/** \\brief  1900, Message Object  Function Control Register */
#define CANR_MO72_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029900u)

/** Alias (User Manual Name) for CANR_MO72_FCR.
* To use register names with standard convension, please use CANR_MO72_FCR.
*/
#define	CANR_MOFCR72	(CANR_MO72_FCR)

/** \\brief  1904, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO72_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029904u)

/** Alias (User Manual Name) for CANR_MO72_FGPR.
* To use register names with standard convension, please use CANR_MO72_FGPR.
*/
#define	CANR_MOFGPR72	(CANR_MO72_FGPR)

/** \\brief  1908, Message Object  Interrupt Pointer Register */
#define CANR_MO72_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029908u)

/** Alias (User Manual Name) for CANR_MO72_IPR.
* To use register names with standard convension, please use CANR_MO72_IPR.
*/
#define	CANR_MOIPR72	(CANR_MO72_IPR)

/** \\brief  192C, Message Object  Acceptance Mask Register */
#define CANR_MO73_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002992Cu)

/** Alias (User Manual Name) for CANR_MO73_AMR.
* To use register names with standard convension, please use CANR_MO73_AMR.
*/
#define	CANR_MOAMR73	(CANR_MO73_AMR)

/** \\brief  1938, Message Object  Arbitration Register */
#define CANR_MO73_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029938u)

/** Alias (User Manual Name) for CANR_MO73_AR.
* To use register names with standard convension, please use CANR_MO73_AR.
*/
#define	CANR_MOAR73	(CANR_MO73_AR)

/** \\brief  193C, Message Object  Control Register */
#define CANR_MO73_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002993Cu)

/** Alias (User Manual Name) for CANR_MO73_CTR_STAT.
* To use register names with standard convension, please use CANR_MO73_CTR_STAT.
*/
#define	CANR_MOSTAT73	(CANR_MO73_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO73_CTR_STAT.
* To use register names with standard convension, please use CANR_MO73_CTR_STAT.
*/
#define	CANR_MOCTR73	(CANR_MO73_CTR_STAT)

/** \\brief  1934, Message Object  Data Register High */
#define CANR_MO73_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029934u)

/** Alias (User Manual Name) for CANR_MO73_DATAH.
* To use register names with standard convension, please use CANR_MO73_DATAH.
*/
#define	CANR_MODATAH73	(CANR_MO73_DATAH)

/** \\brief  1930, Message Object  Data Register Low */
#define CANR_MO73_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029930u)

/** Alias (User Manual Name) for CANR_MO73_DATAL.
* To use register names with standard convension, please use CANR_MO73_DATAL.
*/
#define	CANR_MODATAL73	(CANR_MO73_DATAL)

/** \\brief  1920, Message Object  Function Control Register */
#define CANR_MO73_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029920u)

/** Alias (User Manual Name) for CANR_MO73_FCR.
* To use register names with standard convension, please use CANR_MO73_FCR.
*/
#define	CANR_MOFCR73	(CANR_MO73_FCR)

/** \\brief  1924, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO73_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029924u)

/** Alias (User Manual Name) for CANR_MO73_FGPR.
* To use register names with standard convension, please use CANR_MO73_FGPR.
*/
#define	CANR_MOFGPR73	(CANR_MO73_FGPR)

/** \\brief  1928, Message Object  Interrupt Pointer Register */
#define CANR_MO73_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029928u)

/** Alias (User Manual Name) for CANR_MO73_IPR.
* To use register names with standard convension, please use CANR_MO73_IPR.
*/
#define	CANR_MOIPR73	(CANR_MO73_IPR)

/** \\brief  194C, Message Object  Acceptance Mask Register */
#define CANR_MO74_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002994Cu)

/** Alias (User Manual Name) for CANR_MO74_AMR.
* To use register names with standard convension, please use CANR_MO74_AMR.
*/
#define	CANR_MOAMR74	(CANR_MO74_AMR)

/** \\brief  1958, Message Object  Arbitration Register */
#define CANR_MO74_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029958u)

/** Alias (User Manual Name) for CANR_MO74_AR.
* To use register names with standard convension, please use CANR_MO74_AR.
*/
#define	CANR_MOAR74	(CANR_MO74_AR)

/** \\brief  195C, Message Object  Control Register */
#define CANR_MO74_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002995Cu)

/** Alias (User Manual Name) for CANR_MO74_CTR_STAT.
* To use register names with standard convension, please use CANR_MO74_CTR_STAT.
*/
#define	CANR_MOSTAT74	(CANR_MO74_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO74_CTR_STAT.
* To use register names with standard convension, please use CANR_MO74_CTR_STAT.
*/
#define	CANR_MOCTR74	(CANR_MO74_CTR_STAT)

/** \\brief  1954, Message Object  Data Register High */
#define CANR_MO74_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029954u)

/** Alias (User Manual Name) for CANR_MO74_DATAH.
* To use register names with standard convension, please use CANR_MO74_DATAH.
*/
#define	CANR_MODATAH74	(CANR_MO74_DATAH)

/** \\brief  1950, Message Object  Data Register Low */
#define CANR_MO74_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029950u)

/** Alias (User Manual Name) for CANR_MO74_DATAL.
* To use register names with standard convension, please use CANR_MO74_DATAL.
*/
#define	CANR_MODATAL74	(CANR_MO74_DATAL)

/** \\brief  1940, Message Object  Function Control Register */
#define CANR_MO74_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029940u)

/** Alias (User Manual Name) for CANR_MO74_FCR.
* To use register names with standard convension, please use CANR_MO74_FCR.
*/
#define	CANR_MOFCR74	(CANR_MO74_FCR)

/** \\brief  1944, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO74_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029944u)

