keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO77_AR.
* To use register names with standard convension, please use CANR_MO77_AR.
*/
#define	CANR_MOAR77	(CANR_MO77_AR)

/** \\brief  19BC, Message Object  Control Register */
#define CANR_MO77_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00299BCu)

/** Alias (User Manual Name) for CANR_MO77_CTR_STAT.
* To use register names with standard convension, please use CANR_MO77_CTR_STAT.
*/
#define	CANR_MOSTAT77	(CANR_MO77_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO77_CTR_STAT.
* To use register names with standard convension, please use CANR_MO77_CTR_STAT.
*/
#define	CANR_MOCTR77	(CANR_MO77_CTR_STAT)

/** \\brief  19B4, Message Object  Data Register High */
#define CANR_MO77_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00299B4u)

/** Alias (User Manual Name) for CANR_MO77_DATAH.
* To use register names with standard convension, please use CANR_MO77_DATAH.
*/
#define	CANR_MODATAH77	(CANR_MO77_DATAH)

/** \\brief  19B0, Message Object  Data Register Low */
#define CANR_MO77_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00299B0u)

/** Alias (User Manual Name) for CANR_MO77_DATAL.
* To use register names with standard convension, please use CANR_MO77_DATAL.
*/
#define	CANR_MODATAL77	(CANR_MO77_DATAL)

/** \\brief  19A0, Message Object  Function Control Register */
#define CANR_MO77_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00299A0u)

/** Alias (User Manual Name) for CANR_MO77_FCR.
* To use register names with standard convension, please use CANR_MO77_FCR.
*/
#define	CANR_MOFCR77	(CANR_MO77_FCR)

/** \\brief  19A4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO77_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00299A4u)

/** Alias (User Manual Name) for CANR_MO77_FGPR.
* To use register names with standard convension, please use CANR_MO77_FGPR.
*/
#define	CANR_MOFGPR77	(CANR_MO77_FGPR)

/** \\brief  19A8, Message Object  Interrupt Pointer Register */
#define CANR_MO77_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00299A8u)

/** Alias (User Manual Name) for CANR_MO77_IPR.
* To use register names with standard convension, please use CANR_MO77_IPR.
*/
#define	CANR_MOIPR77	(CANR_MO77_IPR)

/** \\brief  19CC, Message Object  Acceptance Mask Register */
#define CANR_MO78_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00299CCu)

/** Alias (User Manual Name) for CANR_MO78_AMR.
* To use register names with standard convension, please use CANR_MO78_AMR.
*/
#define	CANR_MOAMR78	(CANR_MO78_AMR)

/** \\brief  19D8, Message Object  Arbitration Register */
#define CANR_MO78_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00299D8u)

/** Alias (User Manual Name) for CANR_MO78_AR.
* To use register names with standard convension, please use CANR_MO78_AR.
*/
#define	CANR_MOAR78	(CANR_MO78_AR)

/** \\brief  19DC, Message Object  Control Register */
#define CANR_MO78_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00299DCu)

/** Alias (User Manual Name) for CANR_MO78_CTR_STAT.
* To use register names with standard convension, please use CANR_MO78_CTR_STAT.
*/
#define	CANR_MOSTAT78	(CANR_MO78_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO78_CTR_STAT.
* To use register names with standard convension, please use CANR_MO78_CTR_STAT.
*/
#define	CANR_MOCTR78	(CANR_MO78_CTR_STAT)

/** \\brief  19D4, Message Object  Data Register High */
#define CANR_MO78_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00299D4u)

/** Alias (User Manual Name) for CANR_MO78_DATAH.
* To use register names with standard convension, please use CANR_MO78_DATAH.
*/
#define	CANR_MODATAH78	(CANR_MO78_DATAH)

/** \\brief  19D0, Message Object  Data Register Low */
#define CANR_MO78_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00299D0u)

/** Alias (User Manual Name) for CANR_MO78_DATAL.
* To use register names with standard convension, please use CANR_MO78_DATAL.
*/
#define	CANR_MODATAL78	(CANR_MO78_DATAL)

/** \\brief  19C0, Message Object  Function Control Register */
#define CANR_MO78_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00299C0u)

/** Alias (User Manual Name) for CANR_MO78_FCR.
* To use register names with standard convension, please use CANR_MO78_FCR.
*/
#define	CANR_MOFCR78	(CANR_MO78_FCR)

/** \\brief  19C4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO78_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00299C4u)

/** Alias (User Manual Name) for CANR_MO78_FGPR.
* To use register names with standard convension, please use CANR_MO78_FGPR.
*/
#define	CANR_MOFGPR78	(CANR_MO78_FGPR)

/** \\brief  19C8, Message Object  Interrupt Pointer Register */
#define CANR_MO78_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00299C8u)

/** Alias (User Manual Name) for CANR_MO78_IPR.
* To use register names with standard convension, please use CANR_MO78_IPR.
*/
#define	CANR_MOIPR78	(CANR_MO78_IPR)

/** \\brief  19EC, Message Object  Acceptance Mask Register */
#define CANR_MO79_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00299ECu)

/** Alias (User Manual Name) for CANR_MO79_AMR.
* To use register names with standard convension, please use CANR_MO79_AMR.
*/
#define	CANR_MOAMR79	(CANR_MO79_AMR)

/** \\brief  19F8, Message Object  Arbitration Register */
#define CANR_MO79_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00299F8u)

/** Alias (User Manual Name) for CANR_MO79_AR.
* To use register names with standard convension, please use CANR_MO79_AR.
*/
#define	CANR_MOAR79	(CANR_MO79_AR)

/** \\brief  19FC, Message Object  Control Register */
#define CANR_MO79_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00299FCu)

/** Alias (User Manual Name) for CANR_MO79_CTR_STAT.
* To use register names with standard convension, please use CANR_MO79_CTR_STAT.
*/
#define	CANR_MOSTAT79	(CANR_MO79_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO79_CTR_STAT.
* To use register names with standard convension, please use CANR_MO79_CTR_STAT.
*/
#define	CANR_MOCTR79	(CANR_MO79_CTR_STAT)

/** \\brief  19F4, Message Object  Data Register High */
#define CANR_MO79_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00299F4u)

/** Alias (User Manual Name) for CANR_MO79_DATAH.
* To use register names with standard convension, please use CANR_MO79_DATAH.
*/
#define	CANR_MODATAH79	(CANR_MO79_DATAH)

/** \\brief  19F0, Message Object  Data Register Low */
#define CANR_MO79_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00299F0u)

/** Alias (User Manual Name) for CANR_MO79_DATAL.
* To use register names with standard convension, please use CANR_MO79_DATAL.
*/
#define	CANR_MODATAL79	(CANR_MO79_DATAL)

/** \\brief  19E0, Message Object  Function Control Register */
#define CANR_MO79_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00299E0u)

