keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO88_FCR.
* To use register names with standard convension, please use CANR_MO88_FCR.
*/
#define	CANR_MOFCR88	(CANR_MO88_FCR)

/** \\brief  1B04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO88_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029B04u)

/** Alias (User Manual Name) for CANR_MO88_FGPR.
* To use register names with standard convension, please use CANR_MO88_FGPR.
*/
#define	CANR_MOFGPR88	(CANR_MO88_FGPR)

/** \\brief  1B08, Message Object  Interrupt Pointer Register */
#define CANR_MO88_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029B08u)

/** Alias (User Manual Name) for CANR_MO88_IPR.
* To use register names with standard convension, please use CANR_MO88_IPR.
*/
#define	CANR_MOIPR88	(CANR_MO88_IPR)

/** \\brief  1B2C, Message Object  Acceptance Mask Register */
#define CANR_MO89_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029B2Cu)

/** Alias (User Manual Name) for CANR_MO89_AMR.
* To use register names with standard convension, please use CANR_MO89_AMR.
*/
#define	CANR_MOAMR89	(CANR_MO89_AMR)

/** \\brief  1B38, Message Object  Arbitration Register */
#define CANR_MO89_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029B38u)

/** Alias (User Manual Name) for CANR_MO89_AR.
* To use register names with standard convension, please use CANR_MO89_AR.
*/
#define	CANR_MOAR89	(CANR_MO89_AR)

/** \\brief  1B3C, Message Object  Control Register */
#define CANR_MO89_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029B3Cu)

/** Alias (User Manual Name) for CANR_MO89_CTR_STAT.
* To use register names with standard convension, please use CANR_MO89_CTR_STAT.
*/
#define	CANR_MOSTAT89	(CANR_MO89_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO89_CTR_STAT.
* To use register names with standard convension, please use CANR_MO89_CTR_STAT.
*/
#define	CANR_MOCTR89	(CANR_MO89_CTR_STAT)

/** \\brief  1B34, Message Object  Data Register High */
#define CANR_MO89_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029B34u)

/** Alias (User Manual Name) for CANR_MO89_DATAH.
* To use register names with standard convension, please use CANR_MO89_DATAH.
*/
#define	CANR_MODATAH89	(CANR_MO89_DATAH)

/** \\brief  1B30, Message Object  Data Register Low */
#define CANR_MO89_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029B30u)

/** Alias (User Manual Name) for CANR_MO89_DATAL.
* To use register names with standard convension, please use CANR_MO89_DATAL.
*/
#define	CANR_MODATAL89	(CANR_MO89_DATAL)

/** \\brief  1B20, Message Object  Function Control Register */
#define CANR_MO89_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029B20u)

/** Alias (User Manual Name) for CANR_MO89_FCR.
* To use register names with standard convension, please use CANR_MO89_FCR.
*/
#define	CANR_MOFCR89	(CANR_MO89_FCR)

/** \\brief  1B24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO89_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029B24u)

/** Alias (User Manual Name) for CANR_MO89_FGPR.
* To use register names with standard convension, please use CANR_MO89_FGPR.
*/
#define	CANR_MOFGPR89	(CANR_MO89_FGPR)

/** \\brief  1B28, Message Object  Interrupt Pointer Register */
#define CANR_MO89_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029B28u)

/** Alias (User Manual Name) for CANR_MO89_IPR.
* To use register names with standard convension, please use CANR_MO89_IPR.
*/
#define	CANR_MOIPR89	(CANR_MO89_IPR)

/** \\brief  110C, Message Object  Acceptance Mask Register */
#define CANR_MO8_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002910Cu)

/** Alias (User Manual Name) for CANR_MO8_AMR.
* To use register names with standard convension, please use CANR_MO8_AMR.
*/
#define	CANR_MOAMR8	(CANR_MO8_AMR)

/** \\brief  1118, Message Object  Arbitration Register */
#define CANR_MO8_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029118u)

/** Alias (User Manual Name) for CANR_MO8_AR.
* To use register names with standard convension, please use CANR_MO8_AR.
*/
#define	CANR_MOAR8	(CANR_MO8_AR)

/** \\brief  111C, Message Object  Control Register */
#define CANR_MO8_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002911Cu)

/** Alias (User Manual Name) for CANR_MO8_CTR_STAT.
* To use register names with standard convension, please use CANR_MO8_CTR_STAT.
*/
#define	CANR_MOSTAT8	(CANR_MO8_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO8_CTR_STAT.
* To use register names with standard convension, please use CANR_MO8_CTR_STAT.
*/
#define	CANR_MOCTR8	(CANR_MO8_CTR_STAT)

/** \\brief  1114, Message Object  Data Register High */
#define CANR_MO8_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029114u)

/** Alias (User Manual Name) for CANR_MO8_DATAH.
* To use register names with standard convension, please use CANR_MO8_DATAH.
*/
#define	CANR_MODATAH8	(CANR_MO8_DATAH)

/** \\brief  1110, Message Object  Data Register Low */
#define CANR_MO8_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029110u)

/** Alias (User Manual Name) for CANR_MO8_DATAL.
* To use register names with standard convension, please use CANR_MO8_DATAL.
*/
#define	CANR_MODATAL8	(CANR_MO8_DATAL)

/** \\brief  1100, Message Object  Function Control Register */
#define CANR_MO8_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029100u)

/** Alias (User Manual Name) for CANR_MO8_FCR.
* To use register names with standard convension, please use CANR_MO8_FCR.
*/
#define	CANR_MOFCR8	(CANR_MO8_FCR)

/** \\brief  1104, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO8_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029104u)

/** Alias (User Manual Name) for CANR_MO8_FGPR.
* To use register names with standard convension, please use CANR_MO8_FGPR.
*/
#define	CANR_MOFGPR8	(CANR_MO8_FGPR)

/** \\brief  1108, Message Object  Interrupt Pointer Register */
#define CANR_MO8_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029108u)

/** Alias (User Manual Name) for CANR_MO8_IPR.
* To use register names with standard convension, please use CANR_MO8_IPR.
*/
#define	CANR_MOIPR8	(CANR_MO8_IPR)

