keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** Alias (User Manual Name) for CANR_MO95_AR.
* To use register names with standard convension, please use CANR_MO95_AR.
*/
#define	CANR_MOAR95	(CANR_MO95_AR)

/** \\brief  1BFC, Message Object  Control Register */
#define CANR_MO95_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029BFCu)

/** Alias (User Manual Name) for CANR_MO95_CTR_STAT.
* To use register names with standard convension, please use CANR_MO95_CTR_STAT.
*/
#define	CANR_MOSTAT95	(CANR_MO95_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO95_CTR_STAT.
* To use register names with standard convension, please use CANR_MO95_CTR_STAT.
*/
#define	CANR_MOCTR95	(CANR_MO95_CTR_STAT)

/** \\brief  1BF4, Message Object  Data Register High */
#define CANR_MO95_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029BF4u)

/** Alias (User Manual Name) for CANR_MO95_DATAH.
* To use register names with standard convension, please use CANR_MO95_DATAH.
*/
#define	CANR_MODATAH95	(CANR_MO95_DATAH)

/** \\brief  1BF0, Message Object  Data Register Low */
#define CANR_MO95_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029BF0u)

/** Alias (User Manual Name) for CANR_MO95_DATAL.
* To use register names with standard convension, please use CANR_MO95_DATAL.
*/
#define	CANR_MODATAL95	(CANR_MO95_DATAL)

/** \\brief  1BE0, Message Object  Function Control Register */
#define CANR_MO95_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029BE0u)

/** Alias (User Manual Name) for CANR_MO95_FCR.
* To use register names with standard convension, please use CANR_MO95_FCR.
*/
#define	CANR_MOFCR95	(CANR_MO95_FCR)

/** \\brief  1BE4, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO95_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029BE4u)

/** Alias (User Manual Name) for CANR_MO95_FGPR.
* To use register names with standard convension, please use CANR_MO95_FGPR.
*/
#define	CANR_MOFGPR95	(CANR_MO95_FGPR)

/** \\brief  1BE8, Message Object  Interrupt Pointer Register */
#define CANR_MO95_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029BE8u)

/** Alias (User Manual Name) for CANR_MO95_IPR.
* To use register names with standard convension, please use CANR_MO95_IPR.
*/
#define	CANR_MOIPR95	(CANR_MO95_IPR)

/** \\brief  1C0C, Message Object  Acceptance Mask Register */
#define CANR_MO96_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C0Cu)

/** Alias (User Manual Name) for CANR_MO96_AMR.
* To use register names with standard convension, please use CANR_MO96_AMR.
*/
#define	CANR_MOAMR96	(CANR_MO96_AMR)

/** \\brief  1C18, Message Object  Arbitration Register */
#define CANR_MO96_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C18u)

/** Alias (User Manual Name) for CANR_MO96_AR.
* To use register names with standard convension, please use CANR_MO96_AR.
*/
#define	CANR_MOAR96	(CANR_MO96_AR)

/** \\brief  1C1C, Message Object  Control Register */
#define CANR_MO96_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029C1Cu)

/** Alias (User Manual Name) for CANR_MO96_CTR_STAT.
* To use register names with standard convension, please use CANR_MO96_CTR_STAT.
*/
#define	CANR_MOSTAT96	(CANR_MO96_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO96_CTR_STAT.
* To use register names with standard convension, please use CANR_MO96_CTR_STAT.
*/
#define	CANR_MOCTR96	(CANR_MO96_CTR_STAT)

/** \\brief  1C14, Message Object  Data Register High */
#define CANR_MO96_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C14u)

/** Alias (User Manual Name) for CANR_MO96_DATAH.
* To use register names with standard convension, please use CANR_MO96_DATAH.
*/
#define	CANR_MODATAH96	(CANR_MO96_DATAH)

/** \\brief  1C10, Message Object  Data Register Low */
#define CANR_MO96_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C10u)

/** Alias (User Manual Name) for CANR_MO96_DATAL.
* To use register names with standard convension, please use CANR_MO96_DATAL.
*/
#define	CANR_MODATAL96	(CANR_MO96_DATAL)

/** \\brief  1C00, Message Object  Function Control Register */
#define CANR_MO96_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C00u)

/** Alias (User Manual Name) for CANR_MO96_FCR.
* To use register names with standard convension, please use CANR_MO96_FCR.
*/
#define	CANR_MOFCR96	(CANR_MO96_FCR)

/** \\brief  1C04, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO96_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C04u)

/** Alias (User Manual Name) for CANR_MO96_FGPR.
* To use register names with standard convension, please use CANR_MO96_FGPR.
*/
#define	CANR_MOFGPR96	(CANR_MO96_FGPR)

/** \\brief  1C08, Message Object  Interrupt Pointer Register */
#define CANR_MO96_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C08u)

/** Alias (User Manual Name) for CANR_MO96_IPR.
* To use register names with standard convension, please use CANR_MO96_IPR.
*/
#define	CANR_MOIPR96	(CANR_MO96_IPR)

/** \\brief  1C2C, Message Object  Acceptance Mask Register */
#define CANR_MO97_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C2Cu)

/** Alias (User Manual Name) for CANR_MO97_AMR.
* To use register names with standard convension, please use CANR_MO97_AMR.
*/
#define	CANR_MOAMR97	(CANR_MO97_AMR)

/** \\brief  1C38, Message Object  Arbitration Register */
#define CANR_MO97_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C38u)

/** Alias (User Manual Name) for CANR_MO97_AR.
* To use register names with standard convension, please use CANR_MO97_AR.
*/
#define	CANR_MOAR97	(CANR_MO97_AR)

/** \\brief  1C3C, Message Object  Control Register */
#define CANR_MO97_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029C3Cu)

/** Alias (User Manual Name) for CANR_MO97_CTR_STAT.
* To use register names with standard convension, please use CANR_MO97_CTR_STAT.
*/
#define	CANR_MOSTAT97	(CANR_MO97_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO97_CTR_STAT.
* To use register names with standard convension, please use CANR_MO97_CTR_STAT.
*/
#define	CANR_MOCTR97	(CANR_MO97_CTR_STAT)

