keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  1C34, Message Object  Data Register High */
#define CANR_MO97_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C34u)

/** Alias (User Manual Name) for CANR_MO97_DATAH.
* To use register names with standard convension, please use CANR_MO97_DATAH.
*/
#define	CANR_MODATAH97	(CANR_MO97_DATAH)

/** \\brief  1C30, Message Object  Data Register Low */
#define CANR_MO97_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C30u)

/** Alias (User Manual Name) for CANR_MO97_DATAL.
* To use register names with standard convension, please use CANR_MO97_DATAL.
*/
#define	CANR_MODATAL97	(CANR_MO97_DATAL)

/** \\brief  1C20, Message Object  Function Control Register */
#define CANR_MO97_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C20u)

/** Alias (User Manual Name) for CANR_MO97_FCR.
* To use register names with standard convension, please use CANR_MO97_FCR.
*/
#define	CANR_MOFCR97	(CANR_MO97_FCR)

/** \\brief  1C24, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO97_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C24u)

/** Alias (User Manual Name) for CANR_MO97_FGPR.
* To use register names with standard convension, please use CANR_MO97_FGPR.
*/
#define	CANR_MOFGPR97	(CANR_MO97_FGPR)

/** \\brief  1C28, Message Object  Interrupt Pointer Register */
#define CANR_MO97_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C28u)

/** Alias (User Manual Name) for CANR_MO97_IPR.
* To use register names with standard convension, please use CANR_MO97_IPR.
*/
#define	CANR_MOIPR97	(CANR_MO97_IPR)

/** \\brief  1C4C, Message Object  Acceptance Mask Register */
#define CANR_MO98_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C4Cu)

/** Alias (User Manual Name) for CANR_MO98_AMR.
* To use register names with standard convension, please use CANR_MO98_AMR.
*/
#define	CANR_MOAMR98	(CANR_MO98_AMR)

/** \\brief  1C58, Message Object  Arbitration Register */
#define CANR_MO98_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C58u)

/** Alias (User Manual Name) for CANR_MO98_AR.
* To use register names with standard convension, please use CANR_MO98_AR.
*/
#define	CANR_MOAR98	(CANR_MO98_AR)

/** \\brief  1C5C, Message Object  Control Register */
#define CANR_MO98_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029C5Cu)

/** Alias (User Manual Name) for CANR_MO98_CTR_STAT.
* To use register names with standard convension, please use CANR_MO98_CTR_STAT.
*/
#define	CANR_MOSTAT98	(CANR_MO98_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO98_CTR_STAT.
* To use register names with standard convension, please use CANR_MO98_CTR_STAT.
*/
#define	CANR_MOCTR98	(CANR_MO98_CTR_STAT)

/** \\brief  1C54, Message Object  Data Register High */
#define CANR_MO98_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C54u)

/** Alias (User Manual Name) for CANR_MO98_DATAH.
* To use register names with standard convension, please use CANR_MO98_DATAH.
*/
#define	CANR_MODATAH98	(CANR_MO98_DATAH)

/** \\brief  1C50, Message Object  Data Register Low */
#define CANR_MO98_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C50u)

/** Alias (User Manual Name) for CANR_MO98_DATAL.
* To use register names with standard convension, please use CANR_MO98_DATAL.
*/
#define	CANR_MODATAL98	(CANR_MO98_DATAL)

/** \\brief  1C40, Message Object  Function Control Register */
#define CANR_MO98_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C40u)

/** Alias (User Manual Name) for CANR_MO98_FCR.
* To use register names with standard convension, please use CANR_MO98_FCR.
*/
#define	CANR_MOFCR98	(CANR_MO98_FCR)

/** \\brief  1C44, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO98_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C44u)

/** Alias (User Manual Name) for CANR_MO98_FGPR.
* To use register names with standard convension, please use CANR_MO98_FGPR.
*/
#define	CANR_MOFGPR98	(CANR_MO98_FGPR)

/** \\brief  1C48, Message Object  Interrupt Pointer Register */
#define CANR_MO98_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C48u)

/** Alias (User Manual Name) for CANR_MO98_IPR.
* To use register names with standard convension, please use CANR_MO98_IPR.
*/
#define	CANR_MOIPR98	(CANR_MO98_IPR)

/** \\brief  1C6C, Message Object  Acceptance Mask Register */
#define CANR_MO99_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF0029C6Cu)

/** Alias (User Manual Name) for CANR_MO99_AMR.
* To use register names with standard convension, please use CANR_MO99_AMR.
*/
#define	CANR_MOAMR99	(CANR_MO99_AMR)

/** \\brief  1C78, Message Object  Arbitration Register */
#define CANR_MO99_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029C78u)

/** Alias (User Manual Name) for CANR_MO99_AR.
* To use register names with standard convension, please use CANR_MO99_AR.
*/
#define	CANR_MOAR99	(CANR_MO99_AR)

/** \\brief  1C7C, Message Object  Control Register */
#define CANR_MO99_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF0029C7Cu)

/** Alias (User Manual Name) for CANR_MO99_CTR_STAT.
* To use register names with standard convension, please use CANR_MO99_CTR_STAT.
*/
#define	CANR_MOSTAT99	(CANR_MO99_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO99_CTR_STAT.
* To use register names with standard convension, please use CANR_MO99_CTR_STAT.
*/
#define	CANR_MOCTR99	(CANR_MO99_CTR_STAT)

/** \\brief  1C74, Message Object  Data Register High */
#define CANR_MO99_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029C74u)

/** Alias (User Manual Name) for CANR_MO99_DATAH.
* To use register names with standard convension, please use CANR_MO99_DATAH.
*/
#define	CANR_MODATAH99	(CANR_MO99_DATAH)

/** \\brief  1C70, Message Object  Data Register Low */
#define CANR_MO99_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029C70u)

/** Alias (User Manual Name) for CANR_MO99_DATAL.
* To use register names with standard convension, please use CANR_MO99_DATAL.
*/
#define	CANR_MODATAL99	(CANR_MO99_DATAL)

/** \\brief  1C60, Message Object  Function Control Register */
#define CANR_MO99_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029C60u)

/** Alias (User Manual Name) for CANR_MO99_FCR.
* To use register names with standard convension, please use CANR_MO99_FCR.
*/
#define	CANR_MOFCR99	(CANR_MO99_FCR)

/** \\brief  1C64, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO99_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029C64u)

/** Alias (User Manual Name) for CANR_MO99_FGPR.
* To use register names with standard convension, please use CANR_MO99_FGPR.
*/
#define	CANR_MOFGPR99	(CANR_MO99_FGPR)

/** \\brief  1C68, Message Object  Interrupt Pointer Register */
#define CANR_MO99_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029C68u)

/** Alias (User Manual Name) for CANR_MO99_IPR.
* To use register names with standard convension, please use CANR_MO99_IPR.
*/
#define	CANR_MOIPR99	(CANR_MO99_IPR)

