keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  112C, Message Object  Acceptance Mask Register */
#define CANR_MO9_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF002912Cu)

/** Alias (User Manual Name) for CANR_MO9_AMR.
* To use register names with standard convension, please use CANR_MO9_AMR.
*/
#define	CANR_MOAMR9	(CANR_MO9_AMR)

/** \\brief  1138, Message Object  Arbitration Register */
#define CANR_MO9_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0029138u)

/** Alias (User Manual Name) for CANR_MO9_AR.
* To use register names with standard convension, please use CANR_MO9_AR.
*/
#define	CANR_MOAR9	(CANR_MO9_AR)

/** \\brief  113C, Message Object  Control Register */
#define CANR_MO9_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF002913Cu)

/** Alias (User Manual Name) for CANR_MO9_CTR_STAT.
* To use register names with standard convension, please use CANR_MO9_CTR_STAT.
*/
#define	CANR_MOSTAT9	(CANR_MO9_CTR_STAT)

/** Alias (User Manual Name) for CANR_MO9_CTR_STAT.
* To use register names with standard convension, please use CANR_MO9_CTR_STAT.
*/
#define	CANR_MOCTR9	(CANR_MO9_CTR_STAT)

/** \\brief  1134, Message Object  Data Register High */
#define CANR_MO9_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0029134u)

/** Alias (User Manual Name) for CANR_MO9_DATAH.
* To use register names with standard convension, please use CANR_MO9_DATAH.
*/
#define	CANR_MODATAH9	(CANR_MO9_DATAH)

/** \\brief  1130, Message Object  Data Register Low */
#define CANR_MO9_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0029130u)

/** Alias (User Manual Name) for CANR_MO9_DATAL.
* To use register names with standard convension, please use CANR_MO9_DATAL.
*/
#define	CANR_MODATAL9	(CANR_MO9_DATAL)

/** \\brief  1120, Message Object  Function Control Register */
#define CANR_MO9_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0029120u)

/** Alias (User Manual Name) for CANR_MO9_FCR.
* To use register names with standard convension, please use CANR_MO9_FCR.
*/
#define	CANR_MOFCR9	(CANR_MO9_FCR)

/** \\brief  1124, Message Object  FIFO/Gateway Pointer Register */
#define CANR_MO9_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0029124u)

/** Alias (User Manual Name) for CANR_MO9_FGPR.
* To use register names with standard convension, please use CANR_MO9_FGPR.
*/
#define	CANR_MOFGPR9	(CANR_MO9_FGPR)

/** \\brief  1128, Message Object  Interrupt Pointer Register */
#define CANR_MO9_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0029128u)

/** Alias (User Manual Name) for CANR_MO9_IPR.
* To use register names with standard convension, please use CANR_MO9_IPR.
*/
#define	CANR_MOIPR9	(CANR_MO9_IPR)

/** \\brief  180, Message Index Register */
#define CANR_MSID0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028180u)

/** \\brief  184, Message Index Register */
#define CANR_MSID1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028184u)

/** \\brief  188, Message Index Register */
#define CANR_MSID2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028188u)

/** \\brief  18C, Message Index Register */
#define CANR_MSID3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF002818Cu)

/** \\brief  190, Message Index Register */
#define CANR_MSID4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028190u)

/** \\brief  194, Message Index Register */
#define CANR_MSID5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028194u)

/** \\brief  198, Message Index Register */
#define CANR_MSID6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF0028198u)

/** \\brief  19C, Message Index Register */
#define CANR_MSID7 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSID*)0xF002819Cu)

/** \\brief  1C0, Message Index Mask Register */
#define CANR_MSIMASK /*lint --e(923)*/ (*(volatile Ifx_CAN_MSIMASK*)0xF00281C0u)

/** \\brief  140, Message Pending Register */
#define CANR_MSPND0 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028140u)

/** \\brief  144, Message Pending Register */
#define CANR_MSPND1 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028144u)

/** \\brief  148, Message Pending Register */
#define CANR_MSPND2 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028148u)

/** \\brief  14C, Message Pending Register */
#define CANR_MSPND3 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF002814Cu)

/** \\brief  150, Message Pending Register */
#define CANR_MSPND4 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028150u)

/** \\brief  154, Message Pending Register */
#define CANR_MSPND5 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028154u)

/** \\brief  158, Message Pending Register */
#define CANR_MSPND6 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF0028158u)

/** \\brief  15C, Message Pending Register */
#define CANR_MSPND7 /*lint --e(923)*/ (*(volatile Ifx_CAN_MSPND*)0xF002815Cu)

/** \\brief  210, Node Bit Timing Register */
#define CANR_N0_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028210u)

/** Alias (User Manual Name) for CANR_N0_BTR.
* To use register names with standard convension, please use CANR_N0_BTR.
*/
#define	CANR_NBTR0	(CANR_N0_BTR)

/** \\brief  200, Node Control Register */
#define CANR_N0_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028200u)

/** Alias (User Manual Name) for CANR_N0_CR.
* To use register names with standard convension, please use CANR_N0_CR.
*/
#define	CANR_NCR0	(CANR_N0_CR)

/** \\brief  214, Node Error Counter Register */
#define CANR_N0_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028214u)

/** Alias (User Manual Name) for CANR_N0_ECNT.
* To use register names with standard convension, please use CANR_N0_ECNT.
*/
#define	CANR_NECNT0	(CANR_N0_ECNT)

/** \\brief  218, Node Frame Counter Register */
#define CANR_N0_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028218u)

/** Alias (User Manual Name) for CANR_N0_FCR.
* To use register names with standard convension, please use CANR_N0_FCR.
*/
#define	CANR_NFCR0	(CANR_N0_FCR)

/** \\brief  208, Node Interrupt Pointer Register */
#define CANR_N0_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028208u)

/** Alias (User Manual Name) for CANR_N0_IPR.
* To use register names with standard convension, please use CANR_N0_IPR.
*/
#define	CANR_NIPR0	(CANR_N0_IPR)

/** \\brief  20C, Node Port Control Register */
#define CANR_N0_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002820Cu)

/** Alias (User Manual Name) for CANR_N0_PCR.
* To use register names with standard convension, please use CANR_N0_PCR.
*/
#define	CANR_NPCR0	(CANR_N0_PCR)

/** \\brief  204, Node Status Register */
#define CANR_N0_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028204u)

/** Alias (User Manual Name) for CANR_N0_SR.
* To use register names with standard convension, please use CANR_N0_SR.
*/
#define	CANR_NSR0	(CANR_N0_SR)

/** \\brief  224, Node Timer A Transmit Trigger Register */
#define CANR_N0_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028224u)

/** Alias (User Manual Name) for CANR_N0_TATTR.
* To use register names with standard convension, please use CANR_N0_TATTR.
*/
#define	CANR_NTATTR0	(CANR_N0_TATTR)

/** \\brief  228, Node Timer B Transmit Trigger Register */
#define CANR_N0_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028228u)

/** Alias (User Manual Name) for CANR_N0_TBTTR.
* To use register names with standard convension, please use CANR_N0_TBTTR.
*/
#define	CANR_NTBTTR0	(CANR_N0_TBTTR)

