keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCan_reg.h
/** \\brief  21C, Node Timer Clock Control Register */
#define CANR_N0_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002821Cu)

/** Alias (User Manual Name) for CANR_N0_TCCR.
* To use register names with standard convension, please use CANR_N0_TCCR.
*/
#define	CANR_NTCCR0	(CANR_N0_TCCR)

/** \\brief  22C, Node Timer C Transmit Trigger Register */
#define CANR_N0_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002822Cu)

/** Alias (User Manual Name) for CANR_N0_TCTTR.
* To use register names with standard convension, please use CANR_N0_TCTTR.
*/
#define	CANR_NTCTTR0	(CANR_N0_TCTTR)

/** \\brief  220, Node Timer Receive Timeout Register */
#define CANR_N0_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028220u)

/** Alias (User Manual Name) for CANR_N0_TRTR.
* To use register names with standard convension, please use CANR_N0_TRTR.
*/
#define	CANR_NTRTR0	(CANR_N0_TRTR)

/** \\brief  310, Node Bit Timing Register */
#define CANR_N1_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028310u)

/** Alias (User Manual Name) for CANR_N1_BTR.
* To use register names with standard convension, please use CANR_N1_BTR.
*/
#define	CANR_NBTR1	(CANR_N1_BTR)

/** \\brief  300, Node Control Register */
#define CANR_N1_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028300u)

/** Alias (User Manual Name) for CANR_N1_CR.
* To use register names with standard convension, please use CANR_N1_CR.
*/
#define	CANR_NCR1	(CANR_N1_CR)

/** \\brief  314, Node Error Counter Register */
#define CANR_N1_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028314u)

/** Alias (User Manual Name) for CANR_N1_ECNT.
* To use register names with standard convension, please use CANR_N1_ECNT.
*/
#define	CANR_NECNT1	(CANR_N1_ECNT)

/** \\brief  318, Node Frame Counter Register */
#define CANR_N1_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028318u)

/** Alias (User Manual Name) for CANR_N1_FCR.
* To use register names with standard convension, please use CANR_N1_FCR.
*/
#define	CANR_NFCR1	(CANR_N1_FCR)

/** \\brief  308, Node Interrupt Pointer Register */
#define CANR_N1_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028308u)

/** Alias (User Manual Name) for CANR_N1_IPR.
* To use register names with standard convension, please use CANR_N1_IPR.
*/
#define	CANR_NIPR1	(CANR_N1_IPR)

/** \\brief  30C, Node Port Control Register */
#define CANR_N1_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002830Cu)

/** Alias (User Manual Name) for CANR_N1_PCR.
* To use register names with standard convension, please use CANR_N1_PCR.
*/
#define	CANR_NPCR1	(CANR_N1_PCR)

/** \\brief  304, Node Status Register */
#define CANR_N1_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028304u)

/** Alias (User Manual Name) for CANR_N1_SR.
* To use register names with standard convension, please use CANR_N1_SR.
*/
#define	CANR_NSR1	(CANR_N1_SR)

/** \\brief  324, Node Timer A Transmit Trigger Register */
#define CANR_N1_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028324u)

/** Alias (User Manual Name) for CANR_N1_TATTR.
* To use register names with standard convension, please use CANR_N1_TATTR.
*/
#define	CANR_NTATTR1	(CANR_N1_TATTR)

/** \\brief  328, Node Timer B Transmit Trigger Register */
#define CANR_N1_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028328u)

/** Alias (User Manual Name) for CANR_N1_TBTTR.
* To use register names with standard convension, please use CANR_N1_TBTTR.
*/
#define	CANR_NTBTTR1	(CANR_N1_TBTTR)

/** \\brief  31C, Node Timer Clock Control Register */
#define CANR_N1_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002831Cu)

/** Alias (User Manual Name) for CANR_N1_TCCR.
* To use register names with standard convension, please use CANR_N1_TCCR.
*/
#define	CANR_NTCCR1	(CANR_N1_TCCR)

/** \\brief  32C, Node Timer C Transmit Trigger Register */
#define CANR_N1_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002832Cu)

/** Alias (User Manual Name) for CANR_N1_TCTTR.
* To use register names with standard convension, please use CANR_N1_TCTTR.
*/
#define	CANR_NTCTTR1	(CANR_N1_TCTTR)

/** \\brief  320, Node Timer Receive Timeout Register */
#define CANR_N1_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028320u)

/** Alias (User Manual Name) for CANR_N1_TRTR.
* To use register names with standard convension, please use CANR_N1_TRTR.
*/
#define	CANR_NTRTR1	(CANR_N1_TRTR)

/** \\brief  410, Node Bit Timing Register */
#define CANR_N2_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028410u)

/** \\brief  400, Node Control Register */
#define CANR_N2_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028400u)

/** \\brief  414, Node Error Counter Register */
#define CANR_N2_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028414u)

/** \\brief  418, Node Frame Counter Register */
#define CANR_N2_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028418u)

/** \\brief  408, Node Interrupt Pointer Register */
#define CANR_N2_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028408u)

/** \\brief  40C, Node Port Control Register */
#define CANR_N2_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002840Cu)

/** \\brief  404, Node Status Register */
#define CANR_N2_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028404u)

/** \\brief  424, Node Timer A Transmit Trigger Register */
#define CANR_N2_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028424u)

/** \\brief  428, Node Timer B Transmit Trigger Register */
#define CANR_N2_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028428u)

/** \\brief  41C, Node Timer Clock Control Register */
#define CANR_N2_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002841Cu)

/** \\brief  42C, Node Timer C Transmit Trigger Register */
#define CANR_N2_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002842Cu)

/** \\brief  420, Node Timer Receive Timeout Register */
#define CANR_N2_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028420u)

/** \\brief  510, Node Bit Timing Register */
#define CANR_N3_BTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_BTR*)0xF0028510u)

/** \\brief  500, Node Control Register */
#define CANR_N3_CR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_CR*)0xF0028500u)

/** \\brief  514, Node Error Counter Register */
#define CANR_N3_ECNT /*lint --e(923)*/ (*(volatile Ifx_CAN_N_ECNT*)0xF0028514u)

/** \\brief  518, Node Frame Counter Register */
#define CANR_N3_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_FCR*)0xF0028518u)

/** \\brief  508, Node Interrupt Pointer Register */
#define CANR_N3_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_IPR*)0xF0028508u)

/** \\brief  50C, Node Port Control Register */
#define CANR_N3_PCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_PCR*)0xF002850Cu)

/** \\brief  504, Node Status Register */
#define CANR_N3_SR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_SR*)0xF0028504u)

/** \\brief  524, Node Timer A Transmit Trigger Register */
#define CANR_N3_TATTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028524u)

/** \\brief  528, Node Timer B Transmit Trigger Register */
#define CANR_N3_TBTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF0028528u)

/** \\brief  51C, Node Timer Clock Control Register */
#define CANR_N3_TCCR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TCCR*)0xF002851Cu)

/** \\brief  52C, Node Timer C Transmit Trigger Register */
#define CANR_N3_TCTTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TTTR*)0xF002852Cu)

/** \\brief  520, Node Timer Receive Timeout Register */
#define CANR_N3_TRTR /*lint --e(923)*/ (*(volatile Ifx_CAN_N_TRTR*)0xF0028520u)

/** \\brief  E8, OCDS Control and Status */
#define CANR_OCS /*lint --e(923)*/ (*(volatile Ifx_CAN_OCS*)0xF00280E8u)

/** \\brief  1C4, Panel Control Register */
#define CANR_PANCTR /*lint --e(923)*/ (*(volatile Ifx_CAN_PANCTR*)0xF00281C4u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCAN_REG_H */
